Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/FormsEngineResource.*.resx
Languages: cy

# Exclusions_SectionTitle
source: Anything that may exclude your organisation from procurement
cy: Gwaharddiadau

# ShareMyInformation_SectionTitle
source: Declare and create a share code
cy: Rhannu fy ngwybodaeth

# Qualifications_SectionTitle
source: Any general qualifications your organisation holds
cy: Cymwysterau

# TradeAssurances_SectionTitle
source: Any trade assurances your organisation holds
cy: Sicrwydd masnach

# FinancialInformation_SectionTitle
source: Your organisation's recent financial information
cy: Gwybodaeth ariannol

# Exclusions_02_Caption
source: <legend class="govuk-fieldset__legend" id="inner-legend">Enter the date the circumstances ended</legend><div class="govuk-hint">For example, 27 3 2007</div>
cy: <legend class="govuk-fieldset__legend" id="inner-legend">Rhowch y dyddiad y daeth yr amgylchiadau i ben</legend><div class="govuk-hint">Er enghraifft, 27 3 2007</div>

# Exclusions_02_Description
source: <div id="isEventEnded-hint" class="govuk-hint">For example, a court decision for environmental misconduct led your organisation or the connected person to stop harming the environment.</div>
cy: <div id="isEventEnded-hint" class="govuk-hint">Er enghraifft, yn dilyn penderfyniad gan y llys am gamymddwyn amgylcheddol, rhoddodd eich sefydliad neu'r unigolyn cysylltiedig y gorau i niweidio'r amgylchedd.</div>

# Exclusions_02_SummaryTitle
source: Date circumstances ended
cy: Dyddiad y daeth yr amgylchiadau i ben

# Exclusions_02_Title
source: Have the circumstances that led to the exclusion ended?
cy: A yw'r amgylchiadau a arweiniodd at y gwaharddiad wedi dod i ben?

# Exclusions_03_Caption
source: Upload a file, You can upload most file types including: PDF, scans, mobile phone photos, Word, Excel and PowerPoint, multimedia and ZIP files that are smaller than 25MB.
cy: Lanlwythwch ffeil. Gallwch lanlwytho'r rhan fwyaf o fathau o ffeiliau, gan gynnwys: PDF, sganiau, lluniau ffôn symudol, Word, Excel a PowerPoint, a ffeiliau ZIP ac amlgyfrwng sy'n llai na 25MB.

# Exclusions_03_Description
source: <div id="documents-hint" class="govuk-hint">A decision from a public authority that was the basis for the offence. For example, documentation from the police, HMRC or the court.</div>
cy: <div id="documents-hint" class="govuk-hint">Penderfyniad gan awdurdod cyhoeddus a oedd yn sail i'r drosedd. Er enghraifft, dogfennaeth gan yr heddlu, CThEF neu'r llys.</div>

# Exclusions_03_SummaryTitle
source: Supporting document
cy: Dogfen ategol

# Exclusions_03_Title
source: Do you have a supporting document to upload?
cy: A oes gennych ddogfen ategol i'w lanlwytho?

# Exclusions_04_Description
source: <div class="govuk-hint"><p class="govuk-body">You must tell us what you or the person who was subject to the event:</p><ul class="govuk-list govuk-list--bullet"><li>have done to prove it was taken seriously - for example, paid a fine or compensation</li><li>have done to stop the circumstances that caused it from happening again - for example, taking steps like changing staff or management or putting procedures or training in place</li><li>are doing to monitor the steps that were taken - for example, regular meetings</li></ul></div>
cy: <div class="govuk-hint"><p class="govuk-body">Mae'n rhaid i chi ddweud wrthym beth rydych chi neu'r unigolyn a oedd yn rhan o'r digwyddiad:</p><ul class="govuk-list govuk-list--bullet"><li>wedi'i wneud i brofi ei fod wedi cael ei gymryd o ddifrif – er enghraifft, talu dirwy neu iawndal</li><li>wedi'i wneud i atal yr amgylchiadau a'i hachosodd rhag digwydd eto – er enghraifft, cymryd camau fel newid staff neu reolwyr neu roi gweithdrefnau neu hyfforddiant ar waith</li><li>yn ei wneud i fonitro'r camau a gymerwyd – er enghraifft, cyfarfodydd rheolaidd</li></ul></div>

# Exclusions_04_SummaryTitle
source: Exclusion being managed
cy: Gwaharddiad yn cael ei reoli

# Exclusions_04_Title
source: How the exclusion is being managed
cy: Sut mae'r gwaharddiad yn cael ei reoli

# Exclusions_05_Description
source: <div class="govuk-hint">Give us your explanation of the event. For example, any background information you can give about what happened or what caused the exclusion.</div>
cy: <div class="govuk-hint">Rhowch eich esboniad o'r digwyddiad. Er enghraifft, unrhyw wybodaeth gefndir y gallwch ei rhoi am yr hyn a ddigwyddodd neu'r hyn a achosodd y gwaharddiad.</div>

# Exclusions_05_SummaryTitle
source: Exclusion in detail
cy: Y gwaharddiad yn fanwl

# Exclusions_05_Title
source: Describe the exclusion in more detail
cy: Disgrifiwch y gwaharddiad yn fanylach

# Exclusions_06_Description
source: <div class="govuk-hint">Where the contracting authority can contact someone about the exclusion</div>
cy: <div class="govuk-hint">Ble y gall yr awdurdod contractio gysylltu â rhywun am y gwaharddiad</div>

# Exclusions_06_SummaryTitle
source: Contact email
cy: E-bost cyswllt

# Exclusions_06_Title
source: Enter an email address
cy: Rhowch gyfeiriad e-bost

# Exclusions_07_SummaryTitle
source: UK exclusion
cy: Gwaharddiad yn y DU

# Exclusions_07_Title
source: Did this exclusion happen in the UK?
cy: A ddigwyddodd y gwaharddiad yn y DU?

# Exclusions_08_Description
source: <div class="govuk-hint"><p>Only select one exclusion. You can add another at the end if you need to.</p><p>If this exclusion happened outside the UK, select the equivalent offence in the UK for where it took place.</p></div>
cy: <div class="govuk-hint"><p>Dewiswch un gwaharddiad yn unig. Gallwch ychwanegu un arall ar y diwedd os bydd angen.</p><p>Os digwyddodd y gwaharddiad hwn y tu allan i'r DU, dewiswch y drosedd gyfatebol yn y DU ar gyfer ble y digwyddodd.</p></div>

# Exclusions_08_Options_Groups_01_Caption
source: Mandatory exclusions
cy: Gwaharddiadau gorfodol

# Exclusions_08_Options_Groups_01_Choices_01_Title
source: Adjustments for tax arrangements that are abusive
cy: Addasiadau ar gyfer trefniadau treth sy'n gamdriniol

# Exclusions_08_Options_Groups_01_Choices_02_Title
source: Competition law infringements
cy: Achosion o dorri cyfraith cystadleuaeth

# Exclusions_08_Options_Groups_01_Choices_03_Title
source: Defeat in respect of notifiable tax arrangements
cy: Methiant mewn perthynas â threfniadau treth hysbysadwy

# Exclusions_08_Options_Groups_01_Choices_04_Title
source: Failure to cooperate with an investigation
cy: Methiant i gydymffurfio ag ymchwiliad

# Exclusions_08_Options_Groups_01_Choices_05_Title
source: Finding by HMRC, in exercise of its powers in respect of VAT, of abusive practice
cy: CThEF yn canfod ymarfer camdriniol wrth arfer ei bwerau mewn perthynas â TAW

# Exclusions_08_Options_Groups_01_Choices_06_Title
source: Penalties for transactions connected with VAT fraud and evasion of tax or duty
cy: Cosbau ar gyfer trafodion sy'n gysylltiedig â thwyll TAW ac osgoi talu treth neu doll

# Exclusions_08_Options_Groups_01_Choices_07_Title
source: Penalties payable for errors in tax documentation and failure to notify, and certain VAT and excise
cy: Cosbau sy'n daladwy am wallau mewn dogfennaeth treth a methiant i hysbysu, a TAW a thollau

# Exclusions_08_Options_Groups_01_Hint
source: Defined in <a target=\"_blank\" href=\"https://www.legislation.gov.uk/ukpga/2023/54/schedule/6\">schedule 6 of the Procurement Act 2023 (opens in new tab).</a>
cy: Fel y nodir yn <a target=\"_blank\" href=\"https://www.legislation.gov.uk/ukpga/2023/54/schedule/6\">atodlen 6 i Ddeddf Caffael 2023 (bydd yn agor mewn tab newydd).</a>

# Exclusions_08_Options_Groups_01_Name
source: Penalties and other events
cy: Cosbau a digwyddiadau eraill

# Exclusions_08_Options_Groups_02_Caption
source: Mandatory exclusions
cy: Gwaharddiadau gorfodol

# Exclusions_08_Options_Groups_02_Choices_01_Title
source: Ancillary offences - aiding, abetting, encouraging or assisting crime
cy: Troseddau ategol – helpu, annog neu gynorthwyo trosedd

# Exclusions_08_Options_Groups_02_Choices_02_Title
source: Cartel offences
cy: Troseddau cartel

# Exclusions_08_Options_Groups_02_Choices_03_Title
source: Corporate manslaughter or homicide
cy: Dynladdiad neu laddiad corfforaethol

# Exclusions_08_Options_Groups_02_Choices_04_Title
source: Labour market, slavery and human trafficking offences
cy: Troseddau marchnad lafur, caethwasiaeth a masnachu pobl

# Exclusions_08_Options_Groups_02_Choices_05_Title
source: Organised crime
cy: Troseddau cyfundrefnol

# Exclusions_08_Options_Groups_02_Choices_06_Title
source: Tax offences
cy: Troseddau treth

# Exclusions_08_Options_Groups_02_Choices_07_Title
source: Terrorism and offences having a terrorist connection
cy: Terfysgaeth a throseddau â chysylltiad terfysgol

# Exclusions_08_Options_Groups_02_Choices_08_Title
source: Theft, fraud and bribery
cy: Lladrad, twyll a llwgrwobrwyaeth

# Exclusions_08_Options_Groups_02_Hint
source: Defined in <a target=\"_blank\" href=\"https://www.legislation.gov.uk/ukpga/2023/54/schedule/6\">schedule 6 of the Procurement Act 2023 (opens in new tab).</a>
cy: Fel y nodir yn <a target=\"_blank\" href=\"https://www.legislation.gov.uk/ukpga/2023/54/schedule/6\">atodlen 6 i Ddeddf Caffael 2023 (bydd yn agor mewn tab newydd).</a>

# Exclusions_08_Options_Groups_02_Name
source: Convictions
cy: Euogfarnau

# Exclusions_08_Options_Groups_03_Caption
source: Discretionary exclusions
cy: Gwaharddiadau dewisol

# Exclusions_08_Options_Groups_03_Choices_01_Title
source: Acting improperly in procurement
cy: Gweithredu'n amhriodol ym maes caffael

# Exclusions_08_Options_Groups_03_Choices_02_Title
source: Breach of contract and poor performance
cy: Torri contract a pherfformiad gwael

# Exclusions_08_Options_Groups_03_Choices_03_Title
source: Environmental misconduct
cy: Camymddwyn amgylcheddol

# Exclusions_08_Options_Groups_03_Choices_04_Title
source: Infringement of Competition Act 1998, under Chapter II prohibition
cy: Achos o dorri Deddf Cystadleuaeth 1998, o dan waharddiad Pennod II

# Exclusions_08_Options_Groups_03_Choices_05_Title
source: Insolvency or bankruptcy
cy: Ansolfedd neu fethdalu

# Exclusions_08_Options_Groups_03_Choices_06_Title
source: Labour market misconduct
cy: Camymddwyn yn y farchnad lafur

# Exclusions_08_Options_Groups_03_Choices_07_Title
source: Potential competition and competition law infringements
cy: Achosion posibl o dorri cystadleuaeth a chyfraith cystadleuaeth

# Exclusions_08_Options_Groups_03_Choices_08_Title
source: Professional misconduct
cy: Camymddwyn proffesiynol

# Exclusions_08_Options_Groups_03_Choices_09_Title
source: Suspension or ceasing to carry on all or a substantial part of a business
cy: Atal neu beidio â pharhau â busnes neu ran sylweddol ohono

# Exclusions_08_Options_Groups_03_Hint
source: Defined in <a target=\"_blank\" href=\"https://www.legislation.gov.uk/ukpga/2023/54/schedule/7\">schedule 7 of the Procurement Act 2023 (opens in new tab).</a>
cy: Fel y nodir yn <a target=\"_blank\" href=\"https://www.legislation.gov.uk/ukpga/2023/54/schedule/7\">atodlen 7 i Ddeddf Caffael 2023 (bydd yn agor mewn tab newydd).</a>

# Exclusions_08_Options_Groups_03_Name
source: Discretionary exclusions
cy: Gwaharddiadau dewisol

# Exclusions_08_SummaryTitle
source: Exclusion applies
cy: Gwaharddiad yn gymwys

# Exclusions_08_Title
source: Select which exclusion applies
cy: Dewiswch pa waharddiad sy'n gymwys

# Exclusions_09_Description
source: <div class="govuk-inset-text govuk-!-margin-top-0">If it applies to someone not listed, you must go back to the ‘Add a connected person’ section and add them.</div>
cy: <div class="govuk-inset-text govuk-!-margin-top-0">Os yw'n gymwys i rywun nad yw wedi'i restru, rhaid i chi i fynd yn ôl i'r adran ‘Ychwanegu person cysylltiedig’ i'w ychwanegu.</div>

# Exclusions_09_SummaryTitle
source: Exclusion applies to
cy: Mae'r gwaharddiad yn gymwys i

# Exclusions_09_Title
source: Select who the exclusion applies to
cy: Dewiswch pwy y mae'r gwaharddiad yn gymwys iddo

# Exclusions_10_Caption
source: Website address
cy: Cyfeiriad gwefan

# Exclusions_10_Description
source: <div class="govuk-hint">For example, the outcome of a court decision for a conviction or other event</div>
cy: <div class="govuk-hint">Er enghraifft, canlyniad penderfyniad gan y llys am euogfarn neu ddigwyddiad arall</div>

# Exclusions_10_SummaryTitle
source: Recorded on a website
cy: Cofnodwyd ar wefan

# Exclusions_10_Title
source: Was the decision recorded on a public authority website?
cy: A gafodd y penderfyniad ei gofnodi ar wefan awdurdod cyhoeddus?

# Exclusions_Configuration_AddAnotherAnswerLabel
source: Add another exclusion?
cy: Ychwanegu gwaharddiad arall?

# Exclusions_Configuration_FurtherQuestionsExemptedHeading
source: Do you have any exclusions to add for your organisation or a connected person?
cy: A oes gennych unrhyw waharddiadau i'w hychwanegu ar gyfer eich sefydliad neu unigolyn cysylltiedig?

# Exclusions_Configuration_RemoveConfirmationHeading
source: Are you sure you want to remove this exclusion?
cy: Ydych chi’n si?r eich bod am ddileu’r gwaharddiad hwn?

# FinancialInformation_01_SummaryTitle
source: Date of financial year end
cy: Dyddiad diwedd y flwyddyn ariannol

# FinancialInformation_01_Title
source: What is the financial year end date for the information you uploaded?
cy: Beth yw dyddiad diwedd y flwyddyn ariannol ar gyfer y wybodaeth a lanlwythwyd gennych?

# FinancialInformation_02_Description
source: <p class="govuk-body">Your most recent two financial years, or your most recent financial year if you do not have two years.</p><p class="govuk-body">If you do not have a full year of accounts, upload a statement showing your organisation's financial standing.</p>
cy: <p class="govuk-body">Lanlwythwch eich dwy flwyddyn ariannol ddiweddaraf. Os nad oes gennych ddwy, lanlwythwch eich blwyddyn ariannol ddiweddaraf.</p>

# FinancialInformation_02_SummaryTitle
source: Document uploaded
cy: Dogfen wedi'i lanlwytho

# FinancialInformation_02_Title
source: Upload your organisation's accounts or financial statements
cy: Lanlwytho eich cyfrifon

# FinancialInformation_03_SummaryTitle
source: Audited accounts
cy: Cyfrifon archwiliedig

# FinancialInformation_03_Title
source: Were your accounts audited?
cy: Ble y cafodd eich cyfrifon eu harchwilio?

# FinancialInformation_04_Description
source: <p class="govuk-body">You'll need to upload accounts or statements for your organisation's most recent two financial years, or your most recent financial year if you do not have two years.</p><p class="govuk-body">If you do not have a full year of accounts, you can upload a statement showing your organisation's financial standing.</p><p class="govuk-body">You'll need to enter the financial year end date for the information you upload.</p>
cy: <p class="govuk-body">Bydd angen i chi lanlwytho cyfrifon neu gyfriflenni ar gyfer eich dwy flwyddyn ariannol ddiweddaraf.</p><p class="govuk-body">Os nad oes gennych ddwy flwyddyn, gallwch lanlwytho eich blwyddyn ariannol ddiweddaraf.</p><p class="govuk-body">Bydd angen i chi roi dyddiad diwedd y flwyddyn ariannol ar gyfer y wybodaeth a lanlwythwyd gennych.</p>

# FinancialInformation_04_Title
source: The financial information you'll need
cy: Y wybodaeth ariannol y bydd ei hangen arnoch

# FinancialInformation_Configuration_AddAnotherAnswerLabel
source: Add another file?
cy: Ychwanegu ffeil arall?

# FinancialInformation_Configuration_RemoveConfirmationHeading
source: Are you sure you want to remove this file?
cy: Ydych chi’n si?r eich bod am ddileu’r ffeil hon?

# Global_CheckYourAnswers
source: Check your answers
cy: Gwiriwch eich atebion

# Qualifications_01_Description
source: <div class="govuk-hint">Enter one qualification at a time. You can add another at the end if you need to. For example, ISO 45001 Health and Safety Management.</div>
cy: <div class="govuk-hint">Rhowch un cymhwyster ar y tro. Gallwch ychwanegu un arall ar y diwedd os bydd angen. Er enghraifft, ISO 45001 Rheoli Iechyd a Diogelwch.</div>

# Qualifications_01_SummaryTitle
source: Qualification name
cy: Enw'r cymhwyster

# Qualifications_01_Title
source: Enter the qualification name
cy: Rhowch enw’r cymhwyster

# Qualifications_02_Description
source: <div class="govuk-hint">Enter the name of the person or body. For example, ISO or Constructionline.</div>
cy: <div class="govuk-hint">Rhowch enw'r person neu gorff. Er enghraifft, ISO, Constructionline neu Gynllun Sicrwydd y Tractor Coch.</div>

# Qualifications_02_SummaryTitle
source: Awarded by
cy: Dyfarnwyd gan

# Qualifications_02_Title
source: Who awarded the qualification?
cy: Pwy a ddyfarnodd y cymhwyster?

# Qualifications_03_SummaryTitle
source: Date awarded
cy: Y dyddiad dyfarnu

# Qualifications_03_Title
source: What date was the qualification awarded?
cy: Pa ddyddiad y dyfarnwyd y cymhwyster?

# Qualifications_Configuration_AddAnotherAnswerLabel
source: Add another qualification?
cy: Ychwanegu cymhwyster arall?

# Qualifications_Configuration_FurtherQuestionsExemptedHeading
source: Do you want to add any relevant qualifications?
cy: Hoffech chi ychwanegu unrhyw gymwysterau perthnasol?

# Qualifications_Configuration_FurtherQuestionsExemptedHint
source: These are general qualifications for business and trade, not procurement specific. Adding them will provide evidence of your suitability to contracting authorities and support any bids you submit. For example, ISO certification.
cy: Cymwysterau cyffredinol ar gyfer busnes a masnach yw'r rhain, nid caffael yn benodol. Drwy eu hychwanegu, byddwch yn rhoi tystiolaeth o'ch addasrwydd i awdurdodau contractio ac yn cefnogi unrhyw gynigion y byddwch yn eu cyflwyno. Er enghraifft, ardystiad ISO.

# Qualifications_Configuration_RemoveConfirmationHeading
source: Are you sure you want to remove this qualification?
cy: Ydych chi’n si?r eich bod am ddileu’r cymhwyster hwn?

# TradeAssurance_01_Description
source: <div class="govuk-hint">Enter the name of the person or body. You can add another at the end if you need to. For example, Red Tractor Assurance or Quality Meat Scotland (QMS) Assurance.</div>
cy: <div class="govuk-hint">Rhowch enw'r person neu gorff. Gallwch ychwanegu un arall ar y diwedd os bydd angen. Er enghraifft, Cynllun Sicrwydd y Tractor Coch neu Quality Meat Scotland (QMS) Assurance.</div>

# TradeAssurance_01_SummaryTitle
source: Awarded by
cy: Dyfarnwyd gan

# TradeAssurance_01_Title
source: Who awarded the trade assurance?
cy: Pwy a ddyfarnodd y sicrwydd masnach?

# TradeAssurance_02_Caption
source: Trade assurance reference number
cy: Rhif cyfeirnod sicrwydd masnach

# TradeAssurance_02_SummaryTitle
source: Reference number
cy: Cyfeirnod

# TradeAssurance_02_Title
source: Do you know the reference number?
cy: Ydych chi'n gwybod y rhif cyfeirnod?

# TradeAssurance_03_SummaryTitle
source: Date awarded
cy: Y dyddiad dyfarnu

# TradeAssurance_03_Title
source: What date was the trade assurance awarded?
cy: Ar ba ddyddiad y dyfarnwyd y sicrwydd masnach?

# TradeAssurances_Configuration_AddAnotherAnswerLabel
source: Add another trade assurance?
cy: Ychwanegu sicrwydd masnach arall?

# TradeAssurances_Configuration_FurtherQuestionsExemptedHeading
source: Do you want to add any trade assurances?
cy: Hoffech chi ychwanegu unrhyw sicrwydd masnach?

# TradeAssurances_Configuration_FurtherQuestionsExemptedHint
source: These are trade assurances for business and trade, not procurement specific. Adding them will provide confidence to contracting authorities and support any bids you submit. For example, Red Tractor Assurance covers food safety, traceability, animal welfare and environmental protection.
cy: Sicrwydd masnach ar gyfer busnes a masnach yw'r rhain, nid caffael yn benodol. Drwy eu hychwanegu, byddwch yn rhoi hyder i awdurdodau contractio ac yn cefnogi unrhyw gynigion y byddwch yn eu cyflwyno. Er enghraifft, mae Cynllun Sicrwydd y Tractor Coch yn cwmpasu diogelwch bwyd, olrhain, lles anifeiliaid a diogelwch amgylcheddol.

# TradeAssurances_Configuration_RemoveConfirmationHeading
source: Are you sure you want to remove this trade assurance?
cy: Ydych chi’n si?r eich bod am ddileu’r sicrwydd masnach hwn?

# Global_Enter_Your_Email_Address
source: Enter your email address
cy: Rhowch eich cyfeiriad e-bost

# Global_Enter_Your_Name
source: Enter your name
cy: Rhowch eich enw

# Global_Enter_Your_Job_Title
source: Enter your job title
cy: Rhowch deitl eich swydd

# Global_Enter_Your_Postal_Address
source: Enter your postal address
cy: Rhowch eich cyfeiriad post

# Share_My_Information_Consortium_SectionTitle
source: Share my information consortium
cy: Rhannu fy nghonsortiwm gwybodaeth

# Steel_SectionTitle
source: Steel module
cy: Modiwl dur

# SteelQuestion_01_Title
source: Submitting your steel information
cy: Cyflwyno eich gwybodaeth am ddur

# SteelQuestion_01_Description
source: <p class="govuk-body">This module refers to the procurement and use of steel products in government projects. It focuses on compliance with UK regulations regarding sourcing, quality, and sustainability. For further information read <a target="_blank" href="https://www.gov.uk/government/publications/ppn-010-procuring-steel-in-government-contracts/ppn-010-revised-guidance-on-procuring-steel-in-government-contracts-html">PPN 010: Revised guidance on procuring steel in government contracts (opens in new tab)</a>.</p> <p class="govuk-body govuk-!-margin-top-2">You are only required to complete this module if requested by the contracting authority you are bidding for. Failure to complete this module may result in your tenders being deemed insufficient where PPN 010 has been applied.</p> <h2 class="govuk-heading-m">The information you&#39;ll need</h2> <p class="govuk-body">You&#39;ll need to provide information on steel specific supply chain projects or programmes. This may include relevant examples of:</p> <ul class="govuk-list govuk-list--bullet"> <li>management systems, policies, standards and procedures</li> <li>sustainable practice</li> <li>health and safety breaches</li> </ul>
cy: <p class="govuk-body">Mae'r modiwl canlynol yn cyfeirio at gaffael a defnyddio cynhyrchion dur ym mhrosiectau'r llywodraeth. Mae'n canolbwyntio ar gydymffurfio â rheoliadau'r DU mewn perthynas â chyrchu, ansawdd a chynaliadwyedd. Am ragor o wybodaeth, darllenwch <a target="_blank" href="https://www.gov.uk/government/publications/ppn-010-procuring-steel-in-government-contracts/ppn-010-revised-guidance-on-procuring-steel-in-government-contracts-html">PPN 010: Canllawiau diwygiedig ar gaffael dur yng nghontractau'r llywodraeth (bydd yn agor mewn tab newydd)</a>.</p> <p class="govuk-body govuk-!-margin-top-2">Mae ond os bydd yr awdurdod contractio rydych yn gwneud cynnig iddo yn gofyn i chi wneud hynny y bydd angen i chi gwblhau'r modiwl hwn. Gall methu â chwblhau'r modiwl hwn arwain at ystyried bod eich tendrau yn annigonol lle mae PPN 010 wedi'i gymhwyso.</p> <h2 class="govuk-heading-m">Y wybodaeth y bydd ei hangen arnoch</h2> <p class="govuk-body">Bydd angen i chi ddarparu gwybodaeth am brosiectau neu raglenni cadwyn gyflenwi penodol i ddur Gall hyn gynnwys enghreifftiau perthnasol o'r canlynol:</p> <ul class="govuk-list govuk-list--bullet"> <li>systemau rheoli, polisïau, safonau a gweithdrefnau</li> <li>arferion cynaliadwy</li> <li>achosion o dorri deddfwriaeth iechyd a diogelwch</li> </ul>

# SteelQuestion_02_Title
source: Supply chain management in steel procurement
cy: Rheoli'r gadwyn gyflenwi ym maes caffael dur

# SteelQuestion_02_SummaryTitle
source: Supply chain management
cy: Rheoli'r Gadwyn Gyflenwi
