Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/FormsEngineResource.*.resx
Languages: cy

# SteelQuestion_02_Description
source: <p class="govuk-body govuk-!-font-weight-bold">Where relevant, give details of steel projects or programmes where you have shown:</p> <ul class="govuk-list govuk-list--bullet"> <li>effective management of your steel supply chain systems, policies, standards and procedures</li> <li>compliance with relevant legislation</li> <li>sustainable steel supply (including your supply chain)</li> <li>management of health and safety breaches in the last 5 years, in the country where you work, for your organisation and supply chain members</li> </ul> <details class="govuk-details"> <summary class="govuk-details__summary"> <span class="govuk-details__summary-text"> What is sustainable steel supply? </span> </summary> <div class="govuk-details__text"> Sustainable supply of steel refers to the sourcing and production of steel that is environmentally, socially and economically responsible. It involves practices that limit environmental impact, such as reducing carbon emissions whilst ensuring fair labour practices and supporting local communities. </div> </details> <p class="govuk-hint">If you would like to provide this information in a document format, enter “not applicable” below and continue to the next question</p>
cy: <p class="govuk-body govuk-!-font-weight-bold">Lle y bo'n berthnasol, rhowch fanylion prosiectau neu raglenni dur lle rydych chi wedi dangos:</p> <ul class="govuk-list govuk-list--bullet"> <li>rheolaeth effeithiol o'ch systemau cadwyn gyflenwi dur, polisïau, safonau a gweithdrefnau</li> <li>cydymffurfiaeth â deddfwriaeth berthnasol</li> <li>cyflenwi dur yn gynaliadwy (gan gynnwys eich cadwyn gyflenwi)</li> <li>rheoli achosion o dorri iechyd a diogelwch yn ystod y 5 mlynedd diwethaf, yn y wlad lle rydych yn gweithio, i'ch sefydliad ac i aelodau eich cadwyn gyflenwi</li> </ul> <details class="govuk-details"> <summary class="govuk-details__summary"> <span class="govuk-details__summary-text"> Beth yw cyflenwad dur yn gynaliadwy? </span> </summary> <div class="govuk-details__text"> Mae cyflenwi dur yn gynaliadwy yn cyfeirio at y broses o gael gaffael dur a chynhyrchu dur sy'n gyfrifol yn amgylcheddol, cymdeithasol ac economaidd. Mae'n cynnwys arferion sy'n cyfyngu ar yr effaith ar yr amgylchedd, fel lleihau allyriadau carbon, gan sicrhau arferion llafur teg a chefnogi cymunedau lleol. </div> </details> <p class="govuk-hint">Os hoffech ddarparu'r wybodaeth hon ar ffurf dogfen, ewch ymlaen i'r cwestiwn nesaf</p>

# SteelQuestion_03_Title
source: Do you have supporting documents to upload?
cy: A oes gennych ddogfennau ategol i'w lanlwytho?

# SteelQuestion_03_SummaryTitle
source: Supporting document
cy: Dogfen ategol

# Steel_Configuration_FurtherQuestionsExemptedHint
source: You'll need to provide information on steel specific supply chain projects or programmes. This may include relevant examples of:
cy: Bydd angen i chi ddarparu gwybodaeth am brosiectau neu raglenni cadwyn gyflenwi penodol i ddur Gall hyn gynnwys enghreifftiau perthnasol o'r canlynol:

# DataProtection_01_Title
source: Submitting your data protection information
cy: Cyflwyno eich gwybodaeth am ddiogelu data

# DataProtection_01_Description
source: <p class="govuk-body"> Data protection involves safeguarding personal data from misuse, loss, or unauthorised access. This module focuses on compliance with data protection laws (such as GDPR) and how a supplier manages, stores, and processes personal information. </p> <p class="govuk-body"> You are only required to complete this module if requested by the contracting authority you are bidding for. Failure to complete this module may result in your tenders being deemed insufficient where PPN 020 has been applied. For more information read <a href="https://www.gov.uk/government/publications/ppn-020-guidance-on-data-protection-legislation/ppn-020-guidance-on-data-protection-legislation-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 020: Guidance on data protection legislation (opens in a new tab) </a>. </p> <h2 class="govuk-heading-m">The information you'll need</h2> <div class="govuk-body">You'll need to provide information on data protection within your organisation. This may include your:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li>resource confirmation</li> <li>facilities and measures in place to ensure compliance with data protection laws</li> </ul> </div>
cy: <p class="govuk-body"> Mae a wnelo diogelu data â diogelu data personol rhag cael eu camddefnyddio, eu colli neu fynediad anawdurdodedig. Mae'r modiwl hwn yn canolbwyntio ar gydymffurfio â chyfreithiau diogelu data (fel GDPR) a sut mae cyflenwr yn rheoli, yn storio ac yn prosesu gwybodaeth bersonol. </p> <p class="govuk-body"> Mae ond os bydd yr awdurdod contractio rydych yn gwneud cynnig iddo yn gofyn i chi wneud hynny y bydd angen i chi gwblhau'r modiwl hwn. Gall methu â chwblhau'r modiwl hwn arwain at ystyried bod eich tendrau yn annigonol lle mae PPN 020 wedi'i gymhwyso. Am ragor o wybodaeth, darllenwch <a href="https://www.gov.uk/government/publications/ppn-020-guidance-on-data-protection-legislation/ppn-020-guidance-on-data-protection-legislation-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 020: Canllaw ar ddeddfwriaeth diogelu data (bydd yn agor mewn tab newydd) </a>. </p> <h2 class="govuk-heading-m">Y wybodaeth y bydd ei hangen arnoch</h2> <div class="govuk-body">Bydd angen i chi ddarparu gwybodaeth am ddiogelu data yn eich sefydliad. Gall hyn gynnwys:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li>cadarnhad ynghylch adnoddau</li> <li>cael cyfleusterau a mesurau ar waith i sicrhau cydymffurfiaeth â chyfreithiau diogelu data</li> </ul> </div>

# DataProtection_02_Title
source: Do you have the resources to ensure compliance with UK GDPR?
cy: A oes gennych yr adnoddau i sicrhau cydymffurfiaeth â GDPR y DU?

# DataProtection_02_SummaryTitle
source: Resource confirmation for compliance
cy: Cadarnhau adnoddau ar gyfer cydymffurfiaeth

# DataProtection_02_Description
source: <div class="govuk-hint govuk-!-margin-top-2"> You should consider both your human and technical resources </div>
cy: <div class="govuk-hint govuk-!-margin-top-2"> Dylech ystyried eich adnoddau dynol a thechnegol </div>

# DataProtection_03_Title
source: When will you have the resources to ensure compliance with UK GDPR?
cy: Pryd bydd gennych yr adnoddau i sicrhau cydymffurfiaeth â GDPR y DU?

# DataProtection_03_SummaryTitle
source: Resource requirements status
cy: Statws gofynion o ran adnoddau

# DataProtection_03_Description
source: <div class="govuk-hint govuk-!-margin-top-2"> You should consider both your human and technical resources </div>
cy: <div class="govuk-hint govuk-!-margin-top-2"> Dylech ystyried eich adnoddau dynol a thechnegol </div>

# DataProtection_04_Title
source: How do you ensure compliance with UK data protection law?
cy: Sut mae sicrhau cydymffurfiaeth â chyfraith diogelu data y DU?

# DataProtection_04_SummaryTitle
source: Facilities and measures details
cy: Manylion cyfleusterau a mesurau

# DataProtection_04_Description
source: <div class="govuk-body govuk-!-margin-top-2">Please provide details of the technical facilities and measures (including systems and processes) you have in place, or will have in place by contract award, to ensure compliance with UK data protection law and to ensure the protection of the rights of data subjects. Your response should include, but should not be limited to facilities and measures:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li>to ensure ongoing confidentiality, integrity, availability and resilience of processing systems and services;</li> <li>to comply with the rights of data subjects in respect of receiving privacy information, and access, rectification, deletion and portability of personal data;</li> <li>to ensure that any consent based processing meets standards of active, informed consent, and that such consents are recorded and auditable;</li> <li>to ensure legal safeguards are in place to legitimise transfers of personal data outside the UK (if such transfers will take place); to maintain records of personal data processing activities; and to regularly test, assess and evaluate the effectiveness of the above measures.</li> </ul> </div> <p class="govuk-hint">If you would like to provide this information in a document format, enter “not applicable” below and continue to the next question</p>
cy: <div class="govuk-body govuk-!-margin-top-2">Dylai eich ymateb gynnwys y cyfleusterau a'r prosesau technegol sydd gennych ar waith, neu a fydd ar waith erbyn i'r contract gael ei ddyfarnu, er mwyn sicrhau'r canlynol:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li>caiff hawliau gwrthrychau data eu diogelu</li> <li>caiff systemau prosesu a gwasanaethau eu cadw'n ddiogel ac yn ddibynadwy</li> <li>caiff hawliau unigolion i dderbyn gwybodaeth am breifatrwydd ac i gael gafael ar ddata personol, eu cywiro, eu dileu a'u trosglwyddo eu diogelu</li> <li>mae cydsyniad ar gyfer prosesu data personol yn glir a chaiff ei gofnodi'n briodol</li> <li>mae amddiffyniadau cyfreithiol ar waith i drosglwyddo data personol y tu allan i'r DU (lle y bo'n berthnasol)</li> <li>caiff cofnodion o weithgareddau prosesu data personol eu cynnal</li> <li>caiff y mesurau uchod eu profi a'u hadolygu'n rheolaidd </li> </ul> </div> <p class="govuk-hint">Os hoffech ddarparu'r wybodaeth hon ar ffurf dogfen, ewch ymlaen i'r cwestiwn nesaf</p>

# DataProtection_05_Title
source: Do you have supporting documents to upload?
cy: A oes gennych ddogfennau ategol i'w lanlwytho?

# DataProtection_05_SummaryTitle
source: Document upload
cy: Lanlwytho Dogfen

# HealthAndSafetyQuestion_01_Title
source: Submitting your health and safety information
cy: Cyflwyno eich gwybodaeth am iechyd a diogelwch

# HealthAndSafetyQuestion_01_Description
source: <p class="govuk-body"> Health and safety regulations ensure the well-being of employees and the public in the workplace. Some tenders may require you to provide information about your health and safety policies, risk assessments, and training provided to prevent accidents and injuries. </p> <p class="govuk-body govuk-!-margin-top-2"> You are only required to complete this module if requested by the contracting authority you are bidding for. Failure to complete this module may result in your tenders being deemed insufficient where health and safety information is required. </p> <h2 class="govuk-heading-m govuk-!-margin-top-4"> The information you'll need </h2> <p class="govuk-body govuk-!-margin-top-2 govuk-!-margin-bottom-4"> You'll need to provide information about your organisation's health and safety management and risk procedures. </p>
cy: <p class="govuk-body"> Mae rheoliadau iechyd a diogelwch yn sicrhau llesiant cyflogeion a'r cyhoedd yn y gweithle. Gall rhai tendrau ofyn i chi ddarparu gwybodaeth am eich polisïau iechyd a diogelwch, asesiadau risg a'r hyfforddiant a ddarperir er mwyn atal damweiniau ac anafiadau. </p> <p class="govuk-body govuk-!-margin-top-2"> Mae ond os bydd yr awdurdod contractio rydych yn gwneud cynnig iddo yn gofyn i chi wneud hynny y bydd angen i chi gwblhau'r modiwl hwn. Gall methu â chwblhau'r modiwl hwn arwain at ystyried bod eich tendrau yn annigonol lle mae gwybodaeth am iechyd a diogelwch yn ofynnol. </p> <h2 class="govuk-heading-m govuk-!-margin-top-4"> Y wybodaeth fydd ei hangen arnoch </h2> <p class="govuk-body govuk-!-margin-top-2 govuk-!-margin-bottom-4"> Bydd angen i chi ddarparu gwybodaeth am reolaeth iechyd a diogelwch a gweithdrefnau risg eich sefydliad. </p>

# HealthAndSafetyQuestion_02_Title
source: How do you manage health and safety?
cy: Sut ydych yn rheoli iechyd a diogelwch?

# HealthAndSafetyQuestion_02_SummaryTitle
source: Health and safety management
cy: Rheoli Iechyd a Diogelwch

# HealthAndSafetyQuestion_02_Description
source: <p class="govuk-body"> Include examples of how you handle significant risks (like the use of contractors, where relevant). </p> <div class="govuk-hint govuk-!-margin-top-2"> If you would like to provide this information in a document format, enter “not applicable” below and continue to the next question. </div>
cy: <p class="govuk-body"> Cofiwch gynnwys enghreifftiau o'r ffordd rydych yn ymdrin â risgiau sylweddol (fel defnyddio contractwyr, lle y bo'n berthnasol). </p> <div class="govuk-hint govuk-!-margin-top-2"> Os hoffech ddarparu'r wybodaeth hon ar ffurf dogfen, ewch ymlaen i'r cwestiwn nesaf. </div>

# HealthAndSafetyQuestion_03_Title
source: Do you have supporting documents to upload?
cy: A oes gennych ddogfennau ategol i'w lanlwytho?

# HealthAndSafetyQuestion_03_SummaryTitle
source: Supporting documents
cy: Dogfennau ategol

# CyberEssentials_01_Title
source: Submitting your Cyber Essentials certification scheme information
cy: Cyflwyno eich gwybodaeth ar gyfer cynllun ardystio Cyber Essentials

# CyberEssentials_02_Title
source: Do you meet the Cyber Essentials certification requirements?
cy: Ydych chi'n bodloni gofynion ardystio Cyber Essentials?

# CyberEssentials_01_Description
source: <p class="govuk-body"> The Cyber Essentials certification scheme is a UK government initiative that helps organisations protect themselves from common cyber threats. This certification reduces risks in the supply chain and is important for building trust in government contracts. The contracting authority you are bidding for will tell you which certification you need. For more information read <a href="https://www.gov.uk/government/publications/ppn-014-cyber-essentials-scheme/ppn-014-cyber-essentials-scheme-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 014: Cyber Essentials scheme (opens in a new tab).</a></p> <p class="govuk-body"> You are only required to complete this module if requested by the contracting authority you are bidding for. Failure to complete this module may result in your tenders being deemed insufficient where PPN 014 has been applied. </p> <h2 class="govuk-heading-m">The information you'll need</h2> <div class="govuk-body">You'll need to provide information on your Cyber Essentials or Cyber Essentials Plus certification (or equivalent). This may include: <ul class="govuk-list govuk-list--bullet"> <li class="govuk-!-margin-top-2"> confirmation that you meet the requirements of the certification scheme</li> <li class="govuk-!-margin-top-2"> the expiry date of your certification</li> <li class="govuk-!-margin-top-2"> evidence of your certification</li> </ul> </div>
cy: <p class="govuk-body"> Mae cynllun ardystio Cyber Essentials yn un o fentrau Llywodraeth y DU sy'n helpu sefydliadau i amddiffyn eu hunain rhag bygythiadau seiber cyffredin. Mae'r ardystiad hwn yn lleihau risgiau yn y gadwyn gyflenwi ac mae'n bwysig er mwyn meithrin ymddiriedaeth yng nghontractau'r llywodraeth. Bydd yr awdurdod contractio rydych yn gwneud cynnig iddo yn rhoi gwybod i chi pa ardystiad sydd ei angen arnoch. Am ragor o wybodaeth, darllenwch <a href="https://www.gov.uk/government/publications/ppn-014-cyber-essentials-scheme/ppn-014-cyber-essentials-scheme-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 014: Cynllun Cyber Essentials (bydd yn agor mewn tab newydd).</a></p> <p class="govuk-body"> Bydd ond angen i chi gwblhau'r modiwl hwn os bydd yr awdurdod contractio rydych yn gwneud cynnig iddo yn gofyn i chi wneud hyny. Gall methu â chwblhau'r modiwl hwn arwain at ystyried bod eich tendrau yn annigonol lle mae PPN 014 wedi'i gymhwyso. </p> <h2 class="govuk-heading-m">Y wybodaeth y bydd ei hangen arnoch</h2> <div class="govuk-body">Bydd angen i chi ddarparu gwybodaeth am eich ardystiad Cyber Essentials neu Cyber Essentials Plus (neu ardystiad cyfatebol). Gall hyn gynnwys: <ul class="govuk-list govuk-list--bullet"> <li class="govuk-!-margin-top-2"> cadarnhad eich bod yn bodloni gofynion y cynllun ardystio</li> <li class="govuk-!-margin-top-2"> dyddiad dirwyn i ben eich ardystiad</li> <li class="govuk-!-margin-top-2"> tystiolaeth o'ch ardystiad</li> </ul> </div>

# CyberEssentials_02_SummaryTitle
source: Requirements met
cy: Bodlonwyd y gofynion

# CyberEssentials_03_SummaryTitle
source: Requirements status
cy: Statws y gofynion

# CyberEssentials_03_Title
source: When will you meet the Cyber Essentials certification requirements?
cy: Pryd byddwch yn bodloni gofynion ardystio Cyber Essentials?

# CyberEssentials_04_SummaryTitle
source: Certification upload
cy: Lanlwytho'r ardystiad

# CyberEssentials_04_Title
source: Upload evidence of your Cyber Essentials certification (or equivalent)
cy: Lanlwythwch dystiolaeth o'ch ardystiad Cyber Essentials (neu ardystiad cyfatebol)

# CyberEssentials_05_SummaryTitle
source: Certification expiry date
cy: Dyddiad dirwyn i ben yr ardystiad

# CyberEssentials_05_Title
source: Enter the expiry date of your Cyber Essentials certification (or equivalent)
cy: Cofnodwch ddyddiad dirwyn i ben eich ardystiad Cyber Essentials (neu ardystiad cyfatebol)

# CyberEssentials_06_SummaryTitle
source: Requirements met
cy: Bodlonwyd y gofynion

# CyberEssentials_06_Title
source: Do you meet the Cyber Essentials Plus certification requirements?
cy: Ydych chi'n bodloni gofynion ardystio Cyber Essentials Plus?

# CyberEssentials_07_SummaryTitle
source: Requirements status
cy: Statws y gofynion

# CyberEssentials_07_Title
source: When will you meet the Cyber Essentials Plus certification requirements?
cy: Pryd byddwch yn bodloni gofynion ardystio Cyber Essentials Plus?

# CyberEssentials_08_SummaryTitle
source: Certification upload
cy: Lanlwytho'r ardystiad

# CyberEssentials_08_Title
source: Upload evidence of your Cyber Essentials Plus certification (or equivalent)
cy: Lanlwythwch dystiolaeth o'ch ardystiad Cyber Essentials Plus (neu ardystiad cyfatebol)

# CyberEssentials_09_SummaryTitle
source: Certification expiry date
cy: Dyddiad dirwyn i ben yr ardystiad

# CyberEssentials_09_Title
source: Enter the expiry date of your Cyber Essentials Plus certification (or equivalent)
cy: Cofnodwch ddyddiad dirwyn i ben eich ardystiad Cyber Essentials Plus (neu ardystiad cyfatebol)

# CyberEssentials_SectionTitle
source: Cyber Essentials certification scheme
cy: Cynllun ardystio Cyber Essentials

# CyberEssentials_CertificationPlus_SubTitle
source: Cyber Essentials Plus certification scheme
cy: Cynllun ardystio Cyber Essentials Plus

# CyberEssentials_07_Option_2
source: I do not currently meet the requirements, but will meet them by contract award
cy: Nid wyf yn bodloni'r gofynion ar hyn o bryd, ond byddaf yn eu bodloni erbyn i'r contract gael ei ddyfarnu

# CyberEssentials_02_Caption
source: You must be ready to provide evidence, if required, before the contract is awarded.
cy: Rhaid i chi fod yn barod i ddarparu tystiolaeth, os bydd yn ofynnol, cyn i'r contract gael ei ddyfarnu.

# CyberEssentials_02_Option_1
source: Yes, I meet the requirements or will meet them by contract award
cy: Ydw, rwy'n bodloni'r gofynion neu byddaf yn eu bodloni erbyn i'r contract gael ei ddyfarnu

# CyberEssentials_02_Option_2
source: No, I do not meet the requirements
cy: Nac ydw, nid wyf yn bodloni'r gofynion

# CyberEssentials_03_Option_1
source: I currently meet the requirements
cy: Rwy'n bodloni'r gofynion ar hyn o bryd

# CyberEssentials_03_Option_2
source: I do not currently meet the requirements, but will meet them by contract award
cy: Nid wyf yn bodloni'r gofynion ar hyn o bryd, ond byddaf yn eu bodloni erbyn i'r contract gael ei ddyfarnu

# CyberEssentials_06_Caption
source: You must be ready to provide evidence, if required, before the contract is awarded.
cy: Rhaid i chi fod yn barod i ddarparu tystiolaeth, os bydd yn ofynnol, cyn i'r contract gael ei ddyfarnu.

# CyberEssentials_06_Option_1
source: Yes, I meet the requirements or will meet them by contract award
cy: Ydw, rwy'n bodloni'r gofynion neu byddaf yn eu bodloni erbyn i'r contract gael ei ddyfarnu

# CyberEssentials_06_Option_2
source: No, I do not meet the requirements
cy: Nac ydw, nid wyf yn bodloni'r gofynion

# CyberEssentials_07_Option_1
source: I currently meet the requirements
cy: Rwy'n bodloni'r gofynion ar hyn o bryd

# ModernSlavery_01_Title
source: Submitting your modern slavery information
cy: Cyflwyno eich gwybodaeth am gaethwasiaeth fodern

# ModernSlavery_01_Description
source: <p class="govuk-body"> Modern slavery refers to offences of slavery, servitude, forced labour and human trafficking. To address these crimes, the UK government has issued Procurement Policy Note (PPN) 009, which mandates that suppliers bidding for specific contracts demonstrate their commitment to addressing modern slavery. </p> <p class="govuk-body"> You are only required to complete this module if requested by the contracting authority you are bidding for. Failure to complete this module may result in your tenders being deemed insufficient where PPN 009 has been applied. For more information read <a href="https://www.gov.uk/government/publications/ppn-009-tackling-modern-slavery-in-government-supply-chains/ppn-009-guidance-on-tackling-modern-slavery-in-government-supply-chains-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 009: Tackling Modern Slavery in Government Supply Chains (opens in a new tab)</a>. </p> <h2 class="govuk-heading-m">The information you'll need</h2> <div class="govuk-body">You'll need to provide information on modern slavery and trafficking in relation to your organisation. This may include:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li> a link to or copy of your Modern Slavery Statement or equivalent documents </li> <li> instructions on how to find your Modern Slavery Statement or equivalent documents </li> <li> information you have included in your Modern Slavery Statement or equivalent documentation</li> </ul> </div>
cy: <p class="govuk-body"> Mae caethwasiaeth fodern yn cyfeirio at droseddau caethwasiaeth, caethiwed, llafur dan orfod a masnachu mewn pobl. Er mwyn mynd i'r afael â'r troseddau hyn, mae Llywodraeth y DU wedi cyhoeddi Nodyn Polisi Caffael (PPN) 009, sy'n mynnu bod cyflenwyr sy'n cynnig am gontractau penodol yn dangos eu hymrwymiad i fynd i'r afael â chaethwasiaeth fodern. </p> <p class="govuk-body"> Mae ond yn ofynnol os bydd yr awdurdod contractio rydych yn gwneud cynnig iddo yn gofyn i chi wneud hynny y bydd angen i chi gwblhau'r modiwl hwn. Gall methu â chwblhau'r modiwl hwn arwain at ystyried bod eich tendrau yn annigonol lle mae PPN 009 wedi'i gymhwyso. Am ragor o wybodaeth, darllenwch <a href="https://www.gov.uk/government/publications/ppn-009-tackling-modern-slavery-in-government-supply-chains/ppn-009-guidance-on-tackling-modern-slavery-in-government-supply-chains-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 009: Mynd i'r Afael â Chaethwasiaeth Fodern mewn Cadwyni Cyflenwi (bydd yn agor mewn tab newydd)</a>. </p> <h2 class="govuk-heading-m">Y wybodaeth y bydd ei hangen arnoch</h2> <div class="govuk-body">Bydd angen i chi ddarparu gwybodaeth am gaethwasiaeth fodern a masnachu mewn pobl mewn perthynas â'ch sefydliad. Gall hyn gynnwys:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li>dolen i'ch Datganiad Caethwasiaeth Fodern neu ddogfennau cyfatebol neu gopi ohonynt</li> <li>cyfarwyddiadau ar sut i ddod o hyd i'ch Datganiad Caethwasiaeth Fodern neu ddogfennau cyfatebol</li> <li>gwybodaeth rydych chi wedi'i chynnwys yn eich Datganiad Caethwasiaeth Fodern neu ddogfennaeth gyfatebol</li> </ul> </div>
