Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/FormsEngineResource.*.resx
Languages: cy

# ModernSlavery_02_Title
source: Are you a commercial organisation subject to Section 54 of the Modern Slavery Act 2015?
cy: A ydych yn sefydliad masnachol sy'n ddarostyngedig i Adran 54 o Ddeddf Caethwasiaeth Fodern 2015?

# ModernSlavery_02_SummaryTitle
source: Subject to Section 54 Modern Slavery Act
cy: Yn ddarostyngedig i Adran 54 o'r Ddeddf Caethwasiaeth Fodern

# ModernSlavery_02_Description
source: <span class="govuk-body">For example, you are an organisation supplying goods or services that:</span> <ul class="govuk-list govuk-list--bullet"> <li>conducts business, or part of a business, in the UK</li> <li>has an annual turnover of more than £36 million</li> </ul> <p class="govuk-body">For more information read <a href="https://www.legislation.gov.uk/ukpga/2015/30/section/54" class="govuk-link" rel="noreferrer noopener" target="_blank"> section 54 of the Modern Slavery Act 2015 (opens in a new tab)</a>. </p>
cy: <span class="govuk-body">Er enghraifft, rydych yn sefydliad sy'n cyflenwi nwyddau neu wasanaethau sydd:</span> <ul class="govuk-list govuk-list--bullet"> <li>yn cynnal busnes neu ran o fusnes yn y DU</li> <li>â throsiant blynyddol o dros £36 miliwn</li> </ul> <p class="govuk-body">I gael rhagor o wybodaeth, darllenwch<a href="https://www.legislation.gov.uk/ukpga/2015/30/section/54" class="govuk-link" rel="noreferrer noopener" target="_blank"> adran 54 o Ddeddf Caethwasiaeth Fodern 2015 (bydd yn agor mewn tab newydd)</a>. </p>

# ModernSlavery_03_Title
source: Is your latest Modern Slavery Statement available digitally?
cy: Ydy'ch Datganiad Caethwasiaeth Fodern diweddaraf ar gael yn ddigidol?

# ModernSlavery_03_SummaryTitle
source: Electronic Statement
cy: Datganiad electronig

# ModernSlavery_04_Title
source: Are your documents or statements related to modern slavery available digitally?
cy: Ydy'ch dogfennau neu ddatganiadau sy'n gysylltiedig â chaethwasiaeth fodern ar gael yn ddigidol?

# ModernSlavery_04_SummaryTitle
source: Electronic statement
cy: Datganiad electronig

# ModernSlavery_04_Description
source: <div class="govuk-body govuk-!-margin-top-3"> Published statements or other relevant documents should contain information of a similar type and level to a Modern Slavery Statement. </div>
cy: <div class="govuk-body govuk-!-margin-top-3"> Dylai datganiadau neu ddogfennau perthnasol eraill sydd wedi'u cyhoeddi gynnwys gwybodaeth o fath a lefel debyg i Ddatganiad Caethwasiaeth Fodern. </div>

# ModernSlavery_05_Title
source: Enter the link to your Modern Slavery Statement
cy: Cofiwch gynnwys y ddolen i'ch Datganiad Caethwasiaeth Fodern

# ModernSlavery_05_SummaryTitle
source: Statement link
cy: Dolen i'r datganiad

# ModernSlavery_05_Description
source: <div class="govuk-body"> This should be the link that is published on your organisation's website. </div>
cy: <div class="govuk-body"> Dyma'r ddolen y dylid ei chyhoeddi ar wefan eich sefydliad. </div>

# ModernSlavery_06_Title
source: Do you want to upload evidence of your latest Modern Slavery Statement now?
cy: Lanlwythwch gopi o'ch Datganiad Caethwasiaeth Fodern diweddaraf

# ModernSlavery_06_SummaryTitle
source: Statement upload
cy: Lanlwytho'r datganiad

# ModernSlavery_07_Title
source: Enter the link to your relevant documentation or published statements on modern slavery
cy: Cofnodwch y ddolen i'ch dogfennaeth berthnasol neu ddatganiadau cyhoeddedig ar gaethwasiaeth fodern

# ModernSlavery_07_SummaryTitle
source: Statement link
cy: Dolen i'r datganiad

# ModernSlavery_08_Title
source: Do you want to upload evidence of your latest Modern Slavery Statement now?
cy: Lanlwythwch eich dogfennaeth berthnasol neu ddatganiadau cyhoeddedig ar gaethwasiaeth fodern

# ModernSlavery_08_SummaryTitle
source: Statement upload
cy: Lanlwytho'r datganiad

# ModernSlavery_09_Title
source: Enter instructions on how to find your organisation's Modern Slavery Statement
cy: Cofnodwch gyfarwyddiadau ar sut i ddod o hyd i Ddatganiad Caethwasiaeth Fodern eich sefydliad

# ModernSlavery_09_SummaryTitle
source: Statement location instructions
cy: Cyfarwyddiadau o ran lleoliad y datganiad

# ModernSlavery_09_Description
source: <div class="govuk-hint"> This is the exact location online, for example, go to 'website link', scroll down to footer menu and click on 'policies' </div>
cy: <div class="govuk-hint"> Dyma'r union leoliad ar-lein, er enghraifft, ewch i 'ddolen y wefan', sgroliwch i lawr i ddewislen y troedyn a chliciwch ar 'polisïau' </div>

# ModernSlavery_10_Title
source: Enter instructions on how to find your relevant published statements or documents on modern slavery
cy: Cofnodwch gyfarwyddiadau ar sut i ddod o hyd i'ch datganiadau cyhoeddedig neu ddogfennau perthnasol ar gaethwasiaeth fodern

# ModernSlavery_10_SummaryTitle
source: Statement location instructions
cy: Cyfarwyddiadau o ran lleoliad y datganiad

# ModernSlavery_10_Description
source: <div class="govuk-hint"> This is the exact location online, for example, go to 'website link', scroll down to footer menu and click on 'policies' </div>
cy: <div class="govuk-hint"> Dyma'r union leoliad ar-lein, er enghraifft, ewch i 'ddolen y wefan', sgroliwch i lawr i ddewislen y troedyn a chliciwch ar 'polisïau' </div>

# ModernSlavery_11_Title
source: Missing information
cy: Gwybodaeth goll

# ModernSlavery_11_SummaryTitle
source: Missing information
cy: Gwybodaeth goll

# ModernSlavery_11_Description
source: <p class="govuk-body"> If the following information is missing from your statements or documents related to modern slavery, explain why and commit to including it before the contract is awarded: </p> <ul class="govuk-list govuk-list--bullet"> <li>organisation structure and supply chains</li> <li>policies in relation to modern slavery and human trafficking</li> <li>due diligence processes for modern slavery and human trafficking, including your supply chains</li> <li>risk assessment and management plans</li> <li>key performance indicators to measure the effectiveness of preventative steps being taken</li> <li>training on modern slavery and trafficking available to staff</li> </ul> <p class="govuk-hint">If all information is included in the statement indicate this in your response.</p>
cy: <p class="govuk-body"> Os bydd y wybodaeth ganlynol ar goll o'ch datganiadau neu ddogfennau sy'n gysylltiedig â chaethwasiaeth fodern, esboniwch pan ac ymrwymwch i'w gynnwys cyn i'r contract gael ei ddyfarnu: </p> <ul class="govuk-list govuk-list--bullet"> <li>strwythur y sefydliad a chadwyni cyflenwi</li> <li>polisïau mewn perthynas â chaethwasiaeth fodern a masnachu mewn pobl</li> <li>prosesau diwydrwydd dyladwy ar gyfer caethwasiaeth fodern a masnachu mewn pobl, gan gynnwys eich cadwyni cyflenwi</li> <li>asesu risg a chynlluniau rheoli</li> <li>dangosyddion perfformiad allweddol i fesur effeithiolrwydd y camau ataliol a gymerir</li> <li>mae hyfforddiant ar gaethwasiaeth fodern a masnachu mewn pobl ar gael i staff</li> </ul>

# ModernSlavery_12_Title
source: Missing information
cy: Gwybodaeth goll

# ModernSlavery_12_SummaryTitle
source: Missing information
cy: Gwybodaeth goll

# ModernSlavery_12_Description
source: <p class="govuk-body"> If the following information is missing from your Modern Slavery Statement or equivalent documents, explain why and commit to including it before the contract is awarded: </p> <ul class="govuk-list govuk-list--bullet"> <li>organisation structure and supply chains</li> <li>policies in relation to modern slavery and human trafficking</li> <li>due diligence processes for modern slavery and human trafficking, including your supply chains</li> <li>risk assessment and management plans</li> <li>key performance indicators to measure the effectiveness of preventative steps being taken</li> <li>training on modern slavery and trafficking available to staff</li> </ul> <p class="govuk-hint">If all information is included in the statement indicate this in your response.</p>
cy: <p class="govuk-body"> Os bydd y wybodaeth ganlynol ar goll o'ch Datganiad Caethwasiaeth Fodern neu ddogfennau cyfatebol, esboniwch pam ac ymrwymwch i'w gynnwys cyn i'r contract gael ei ddyfarnu: </p> <ul class="govuk-list govuk-list--bullet"> <li>strwythur y sefydliad a chadwyni cyflenwi</li> <li>polisïau mewn perthynas â chaethwasiaeth fodern a masnachu mewn pobl</li> <li>prosesau diwydrwydd dyladwy ar gyfer caethwasiaeth fodern a masnachu mewn pobl, gan gynnwys eich cadwyni cyflenwi</li> <li>asesu risg a chynlluniau rheoli</li> <li>dangosyddion perfformiad allweddol i fesur effeithiolrwydd y camau ataliol a gymerir</li> <li>mae hyfforddiant ar gaethwasiaeth fodern a masnachu mewn pobl ar gael i staff</li> </ul>

# ModernSlavery_SectionTitle
source: Modern Slavery
cy: Caethwasiaeth Fodern

# Payments_01_Title
source: Submitting your payments information
cy: Cyflwyno eich gwybodaeth am daliadau

# Payments_01_Description
source: <p class="govuk-body"> The Government has committed to tackling late payments as part of its Plan for Small Businesses. This module focuses on identifying the reliability of a supplier's payment systems, to ensure compliance with government payment policies and promote fair cash flow for businesses. For more information read <a href="https://www.gov.uk/government/publications/ppn-015-how-to-take-account-of-a-suppliers-approach-to-payment-in-the-procurement-of-major-contracts/ppn-015-taking-account-of-a-suppliers-approach-to-payment-in-the-procurement-of-major-contracts-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 015: Taking account of a supplier's approach to payment in the procurement of major contracts (opens in a new tab)</a>. </p> <p class="govuk-body"> You are only required to complete this module if requested by the contracting authority you are bidding for. Failure to complete this module may result in your tenders being deemed insufficient where PPN 015 has been applied. </p> <h2 class="govuk-heading-m">The information you'll need</h2> <div class="govuk-body">You'll need to provide information on your payments and invoices. This may include:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li>compliance with your payment terms</li> <li>payment and invoice details for the last two six month reporting periods</li> <li>an action plan for reducing late payments (where relevant)</li> </ul> </div>
cy: <p class="govuk-body"> Mae'r Llywodraeth wedi ymrwymo i fynd i'r afael â thaliadau hwyr fel rhan o'i Chynllun ar gyfer Busnesau Bach. Mae'r modiwl hwn yn canolbwyntio ar nodi pa mor ddibynadwy yw systemau talu cyflenwr, er mwyn sicrhau cydymffurfedd â pholisïau talu'r llywodraeth a hyrwyddo llif arian parod teg ar gyfer busnesau. Am ragor o wybodaeth, darllenwch <a href="https://www.gov.uk/government/publications/ppn-015-how-to-take-account-of-a-suppliers-approach-to-payment-in-the-procurement-of-major-contracts/ppn-015-taking-account-of-a-suppliers-approach-to-payment-in-the-procurement-of-major-contracts-html" class="govuk-link" rel="noreferrer noopener" target="_blank"> PPN 015: Ystyried dull gweithredu cyflenwr mewn perthynas â thaliadau wrth gaffael contractau mawr (yn agor mewn tab newydd)</a>. </p> <p class="govuk-body"> Dim ond os bydd yr awdurdod contractio rydych yn gwneud cynnig iddo yn gofyn i chi wneud hynny y bydd angen i chi gwblhau'r modiwl hwn. Gall methu â chwblhau'r modiwl hwn arwain at ystyried bod eich tendrau yn annigonol lle mae PPN 015 wedi'i gymhwyso. </p> <h2 class="govuk-heading-m">Y wybodaeth fydd ei hangen arnoch</h2> <div class="govuk-body">Bydd angen i chi ddarparu gwybodaeth am eich taliadau a'ch anfonebau. Gall hyn gynnwys:</div> <div class="govuk-body"> <ul class="govuk-list govuk-list--bullet"> <li>cydymffurfedd â'ch telerau talu</li> <li>manylion taliadau ac anfonebau ar gyfer y ddau gyfnod adrodd diwethaf o chwe mis</li> <li>cynllun gweithredu ar gyfer lleihau nifer y taliadau hwyr (lle y bo'n berthnasol)</li> </ul> </div>

# Payments_02_Title
source: Do you have processes to ensure you pay your supply chain on time?
cy: A oes gennych brosesau er mwyn sicrhau eich bod yn talu eich cadwyn gyflenwi yn brydlon?

# Payments_02_Description
source: <div class="govuk-hint govuk-!-margin-top-2"> For example, within your agreed contractual terms </div>
cy: <div class="govuk-hint govuk-!-margin-top-2"> Er enghraifft, yn unol â'ch telerau cytundebol y cytunwyd arnynt </div>

# Payments_03_Description
source: <div class="govuk-hint govuk-!-margin-top-2"> For example, within your agreed contractual terms </div>
cy: <div class="govuk-hint govuk-!-margin-top-2"> Er enghraifft, yn unol â'ch telerau cytundebol y cytunwyd arnynt </div>

# Payments_03_Title
source: Do you have processes to resolve disputed payments and invoices in your supply chain on time?
cy: A oes gennych brosesau i ddatrys taliadau ac anfonebau y mae anghydfod yn eu cylch yn eich cadwyn gyflenwi yn brydlon?

# Payments_04_Title
source: Confirmation of payment terms for public sector contracts
cy: Cadarnhau telerau talu ar gyfer contractau sector cyhoeddus

# Payments_04_Description
source: <p class="govuk-body">Confirm you have:</p> <ul class="govuk-list govuk-list--bullet"> <li>systems in place to include a minimum of 30-day payment terms in all your supply chain contracts</li> <li>the requirment that these payment terms are passed down through your supply chain</li> </ul>
cy: <div class="govuk-hint govuk-!-margin-top-2"> Mae'r cwestiwn canlynol yn cyfeirio at gontractau sector cyhoeddus a ddyfernir o dan Ddeddf Caffael 2023 </div> <p class="govuk-body">Cadarnhewch fod gennych:</p> <ul class="govuk-list govuk-list--bullet"> <li>systemau ar waith i gynnwys telerau talu o fewn 30 diwrnod o leiaf ym mhob un o'ch contractau cadwyn gyflenwi</li> <li>y gofyniad bod y telerau talu hyn yn cael eu trosglwyddo drwy'ch cadwyn gyflenwi </li> </ul>

# Payments_05_Title
source: Do you report under the Payment Practices Reporting Regulations?
cy: Ydych chi'n cyflwyno adroddiadau o dan y Rheoliadau Adroddiadau ar Arferion Talu?

# Payments_05_Caption
source: Enter the link to your most recent report
cy: Cofiwch gynnwys y ddolen i'ch adroddiad mwyaf diweddar

# Payments_06_Caption
source: Reporting period 1
cy: Cyfnod adrodd 1

# Payments_06_Description
source: <p class="govuk-body">Enter your payment and invoice details for your most recent 6 month reporting period.</p>
cy: <p class="govuk-body">Nodwch fanylion eich taliadau a'ch anfonebau ar gyfer eich cyfnod adrodd mwyaf diweddar o chwe mis.</p>

# Payments_06_ReportingStartDate
source: Reporting period start date
cy: Dyddiad dechrau'r cyfnod adrodd

# Payments_06_ReportingStartDate_SummaryTitle
source: Reporting period start date
cy: Dyddiad dechrau'r cyfnod adrodd

# Payments_06_AverageDaysToPayInvoice
source: Average number of days to pay an invoice
cy: Nifer cyfartalog y diwrnodau i dalu anfoneb

# Payments_06_AverageDaysToPayInvoice_SummaryTitle
source: Average number of days to pay an invoice
cy: Nifer cyfartalog y diwrnodau i dalu anfoneb

# Payments_06_InvoicesPaid_Label
source: Invoices paid:
cy: Anfonebau a dalwyd:

# Payments_06_PctPaidWithin30Days
source: Within 30 days
cy: O fewn 30 diwrnod

# Payments_06_PctPaid31To60Days
source: 31 to 60 days
cy: 31-60 diwrnod

# Payments_06_PctPaid61OrMoreDays
source: 61 days or more
cy: 61 diwrnod neu fwy

# Payments_06_PctPaidOverdue
source: Overdue within this reporting period
cy: Yn hwyr yn y cyfnod adrodd hwn

# Payments_06_PctPaidOverdue_SummaryTitle
source: Overdue within the reporting period
cy: Yn hwyr yn y cyfnod adrodd

# Payments_07_Caption
source: Reporting period 2
cy: Cyfnod adrodd 2

# Payments_07_Title
source: Payment and invoice reporting within your immediate supply chain
cy: Adrodd ar daliadau ac anfonebau yn eich cadwyn gyflenwi uniongyrchol

# Payments_06_Title
source: Payment and invoice reporting within your immediate supply chain
cy: Adrodd ar daliadau ac anfonebau yn eich cadwyn gyflenwi uniongyrchol

# Payments_07_Description
source: <p class="govuk-body">Enter your payment and invoice details for the 6 month reporting period prior to your most recent reporting period.</p>
cy: <p class="govuk-body">Nodwch fanylion eich taliadau a'ch anfonebau ar gyfer y cyfnod adrodd o chwe mis cyn eich cyfnod adrodd mwyaf diweddar.</p>

# Payments_07_ReportingStartDate
source: Reporting period start date
cy: Dyddiad dechrau'r cyfnod adrodd

# Payments_07_ReportingStartDate_SummaryTitle
source: Reporting period start date
cy: Dyddiad dechrau'r cyfnod adrodd

# Payments_07_AverageDaysToPayInvoice
source: Average number of days to pay an invoice
cy: Nifer cyfartalog y diwrnodau i dalu anfoneb

# Payments_07_AverageDaysToPayInvoice_SummaryTitle
source: Average number of days to pay an invoice
cy: Nifer cyfartalog y diwrnodau i dalu anfoneb

# Payments_Days
source: Days
cy: Diwrnodau

# Payments_07_InvoicesPaid_Label
source: Invoices paid:
cy: Anfonebau a dalwyd:

# Payments_07_PctPaidWithin30Days
source: Within 30 days
cy: O fewn 30 diwrnod

# Payments_07_PctPaid31To60Days
source: 31 to 60 days
cy: 31-60 diwrnod

# Payments_07_PctPaid61OrMoreDays
source: 61 days or more
cy: 61 diwrnod neu fwy

# Payments_07_PctPaidOverdue
source: Overdue within this reporting period
cy: Yn hwyr yn y cyfnod adrodd hwn

# Payments_07_PctPaidOverdue_SummaryTitle
source: Overdue within the reporting period
cy: Yn hwyr yn y cyfnod adrodd

# Payments_08_Title
source: Explain why you have not paid all invoices within agreed contractual terms (where relevant)
cy: Esboniwch pam nad ydych wedi talu pob anfoneb yn unol â thelerau cytundebol y cytunwyd arnynt (lle y bo'n berthnasol)

# Payments_08_Description
source: <div class="govuk-hint govuk-!-margin-top-2"> You do not need to complete this question if you have paid all invoices within agreed contract terms. </div>
cy: <div class="govuk-hint govuk-!-margin-top-2"> Nid oes angen i chi gwblhau'r cwestiwn hwn os ydych wedi talu pob anfoneb yn unol â thelerau contract y cytunwyd arnynt. </div>

# Payments_09_Title
source: Have you shown that 95% or more of your payable invoices have been paid?
cy: Ydych chi wedi dangos bod 95% neu fwy o'ch anfonebau taladwy wedi'u talu?

# Payments_09_Description
source: <p class="govuk-body">Your invoices to suppliers must have been paid:</p> <ul class="govuk-list govuk-list--bullet"> <li>within 60 days of invoice receipt</li> <li>in at least one of the last two 6 month reporting periods</li> </ul>
cy: <p class="govuk-body">Rhaid bod eich anfonebau i gyflenwyr wedi'u talu:</p> <ul class="govuk-list govuk-list--bullet"> <li>o fewn 60 diwrnod i dderbyn yr anfoneb</li> <li>yn o leiaf un o'r ddau gyfnod adrodd diwethaf o chwe mis</li> </ul>

# Payments_10_Title
source: Can you confirm you have paid all your invoices within an average of 45 days?
cy: Allwch chi gadarnhau eich bod wedi talu pob un o'ch anfonebau o fewn 55 diwrnod, ar gyfartaledd?

# Payments_10_Description
source: <div class="govuk-body"> Your invoices to suppliers must have been paid within an average of 45 days in at least one of the last two 6 month reporting periods. </div>
cy: <div class="govuk-body"> Rhaid bod eich anfonebau i gyflenwyr wedi'u talu o fewn 55 diwrnod, ar gyfartaledd, yn o leiaf un o'r ddau gyfnod adrodd diwethaf o chwe mis. </div>

# Payments_11_Title
source: Submit your action plan (where relevant)
cy: Cyflwyno eich cynllun gweithredu (lle y bo'n berthnasol)

# Payments_11_Description
source: <p class="govuk-body">Your plan must include, as a minimum:</p> <ul class="govuk-list govuk-list--bullet"> <li>identification of the main causes of failure to pay 95% of all supply chain invoices paid within 60 days and overdue payments (where relevant)</li> <li>actions to address the cause of each payment failure</li> <li>commitment to a process for regular reporting on progress to the suppliers bidder's audit committee (or equivalent)</li> <li>a plan signed off by your director</li> <li>a plan published on your website (this can be a shorter, summary plan)</li> </ul>
cy: <p class="govuk-body">Rhaid i'ch cynllun gynnwys, o leiaf:</p> <ul class="govuk-list govuk-list--bullet"> <li>prif achosion eich methiant i dalu 95% o holl anfonebau'r gadwyn gyflenwi a dalwyd o fewn 60 diwrnod a thaliadau hwyr (lle y bo'n berthnasol)</li> <li>camau gweithredu i fynd i'r afael â phob methiant i dalu</li> <li>ymrwymiad i broses ar gyfer cyflwyno adroddiadau rheolaidd ar gynnydd i bwyllgor archwilio cynigiwr cyflenwyr (neu gorff sy'n cyfateb iddo)</li> <li>cynllun a gymeradwywyd gan eich cyfarwyddwr</li> <li>cynllun a gyhoeddwyd ar eich gwefan (gall fod yn gynllun cryno byrrach)</li> </ul>

# Payments_11_InsetText
source: <div class="govuk-inset-text">You can submit an existing action plan prepared for a different purpose, but it must cover the points mentioned on this page.</div>
cy: <div class="govuk-inset-text">Gallwch gyflwyno cynllun gweithredu presennol a baratowyd at ddiben gwahanol, ond rhaid iddo ymdrin â'r pwyntiau a nodir ar y dudalen hon.</div>

# Payments_Group1_SummaryTitle
source: Terms and processes
cy: Telerau a phrosesau

# Payments_02_SummaryTitle
source: Payment process
cy: Y broses dalu

# Payments_03_SummaryTitle
source: Dispute resolution process
cy: Y broses datrys anghydfodau

# Payments_04_SummaryTitle
source: Payment terms
cy: Telerau talu

# Payments_05_SummaryTitle
source: Reporting under the Payment Practices Reporting Regulations
cy: Cyflwyno adroddiadau o dan y Rheoliadau Adroddiadau ar Arferion Talu

# Payments_Group2_SummaryTitle
source: Reporting period 1
cy: Cyfnod adrodd 1

# Payments_06_PctPaidWithin30Days_SummaryTitle
source: Paid within 30 days
cy: Talwyd o fewn 30 diwrnod

# Payments_06_PctPaid31To60Days_SummaryTitle
source: Paid within 31 to 60 days
cy: Talwyd o fewn 31-60 diwrnod

# Payments_06_PctPaid61OrMoreDays_SummaryTitle
source: Paid at 61 days or more
cy: Talwyd o fewn 61 diwrnod neu fwy

# Payments_Group3_SummaryTitle
source: Reporting period 2
cy: Cyfnod adrodd 2

# Payments_07_PctPaidWithin30Days_SummaryTitle
source: Paid within 30 days
cy: Talwyd o fewn 30 diwrnod

# Payments_07_PctPaid31To60Days_SummaryTitle
source: Paid within 31 to 60 days
cy: Talwyd o fewn 31-60 diwrnod

# Payments_07_PctPaid61OrMoreDays_SummaryTitle
source: Paid at 61 days or more
cy: Talwyd o fewn 61 diwrnod neu fwy

# Payments_Group4_SummaryTitle
source: Non-compliance details
cy: Manylion diffyg cydymffurfio

# Payments_08_SummaryTitle
source: Invoices not paid within contractual terms
cy: Ni thalwyd anfonebau yn unol â thelerau cytundebol

# Payments_09_SummaryTitle
source: 95% of invoices paid within 60 days
cy: Talwyd 95% o anfonebau o fewn 60 diwrnod

# Payments_10_SummaryTitle
source: Invoices paid within 45-day average
cy: Talwyd anfonebau o fewn 55 diwrnod, ar gyfartaledd

# Payments_11_SummaryTitle
source: Action plan upload
cy: Lanlwythwyd cynllun gweithredu
