Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/StaticTextResource.*.resx
Languages: cy

# Supplier_ConnectedEntity_ConnectedEntityLegalFormQuestion_LegalFormNameLabel
source: Legal form name
cy: Enw'r ffurf gyfreithiol

source: Enter the legal form name
cy: Rhowch enw'r ffurf gyfreithiol

# Supplier_ConnectedEntity_ConnectedEntityOrganisationCategory_Hint
source: The ‘connected person’ that has control or influence over your organisation should fall into one of these categories.
cy: Dylai'r ‘person cysylltiedig’ sydd â rheolaeth neu ddylanwad dros eich sefydliad fod wedi'i gynnwys yn un o'r categorïau hyn.

source: a company your organisation has taken over
cy: cwmni y mae eich sefydliad wedi'i drosfeddiannu

# Supplier_ConnectedEntity_ConnectedEntityOrganisationCategory_Option_Director
source: director or organisation with the same responsibilities
cy: cyfarwyddwr neu sefydliad â'r un cyfrifoldebau

source: any other organisation with significant influence or control
cy: unrhyw sefydliad arall â dylanwad neu reolaeth sylweddol

source: parent or subsidiary company
cy: rhiant gwmni neu is-gwmni

source: registered company
cy: cwmni cofrestredig

source: registered company or equivalent
cy: cwmni cofrestredig neu gwmni cyfatebol

# Supplier_ConnectedEntity_ConnectedEntityOrganisationCategory_PageTitle
source: Select the category that best describes the 'connected person'
cy: Dewiswch y categori sy'n disgrifio'r ‘person cysylltiedig’ orau

# Supplier_ConnectedEntity_ConnectedEntityOrganisationCategory_SelectCategoryError
source: Select the category
cy: Dewiswch y categori

# Supplier_ConnectedEntity_ConnectedEntityOrganisationName_EnterNameError
source: Enter the organisation's name
cy: Rhowch enw’r sefydliad

# Supplier_ConnectedEntity_ConnectedEntityOrganisationName_Hint
source: The name of the 'connected person' that has control or influence over your organisation.
cy: Enw'r ‘person cysylltiedig’ â rheolaeth neu ddylanwad dros eich sefydliad.

# Supplier_ConnectedEntity_ConnectedEntityOrganisationName_PageTitle
source: Enter the organisation's name
cy: Rhowch enw’r sefydliad

source: Company registration number
cy: Rhif cofrestru'r cwmni

# Supplier_ConnectedEntity_ConnectedEntityOverseasCompanyQuestion_Heading
source: Is {0} registered with an overseas equivalent to Companies House?
cy: A yw {0} wedi'i gofrestru â chorff tramor sy'n cyfateb i Dŷ'r Cwmnïau?

# Supplier_ConnectedEntity_ConnectedEntityOverseasCompanyQuestion_Hint
source: Is the 'connected person' registered with a similar non-UK body that incorporates companies?
cy: A yw'r ‘person cysylltiedig’ wedi cofrestru â chorff tebyg y tu allan i'r DU sy'n corffori cwmnïau?

# Supplier_ConnectedEntity_ConnectedEntityPersonType_Hint
source: A trust cannot be a 'connected person' and should be added as one or more of the trustees who exercise control of the trust
cy: Gall ‘person cysylltiedig’ fod yn unigolyn, yn sefydliad neu'n ymddiriedolwr neu'n ymddiriedaeth.

# Supplier_ConnectedEntity_ConnectedEntityPersonType_OptionIndividual
source: Individual
cy: Unigolyn

# Supplier_ConnectedEntity_ConnectedEntityPersonType_OptionOrganisation
source: Organisation
cy: Sefydliad

# Supplier_ConnectedEntity_ConnectedEntityPersonType_OptionTrustOrTrustee
source: Trustee of a trust
cy: Ymddiriedolwr neu Ymddiriedolaeth

# Supplier_ConnectedEntity_ConnectedEntityPersonType_PageTitle
source: Is the 'connected person' an organisation, individual or trustee?
cy: Dewiswch yr opsiwn perthnasol

# Supplier_ConnectedEntity_ConnectedEntityPersonType_SelectOptionError
source: Select organisation, individual or trustee of a trust
cy: Dewiswch yr opsiwn perthnasol

# Supplier_ConnectedEntity_ConnectedEntityPostalSameAsRegisteredAddress_Hint
source: The place where an organisation receives official post can be different from its registered address. For example, a branch office.
cy: Gall y lle y bydd sefydliad yn derbyn post swyddogol fod yn wahanol i'w gyfeiriad cofrestredig. Er enghraifft, swyddfa cangen.

# Supplier_ConnectedEntity_ConnectedEntityPostalSameAsRegisteredAddress_PageTitle
source: Does {0} have a different postal address?
cy: Oes gan {0} gyfeiriad post gwahanol?

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthHint
source: For example, 27 3 2007
cy: Er enghraifft, 27/3/2007

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_FirstNameLabel
source: First name
cy: Enw cyntaf

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_FirstNameRequiredError
source: Enter first name
cy: Rhowch enw cyntaf

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_LastNameLabel
source: Last name
cy: Cyfenw

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_LastNameRequiredError
source: Enter last name
cy: Rhowch cyfenw

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_NationalityLabel
source: Nationality
cy: Cenedligrwydd

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_NationalityRequiredError
source: Enter nationality
cy: Rhowch cenedligrwydd

source: For example, 27 3 2007
cy: Er enghraifft, 27/3/2007

source: Date registered
cy: Dyddiad cofrestru

# Supplier_ConnectedEntity_ConnectedEntityRegistrationDateQuestion_Heading
source: Were you required to register {0} as a person with significant control?
cy: A oedd yn ofynnol i chi gofrestru {0} fel person â rheolaeth sylweddol?

# Supplier_ConnectedEntity_ConnectedEntityRegistrationDateQuestion_Hint
source: In the UK this is defined by <a class="govuk-link" href="https://www.legislation.gov.uk/ukpga/2006/46/section/790C" target="_blank">section 790C(4) of the Companies Act 2006 (opens in new tab)</a>
cy: Yn y DU, caiff hyn ei ddiffinio gan <a class="govuk-link" href="https://www.legislation.gov.uk/ukpga/2006/46/section/790C" target="_blank">adran 790C(4) o Ddeddf Cwmnïau 2006 (bydd yn agor mewn tab newydd)</a>

# Supplier_ConnectedEntity_ConnectedEntityRemoveConfirmation_PageTitle
source: Are you sure you want to remove this connected person?
cy: Ydych chi’n siŵr eich bod am ddileu’r person cysylltiedig hwn?

# Supplier_ConnectedEntity_ConnectedEntitySupplierCompanyQuestion_PageTitle
source: Is your organisation registered with Companies House?
cy: A yw eich sefydliad wedi'i gofrestru â Thŷ'r Cwmnïau?

# Supplier_ConnectedEntity_ConnectedEntitySupplierHasControl_PageTitle
source: Is your organisation influenced or controlled by another person or company?
cy: A oes gan berson neu gwmni arall ddylanwad neu reolaeth dros eich sefydliad?

# Supplier_ConnectedEntity_ConnectedPersonSummary_AddAnotherQuestion
source: Add another connected person?
cy: Ychwanegu person cysylltiedig arall?

# Supplier_ConnectedEntity_ConnectedPersonSummary_PageTitle
source: You have added {0} connected person(s)
cy: Rydych wedi ychwanegu {0} berson cysylltiedig

# Supplier_EmailAddress
source: Email address
cy: Cyfeiriad e-bost

# Supplier_Individual_EmailAddress_Title
source: Enter your email address
cy: Rhowch eich cyfeiriad e-bost

# Supplier_Email_Required_ErrorMessage
source: Enter your email address
cy: Rhowch eich cyfeiriad e-bost

# Supplier_Individual
source: Individual
cy: Unigolyn

# Supplier_Individual_Hint
source: Includes people running their own business. For example, sole traders.
cy: Unigolyn - Mae'n cynnwys pobl sy'n rhedeg eu busnes eu hunain. Er enghraifft, unig fasnachwyr.

# Supplier_LegalForm
source: Legal form
cy: Ffurf gyfreithiol

# Supplier_LegalFormCompanyActQuestion_Hint
source: As required by the Companies Act 2006
cy: Fel sy'n ofynnol gan Ddeddf Cwmnïau 2006.

# Supplier_LegalFormFormationDate_Hint
source: For example, 27 3 2007
cy: Er enghraifft, 27 3 2007

# Supplier_LegalFormFormationDate_Month
source: Month
cy: Mis

# Supplier_LegalFormFormationDate_Year
source: Year
cy: Blwyddyn

# Supplier_LegalFormSelectOrganisation_LLP
source: Limited liability partnership (LLP)
cy: Partneriaeth Atebolrwydd Cyfyngedig

# Supplier_LegalFormSelectOrganisation_LP
source: Limited Partnership (LP)
cy: Partneriaeth Gyfyngedig

# Supplier_LegalFormSelectOrganisation_LimitedCompany
source: Private Limited company (Ltd)
cy: Cwmni cyfyngedig

# Supplier_LegalFormSelectOrganisation_Other
source: Other
cy: Arall

# Supplier_LegalFormSelectOrganisation_Title
source: How was your organisation registered?
cy: Dewiswch ffurflen gyfreithiol eich sefydliad

# Supplier_OperationQuestion_Hint
source: Select all that apply
cy: Dewiswch bob un sy'n berthnasol.

# Supplier_OperationQuestion_SmallAndMediumSized_Details
source: Fewer than 250 staff and a turnover of £44 million or less or a balance sheet total of £38 million or less
cy: Llai na 250 o staff a throsiant o £44 miliwn neu lai neu gyfanswm mantolen o £38 miliwn neu lai

# Supplier_OperationQuestion_SupportedEmploymentProvider_Details
source: Providing employment, or employment related support, to disabled or disadvantaged individuals that represent at least 30 per cent of the workforce
cy: Darparu cyflogaeth, neu gymorth sy'n gysylltiedig â chyflogaeth, i unigolion anabl neu dan anfantais sy'n cynrychioli o leiaf 30 y cant o'r gweithlu

# Supplier_OperationQuestion_Title
source: Which best describes your organisation?
cy: Beth sy'n disgrifio eich sefydliad orau?

# Supplier_OperationType_None
source: None apply
cy: Dim un yn gymwys

# Supplier_OperationType_PublicService
source: Public service mutual
cy: Cwmni gwasanaeth cyhoeddus cydfuddiannol

# Supplier_OperationType_PublicService_Short
source: Public service mutual
cy: Cwmni gwasanaeth cyhoeddus cydfuddiannol

# Supplier_OperationType_SmallOrMediumSized
source: Small or medium-sized enterprise (SME)
cy: Busnes bach neu ganolig

# Supplier_OperationType_SmallOrMediumSized_Short
source: Small or medium-sized enterprise
cy: Busnes bach neu ganolig

# Supplier_OperationType_SupportedEmploymentProvider
source: Supported employment provider
cy: Darparwr cyflogaeth â chymorth

# Supplier_OperationType_SupportedEmploymentProvider_Short
source: Supported employment provider
cy: Darparwr cyflogaeth â chymorth

# Supplier_Organisation
source: Organisation
cy: Sefydliad

# Supplier_Organisation_Hint
source: Includes registered companies with employees. For example, limited companies, partnerships, public limited companies, charities and financial mutuals.
cy: Mae'n cynnwys cwmnïau cofrestredig sydd â chyflogeion. Er enghraifft, cwmnïau cyfyngedig, partneriaethau, cwmnïau cyfyngedig cyhoeddus, elusennau a chwmnïau cydfuddiannol ariannol.

# Supplier_OrganisationType
source: Organisation type
cy: Math o sefydliad

# Supplier_PostalAddress
source: Postal address
cy: Cyfeiriad post

# Supplier_RegisteredAddress
source: Registered address
cy: Cyfeiriad cofrestredig

# Supplier_ReturnToAccountHome
source: Back to your supplier information
cy: Dychwelyd i hafan y cyfrif

# Supplier_SupplierType
source: Supplier type
cy: Math o gyflenwr

# Supplier_VatNumber
source: VAT number
cy: Rhif TAW

# Supplier_Individual_VatQuestion_Title
source: Are you registered for VAT?
cy: Ydych chi wedi cofrestru ar gyfer TAW?

# Supplier_VatQuestion_VatNumberLabel
source: VAT number
cy: Rhif TAW

# Supplier_WebsiteAddress
source: Website address
cy: Cyfeiriad gwefan

# Supplier_WebsiteAddress_ErrorEnterWebsiteAddress
source: Enter the website address
cy: Rhowch gyfeiriad y wefan

# Supplier_Individual_WebsiteQuestion_Title
source: Do you have a website?
cy: A oes gennych wefan?

# Supplier_WebsiteQuestion_WebsiteAddress
source: Website address
cy: Cyfeiriad gwefan

# Supplier_WhatTypeOfSupplier
source: Select which best describes your organisation as a supplier
cy: Dewiswch beth sy'n disgrifio eich sefydliad fel cyflenwr orau

# Support_OrganisationApproval_Heading
source: Organisation details
cy: Manylion y sefydliad

# Support_OrganisationApproval_OrganisationAddress_List
source: Organisation address
cy: Cyfeiriad y sefydliad

# Support_OrganisationApproval_OrganisationEmail_List
source: Organisation email
cy: E-bost y sefydliad

# Support_OrganisationApproval_OrganisationIdentifier_List
source: Organisation identifiers
cy: Dynodyddion y sefydliad

# Support_OrganisationApproval_OrganisationName_List
source: Organisation name
cy: Enw'r sefydliad

# Support_Organisations_TableHeader_OrganisationName
source: Organisation name
cy: Enw'r sefydliad

# Support_Organisations_TableHeader_Status
source: Status
cy: Statws

# UserSummary_AddAnotherUser
source: Add another user?
cy: Ychwanegu defnyddiwr arall?

# UserSummary_InviteSent
source: Invite sent
cy: Gwahoddiad wedi'i anfon

# User_RemoveConfirmation_Header
source: Are you sure you want to remove {0}?
cy: Ydych chi’n siŵr eich bod am ddileu {0}?

# User_RemoveConfirmation_Title
source: Are you sure you want to remove {0}?
cy: Ydych chi’n siŵr eich bod am ddileu {0}?

# Users_AddUser_Title
source: Add a user
cy: Ychwanegu defnyddiwr

# Users_CheckYourAnswers_Title
source: Check your answers
cy: Gwiriwch eich atebion

# Users_EmailAddress_Label
source: Email address
cy: Cyfeiriad e-bost

# Users_FirstName_Label
source: First name
cy: Enw cyntaf

# Users_LastName_Label
source: Last name
cy: Cyfenw

# Registration_EnterName_Title
source: Enter your name
cy: Rhowch eich enw

# ApiKeyManagement_CreateApiKey_Hint
source: For security we only show the API key once on the confirmation page. Add a name for reference. For example, the name of the eSender it's for.
cy: Er diogelwch, dim ond unwaith y byddwn yn dangos yr allwedd API i chi ar y dudalen cadarnhau. Ychwanegwch enw er mwyn gallu cyfeirio ato. Er enghraifft enw'r eAnfonwr y mae ar ei gyfer.

# ApiKeyManagement_CreateApiKey_ValidationError
source: Enter the api key name
cy: Rhowch enw'r allwedd API.

# ApiKeyManagement_ManageApiKey_Description
source: View your active and cancelled API keys.
cy: Gweld eich allweddi API gweithredol ac wedi'u canslo.

# ApiKeyManagement_ManageApiKey_Status_Cancelled
source: Cancelled
cy: Wedi'u canslo

# ApiKeyManagement_ManageApiKey_TableHeader_Actions
source: Actions
cy: Gweithredoedd

# ApiKeyManagement_ManageApiKey_YouHaveKeys_Plural
source: You have {0} API keys
cy: Mae gennych {0} allwedd API

# ApiKeyManagement_ManageApiKey_YouHaveKeys_Singular
source: You have {0} API key
cy: Mae gennych {0} allwedd API

# ApiKeyManagement_NewApiKeyDetails_CopyButton
source: Copy API key to clipboard
cy: Copïo'r allwedd API i'r clipfwrdd

# Consortium_ConsortiumAddress_Heading
source: Enter a postal address for the consortium
cy: Rhowch gyfeiriad post ar gyfer y consortiwm

# Consortium_ConsortiumAddress_NonUk_Heading
source: Enter a postal address for the consortium
cy: Rhowch gyfeiriad post ar gyfer y consortiwm

# Consortium_ConsortiumChangeEmail_Heading
source: Enter an email address for the consortium
cy: Rhowch gyfeiriad e-bost ar gyfer y consortiwm

# Consortium_ConsortiumEmail_Heading
source: Enter an email address for the consortium
cy: Rhowch gyfeiriad e-bost ar gyfer y consortiwm

# Consortium_ConsortiumEmail_Required_ErrorMessage
source: Enter your consortium's email address
cy: Rhowch gyfeiriad e-bost eich consortiwm

# Consortium_ConsortiumName_EnterNameError
source: Enter your consortium's name
cy: Rhowch enw eich consortiwm

# Consortium_ConsortiumName_Heading
source: Name your consortium
cy: Enw eich consortiwm

# Consortium_ConsortiumName_Hint
source: You can change this later if you need to
cy: Gallwch newid hwn yn nes ymlaen os bydd angen

# Consortium_ConsortiumOverview_BackToMyAccount_link
source: Back to my account
cy: Yn ôl i fy nghyfrif

# Consortium_ConsortiumOverview_ChangeEmailaddress
source: Change<span class="govuk-visually-hidden">consortium email address</span>
cy: Newid<span class="govuk-visually-hidden">cyfeiriad e-bost y consortiwm</span>

# Consortium_ConsortiumOverview_ChangeName
source: Change<span class="govuk-visually-hidden">consortium name</span>
cy: Newid<span class="govuk-visually-hidden">enw'r consortiwm</span>

# Consortium_ConsortiumOverview_CreateSharecode_list
source: Declare and create a share code
cy: Datgan a chreu cod rhannu

# Consortium_ConsortiumOverview_Heading
source: Consortium details
cy: Manylion y consortiwm

# Consortium_ConsortiumOverview_Heading2
source: Organisations in this consortium
cy: Sefydliadau yn y consortiwm hwn

# Consortium_ConsortiumOverview_Heading3
source: Share your combined supplier information
cy: Rhannwch wybodaeth gyfunol am eich cyflenwyr

# Consortium_ConsortiumOverview_Paragraph1
source: To add an organisation you'll need its most recent share code
cy: I ychwanegu sefydliad, bydd angen ei god rhannu diweddaraf

# Consortium_ConsortiumOverview_Ppon_Status_Pending
source: PPON is pending
cy: PPON yn yr arfaeth

# Consortium_ConsortiumOverview_status_list
source: Cannot start yet
cy: Ni ellir dechrau eto

# Consortium_ConsortiumStart_Heading
source: Create a consortium
cy: Creu consortiwm

# Consortium_ConsortiumStart_Paragraph1
source: Create a consortium to bid on a public procurement with other organisations. You need at least 2 suppliers for a joint bid. There is no upper limit.
cy: Gall dau gyflenwr neu fwy sydd am gyflwyno cynnig ar y cyd greu consortiwm. Gallwch ychwanegu cynifer o gyflenwyr ag sydd ei angen.

# Consortium_ConsortiumStart_Paragraph3
source: To create a consortium you'll need:
cy: Fel y sefydliad sy'n creu'r consortiwm, bydd angen i chi roi:

# Consortium_ConsortiumStart_Paragraph3_list
source: <li>to give it a unique name</li> <li>a postal address</li> <li>an email address</li> <li>your most recent share code</li> <li>the most recent share codes for all the other suppliers</li>
cy: <li>enw consortiwm</li> <li>cyfeiriad</li> <li>cyfeiriad e-bost</li> <li>eich cod rhannu diweddaraf</li> <li>codau rhannu diweddaraf pob un o'r cyflenwyr eraill</li>

# Consortium_ConsortiumStart_Paragraph4
source: Any supplier you want to add to the consortium must have completed their supplier information and created a share code.
cy: Mae'n rhaid bod unrhyw gyflenwr rydych am ei ychwanegu at y consortiwm wedi cwblhau ei wybodaeth am y cyflenwr ac wedi creu cod rhannu.

# Consortium_ConsortiumStart_Paragraph5
source: When you've added all suppliers, you'll create a share code for your combined supplier information.
cy: Pan fyddwch wedi ychwanegu pob cyflenwr, byddwch yn creu cod rhannu ar gyfer y wybodaeth gyfunol am eich cyflenwyr.

# Cookies_ChooseCookiePreferences
source: Choose whether you accept cookies that measure website use
cy: Dewiswch a ydych yn derbyn cwcis sy'n mesur eich defnydd o'r wefan

# Cookies_SetCookiePreferences
source: You’ve set your cookie preferences.
cy: Rydych wedi gosod eich dewisiadau cwcis.

# ErrorMessageList_AlreadyMemberOfOrganisation
source: You are either already a member of this organisation or have already requested to join.
cy: Rydych naill ai'n aelod o'r sefydliad hwn yn barod neu eisoes wedi gwneud cais i ymuno.

# ErrorMessageList_BuyerInfoNotExists
source: The buyer information for requested organisation not exist.
cy: Nid yw'r wybodaeth am y prynwr ar gyfer y sefydliad dan sylw yn bodoli.

# ErrorMessageList_DuplicateInviteEmail
source: A user with this email address has already been invited to your organisation.
cy: Mae defnyddiwr sydd â'r cyfeiriad e-bost hwn eisoes wedi'i wahodd i ymuno â'ch sefydliad.

# ErrorMessageList_DuplicatePersonEmail
source: A user with this email address already exists for your organisation.
cy: Mae defnyddiwr sydd â'r cyfeiriad e-bost hwn eisoes yn bodoli ar gyfer eich sefydliad.

# ErrorMessageList_IdentiferNumberAlreadyExists
source: You’ve used this registry number for another organisation. Enter a different registry number.
cy: Rydych wedi defnyddio'r rhif cofrestrfa hwn ar gyfer sefydliad arall. Rhowch rif cofrestrfa gwahanol.

# ErrorMessageList_MissingAdditionalIdentifiers
source: Missing additional identifiers.
cy: Mae'r dynodyddion ychwanegol ar goll.

# ErrorMessageList_MissingContactPoint
source: Missing contact point.
cy: Mae'r pwynt cyswllt ar goll.

# ErrorMessageList_MissingIdentifierNumber
source: Missing identifier number.
cy: Mae rhif y dynodydd ar goll.

# ErrorMessageList_MissingOrganisationAddress
source: Missing organisation address.
cy: Mae cyfeiriad y sefydliad ar goll.

# ErrorMessageList_MissingOrganisationEmail
source: Missing organisation email.
cy: Mae e-bost y sefydliad ar goll.

# ErrorMessageList_MissingOrganisationName
source: Missing organisation name.
cy: Mae enw'r sefydliad ar goll.

# ErrorMessageList_MissingOrganisationRegisteredAddress
source: Missing Organisation registered address.
cy: Mae cyfeiriad cofrestredig y sefydliad ar goll.

# ErrorMessageList_MissingRoles
source: Missing roles.
cy: Mae rolau ar goll.

# ErrorMessageList_MouNotFound
source: Mou not found
cy: Heb ddod o hyd i'r Memorandwm Cyd-ddealltwriaeth

# ErrorMessageList_NoPrimaryIdentifier
source: There are no identifiers remaining that can be set as the primary.
cy: Nid oes unrhyw ddynodyddion yn weddill y gellir eu gosod fel y prif ddynodydd.

# ErrorMessageList_OrganisationCreationFailed
source: Organisation creation failed, have you provided the correct organisation details.
cy: Ni lwyddwyd i greu sefydliad. A ydych wedi rhoi'r manylion cywir ar gyfer y sefydliad.

# ErrorMessageList_OrganisationEmailDoesNotExist
source: Organisation email does not exists.
cy: Nid yw cyfeiriad e-bost y sefydliad yn bodoli.

# ErrorMessageList_OrganisationInvalidInput
source: Invalid Input.
cy: Mewnbwn annilys.

# ErrorMessageList_OrganisationNotFound
source: The requested organisation was not found.
cy: Ni lwyddwyd i ddod o hyd i'r sefydliad dan sylw.

# ErrorMessageList_PersonCreationFailed
source: Adding a person failed, have you provided the correct person details.
cy: Ni lwyddwyd i ychwanegu person. A ydych wedi rhoi'r manylion cywir ar gyfer y person.

# ErrorMessageList_PersonNotFound
source: The requested person was not found.
cy: Ni lwyddwyd i ddod o hyd i'r person dan sylw.

# ErrorMessageList_UnknownBuyerInformationUpdateType
source: The requested buyer information update type is unknown.
cy: Mae'r math o ddiweddariad y gofynnwyd amdano i'r wybodaeth am y prynwr yn anhysbys.

# ErrorMessageList_UnknownOrganisation
source: The requested organisation was not found.
cy: Ni lwyddwyd i ddod o hyd i'r sefydliad dan sylw.

# Footer_SupportLinks
source: Support links
cy: Dolenni cymorth

# Forms_AnswerSetSummary_BackToSupplierInformation
source: Back to supplier information
cy: Yn ôl i'r wybodaeth am y cyflenwr

# Forms_CheckYourAnswers_Change
source: Change<span class="govuk-visually-hidden"> the {0}</span>
cy: Newid<span class="govuk-visually-hidden"> y {0}</span>

# Forms_DeclarationSection_ConfirmAndGetShareCode
source: Confirm and get share code
cy: Cadarnhau a chael cod rhannu

# Forms_FormElementAddress_InvalidCountryError
source: Invalid country name '{0}'
cy: Enw gwlad annilys '{0}'

# Forms_FormElementCheckBoxInput_DeclarationRequiredError
source: You must agree to the declaration statements to proceed.
cy: Mae'n rhaid i chi gytuno â'r datganiadau er mwyn parhau.

# Forms_FormElementDateInput_ExampleHint
source: For example, 27 3 2007
cy: Er enghraifft, 27 3 2007

# Forms_FormElementFileUpload_DocumentsHint
source: We accept most image and file formats that are smaller than 25MB.
cy: Rydym yn derbyn y rhan fwyaf o fformatau ffeil a delwedd sy'n llai na 25MB.

# Forms_FormElementFileUpload_FileSizeExceededError
source: The file must be smaller than {0}MB.
cy: Mae'n rhaid i'r ffeil fod yn llai na {0}MB.

# Forms_FormElementFileUpload_InvalidFileExtensionError
source: The file must be a {0}
cy: Mae'n rhaid i'r ffeil fod yn {0}

# Forms_FormElementFileUpload_NoFileSelectedError
source: Select a file
cy: Dewis ffeil

# Forms_FormElementFileUpload_UploadFileLabel
source: Upload a file
cy: Lanlwytho ffeil

# Forms_FormElementFileUpload_UploadedFileText
source: Uploaded file: {0}
cy: Ffeil wedi'i lanlwytho: {0}
