Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/StaticTextResource.*.resx
Languages: cy

# OrganisationOverView_Banner_PendingApproval
source: we need to approve your organisation. We'll email you, usually within one working day.
cy: Mae angen i ni gymeradwyo eich sefydliad. Byddwn yn anfon e-bost atoch, fel arfer o fewn un diwrnod gwaith.

# OrganisationOverView_Banner_PendingApproval_Hint
source: Before you can use this service:
cy: Cyn y gallwch ddefnyddio'r gwasanaeth hwn:

# OrganisationOverView_Banner_Review_MoU_Link
source: you must <a class="govuk-link" href="/organisation/{0}/review-and-sign-memorandom">read and agree the data sharing agreement</a>
cy: rhaid i chi <a class="govuk-link" href="/organisation/{0}/review-and-sign-memorandom">ddarllen y cytundeb rhannu data a chytuno arno</a>

# OrganisationOverview_RegisterAsBuyer_Link
source: Register as a buyer
cy: Cofrestru fel prynwr

# OrganisationOverview_RegisterAsBuyer_Text
source: If you also buy public sector goods, works, services or utilities.
cy: Os ydych hefyd yn prynu nwyddau, gwaith, gwasanaethau neu gyfleustodau sector cyhoeddus.

# OrganisationRegistration_BuyerDevolvedRegulation_Hint
source: A contracting authority operating in a devolved nation may be subject to devolved regulations. For example, Northern Ireland, Scotland or Wales.
cy: Gall awdurdod contractio sy'n gweithredu mewn gwlad ddatganoledig fod yn ddarostyngedig i reoliadau datganoledig. Er enghraifft, Cymru, Gogledd Iwerddon neu'r Alban.

# OrganisationRegistration_BuyerDevolvedRegulation_ValidationErrorMessage
source: Select yes or no
cy: Dewiswch ✓ neu X

# OrganisationRegistration_BuyerOrganisationType_Hint
source: Decide on your organisation type, as defined in the <a class="govuk-link" href="https://www.gov.uk/government/publications/procurement-act-2023-guidance-documents-plan-phase/guidance-contracting-authority-definition-html" target="_blank">contracting authority definition guidance (opens in new tab). </a>
cy: Penderfynwch ar eich math o sefydliad, fel y'i diffinnir yn y <a class="govuk-link" href="https://www.gov.uk/government/publications/procurement-act-2023-guidance-documents-plan-phase/guidance-contracting-authority-definition-html" target="_blank">canllawiau ar ddiffinio awdurdod contractio (agor mewn tab newydd). </a>

# OrganisationRegistration_BuyerOrganisationType_RegionalAndLocalGovernment_Label
source: Regional and local public authority (sub-central) - UK or devolved administrations
cy: Awdurdod cyhoeddus rhanbarthol a lleol (is-ganolog) – gweinyddiaeth y DU neu weinyddiaeth ddatganoledig

# OrganisationRegistration_BuyerSelectDevolvedRegulation_Hint
source: Read the <a class="govuk-link" href="https://www.gov.uk/government/publications/procurement-act-2023-guidance-documents-plan-phase/guidance-devolved-contracting-authorities-html#:~:text=Procurement%20is%20largely%20a%20devolved,are%20conducted%20and%20contracts%20managed." target="_blank">devolved contracting authorities guidance (opens in new tab). </a>
cy: Darllenwch y <a class="govuk-link" href="https://www.gov.uk/government/publications/procurement-act-2023-guidance-documents-plan-phase/guidance-devolved-contracting-authorities-html#:~:text=Procurement%20is%20largely%20a%20devolved,are%20conducted%20and%20contracts%20managed." target="_blank">canllawiau ar awdurdodau contractio datganoledig (agor mewn tab newydd). </a>

# OrganisationRegistration_Change_Identifier
source: Change<span class="govuk-visually-hidden"> organisation identifier</span>
cy: Newid<span class="govuk-visually-hidden"> dynodydd sefydliad</span>

source: We cannot find your company number on Companies House. If it’s correct, continue and enter your details manually.
cy: Ni allwn ddod o hyd i rif eich cwmni ar wefan Tŷ'r Cwmnïau. Os yw'n gywir, dylech barhau a rhoi eich manylion â llaw.

# OrganisationRegistration_CompanyHouseNumberQuestion_Hint
source: You can <a class="govuk-link" href="https://find-and-update.company-information.service.gov.uk/" target="_blank">find your company number on Companies House (opens in a new tab)</a>. It is an 8 digit or 2 letter and 6 digit number. For example, 12345678 or SC123456.
cy: Gallwch <a class="govuk-link" href="https://find-and-update.company-information.service.gov.uk/" target="_blank">ddod o hyd i rif eich cwmni ar wefan Tŷ'r Cwmnïau (bydd yn agor mewn tab newydd)</a>. Rhif 8 digid neu 2 lythyren a 6 digid ydyw. Er enghraifft, 12345678 neu SC123456.

# OrganisationRegistration_CompanyHouseNumberQuestion_ValidationErrorMessage
source: Select yes or no
cy: Dewiswch ✓ neu X

# OrganisationRegistration_Details_Change_Address
source: Change<span class="govuk-visually-hidden"> the registered address</span>
cy: Newid<span class="govuk-visually-hidden"> y cyfeiriad cofrestredig</span>

# OrganisationRegistration_Details_Change_Devolved_Regions
source: Change<span class="govuk-visually-hidden"> the devolved regions</span>
cy: Newid<span class="govuk-visually-hidden"> y rhanbarthau datganoledig</span>

# OrganisationRegistration_Details_Change_Devolved_Regulations
source: Change<span class="govuk-visually-hidden"> the devolved regulations</span>
cy: Newid<span class="govuk-visually-hidden"> y rheoliadau datganoledig</span>

# OrganisationRegistration_Details_Change_Email
source: Change<span class="govuk-visually-hidden"> the email address</span>
cy: Newid<span class="govuk-visually-hidden"> y cyfeiriad e-bost</span>

# OrganisationRegistration_Details_Change_Name
source: Change<span class="govuk-visually-hidden"> the organisation name</span>
cy: Newid<span class="govuk-visually-hidden"> enw'r sefydliad</span>

# OrganisationRegistration_Details_Change_Organisation_Type
source: Change<span class="govuk-visually-hidden"> the organisation type</span>
cy: Newid<span class="govuk-visually-hidden"> y math o sefydliad</span>

# OrganisationRegistration_Details_Title
source: Check your answers
cy: Gwiriwch eich atebion

# OrganisationRegistration_JoinOrganisation_ValidationErrorMessage
source: Select yes or no
cy: Dewiswch ✓ neu X

# OrganisationRegistration_SearchOrganisationName_ExactMatchAlreadyExists
source: The organisation you entered is already registered. Request to join the registered organisation or <a class="govuk-link" href="/registration/organisation-name\">enter a different name</a>.
cy: Mae'r sefydliad a gofnodwyd gennych wedi'i gofrestru yn barod. Gwnewch gais i ymuno â'r sefydliad cofrestredig neu <a class="govuk-link" href="/registration/organisation-name\">rhowch enw gwahanol</a>.

# OrganisationRegistration_SearchOrganisationName_Heading_Plural
source: Matches found
cy: Canfuwyd cyfatebiaethau

# OrganisationRegistration_SearchOrganisationName_Heading_Singular
source: Match found
cy: Canfuwyd cyfatebiaeth

# OrganisationRegistration_SearchOrganisationName_Hint
source: Register the name you entered or request to join an already registered organisation.
cy: Cofrestrwch yr enw a gofnodwyd gennych neu gwnewch gais i ymuno â sefydliad sydd eisoes wedi cofrestru.

# OrganisationRegistration_SearchOrganisationName_Register
source: Register
cy: Cofrestru

# OrganisationRegistration_SearchOrganisationName_RequestToJoin
source: Request to join
cy: Gwneud cais i ymuno

# OrganisationRegistration_SearchOrganisationName_ResultCount_Plural
source: {0} registered organisations found that match the name you entered.
cy: Wedi canfod {0} o sefydliadau cofrestredig sy'n cyfateb i'r enw a gofnodwyd gennych.

# OrganisationRegistration_SearchOrganisationName_ResultCount_Singular
source: {0} registered organisation found that matches the name you entered.
cy: Wedi canfod {0} sefydliad cofrestredig sy'n cyfateb i'r enw a gofnodwyd gennych.

# Organisation_BuyerRegistrationPendingApproval
source: Buyer registration pending
cy: Cofrestriad prynwr yn aros i gael ei gymeradwyo

# Organisation_OrganisationIdentification_CH_ErrorMessage
source: Enter the Companies House number
cy: Rhowch rif Tŷ'r Cwmnïau

# Organisation_OrganisationIdentification_GB_NHS_Number_ErrorMessage
source: Enter the ODS code
cy: Rhowch y cod ODS

# Organisation_OrganisationIdentification_GB_UKPRN_Number_Label
source: UK Register of Learning Providers (UKPRN number)
cy: Cofrestr Darparwyr Dysgu'r DU (rhif UKPRN)

# Organisation_OrganisationIdentification_Other_Hint
source: You'll be assigned a public procurement organisation number (PPON)
cy: Byddwch yn cael rhif sefydliad caffael cyhoeddus (PPON)

# PdfGenerator_OrganisationDetails_Title
source: Organisation details
cy: Manylion y sefydliad

# ShareYourInformation_BackConsortiumDetails
source: Back to consortium details
cy: Yn ôl i fanylion y sefydliad

# ShareYourInformation_ConsortiumShareCodeCreatedFooterBody1
source: You can save your share code and <a class="govuk-link" href="?handler=download&shareCode={0}">download your combined supplier information file</a> or come back and get them when needed.
cy: Gallwch gadw eich cod rhannu a <a class="govuk-link" href="?handler=download&shareCode={0}">lawrlwytho'r ffeil wybodaeth gyfun am y cyflenwr</a> neu ddychwelyd pan fydd eu hangen arnoch.

# Supplementary_CookieDetails_BannerMessages
source: Cookies that remember your settings
cy: Cwcis sy'n cofio eich gosodiadau

# Supplementary_CookieDetails_GoogleAnalytics
source: We use Google Analytics software to collect anonymised information about how you use Find a Tender. We do this to help make sure the site is meeting the needs of its users and to help us make improvements to the site.
cy: Rydym yn defnyddio meddalwedd Google Analytics i gasglu gwybodaeth ddienw ynglŷn â sut rydych yn defnyddio Canfod Tendr. Rydym yn gwneud hyn er mwyn helpu i wneud yn siŵr bod y wefan yn diwallu anghenion ei defnyddwyr a'n helpu i wneud gwelliannau iddi.

# Supplementary_CookieDetails_ListItem5
source: The following Contentsquare cookies are also set to measure website use:
cy: Caiff y cwcis canlynol gan Contentsquare eu gosod i fesur y defnydd o'r wefan hefyd:

# Supplementary_CookieDetails_TableRow_CS_C
source: Used by Contentsquare to save the user consent status for data collection
cy: Caiff ei ddefnyddio gan Contentsquare i gadw statws cydsynio'r defnyddiwr at ddibenion casglu data

# Supplementary_CookieDetails_TableRow_CS_ID
source: This cookie contains the Contentsquare's user identifier
cy: Mae'r cwci hwn yn cynnwys dyfais adnabod defnyddiwr Contentsquare

# Supplementary_CookieDetails_TableRow_CS_S
source: This cookie contains the number of page views within the running session for the Contentsquare solution
cy: Mae'r cwci hwn yn cynnwys sawl gwaith y caiff tudalen ei gweld o fewn y sesiwn redeg ar gyfer datrysiad Contentsquare

# Supplementary_CookieDetails_TableRow_FT_Auth
source: Provides Find a Tender with your account details once you’ve signed in
cy: Rhoi manylion eich cyfrif i Canfod Tendr ar ôl i chi fewngofnodi

# Supplementary_CookieDetails_TableRow_FT_BANNER_CLOSE
source: Prevents user research banner from appearing if close button is used
cy: Mae'n atal y faner ymchwil rhag ymddangos os caiff y botwm cau ei ddefnyddio

# Supplementary_CookieDetails_TableRow_FT_COOKIES_PREFERENCES_SET
source: Lets us know that you’ve saved your cookie consent settings
cy: Maeâ€™n rhoi gwybod i ni eich bod wedi cadw eich gosodiadau cydsyniad cwcis

# Supplementary_CookieDetails_TableRow_FT_LANGUAGE
source: Saves your preferred language for use of the site if not English
cy: Cadw eich dewis iaith ar gyfer defnyddio’r wefan os nad Saesneg yw’r iaith honno

# Supplementary_CookieDetails_TableRow_FT_PAGE_ACTIVE
source: Saves the outcome of the last check to see if the user should remain signed in to the site
cy: Cadw canlyniad y gwiriad diwethaf i weld a ddylai’r defnyddiwr barhau i fod wedi mewngofnodi i’r wefan

# Supplementary_CookieDetails_TableRow_FT_PAGE_LASTPOLL
source: Saves the date/time of the last check to see if the user should remain signed in to the site
cy: Cadw manylion am ddyddiad/amser y gwiriad diwethaf i weld a ddylai’r defnyddiwr barhau i fod wedi mewngofnodi i’r wefan

# Supplementary_CookieDetails_TableRow_FT_PAGE_TIMEOUT
source: Saves the date/time of the user’s last activity on the site
cy: Cadw manylion am ddyddiad/amser gweithgarwch diwethaf y defnyddiwr ar y wefan

# Supplementary_CookieDetails_TableRow_FT_USER_RESEARCH
source: Prevents user research banner from appearing if user has submitted form
cy: Mae'n atal y faner ymchwil defnyddwyr rhag ymddangos os yw'r defnyddiwr wedi cyflwyno'r ffurflen

# Supplementary_CookieDetails_TableRow_GA
source: This cookie is used with Google Analytics. This cookie allows Google to track unique users via a client identifier that is randomly generated
cy: Defnyddir y cwci hwn gyda Google Analytics. Mae’r cwci hwn yn galluogi Google i ddilyn trywydd defnyddwyr unigryw drwy ddynodydd cleient a gaiff ei greu ar hap

# Supplementary_CookieDetails_TableRow_GAT
source: This cookie is used with Google Analytics. It is used to reduce the number of page view requests.
cy: Defnyddir y cwci hwn gyda Google Analytics. Caiff ei ddefnyddio i leihau nifer y ceisiadau i weld tudalen.

# Supplementary_CookieDetails_TableRow_GID
source: This cookie is used with Google Analytics. It helps us count how many people visit the service by telling us if you’ve visited before.
cy: Defnyddir y cwci hwn gyda Google Analytics. Mae'n ein helpu i gyfrif faint o bobl sy'n ymweld â'r gwasanaeth drwy roi gwybod i ni a ydych wedi ymweld o'r blaen.

# Supplementary_CookieDetails_TableRow_SIRSI_FT_AUTH
source: Provides Find a Tender with your account details once you’ve signed in
cy: Rhoi manylion eich cyfrif i Canfod Tendr ar ôl i chi fewngofnodi

# Supplementary_Index_UnableToAuthenticate
source: Unable to authenticate user. Try again
cy: Nid oes modd dilysu'r defnyddiwr. Rhowch gynnig arall arni

# Supplementary_LoggedOut_Paragraph1
source: We did not save your answers.
cy: Ni wnaethom gadw eich atebion.

# Supplementary_LoggedOut_Title
source: For your security, we signed you out
cy: Er mwyn eich diogelu, gwnaethom eich allgofnodi

# Supplementary_PrivacyNotice_Title
source: Privacy notice
cy: Hysbysiad preifatrwydd

# Supplementary_SignedOut_Paragraph1
source: <a href="/one-login/sign-in" class="govuk-link break-word" aria-label="Sign in">Sign in</a> again, or <a class="govuk-link" href="{0}" class="govuk-link break-word">browse from the homepage</a> to find the information you need.
cy: <a href="/one-login/sign-in" class="govuk-link break-word" aria-label="Sign in">Mewngofnodwch</a> eto, neu <a class="govuk-link" href="{0}" class="govuk-link break-word">porwch o'r hafan</a> i ddod o hyd i'r wybodaeth sydd ei hangen arnoch.

# Supplementary_SignedOut_Paragraph2
source: <a href="/contact-us" class="govuk-link break-word">Contact us</a> if you are experiencing problems using Find a Tender.
cy: <a href="/contact-us" class="govuk-link break-word">Cysylltwch â ni</a> os ydych yn cael problemau wrth ddefnyddio Canfod Tendr.

# Supplementary_SignedOut_Title
source: You have been signed out
cy: Rydych wedi cael eich allgofnodi

# Supplementary_Title
source: Thank you for contacting Find a Tender
cy: Diolch am gysylltu â Canfod Tendr

# SupplierToBuyer_DevolvedRegulation_ErrorMessage
source: Select yes or no
cy: Dewiswch ✓ neu X

# SupplierToBuyer_OrganisationType_CentralGovernment
source: Central government - UK or devolved administrations
cy: Llywodraeth ganolog – gweinyddiaeth y DU neu weinyddiaeth ddatganoledig

# SupplierToBuyer_OrganisationType_CentralGovernment_Hint
source: Public authorities including arm's-length bodies and trading funds
cy: Awdurdodau cyhoeddus gan gynnwys cyrff hyd braich a chronfeydd masnachu

# SupplierToBuyer_OrganisationType_Hint
source: Decide on your organisation type, as defined in the <a class="govuk-link" href="https://www.gov.uk/government/publications/procurement-act-2023-guidance-documents-plan-phase/guidance-contracting-authority-definition-html" target="_blank">contracting authority definition guidance (opens in new tab) </a>
cy: Penderfynwch ar eich math o sefydliad, fel y'i diffinnir yn y <a class="govuk-link" href="https://www.gov.uk/government/publications/procurement-act-2023-guidance-documents-plan-phase/guidance-contracting-authority-definition-html" target="_blank">canllawiau ar ddiffinio awdurdod contractio (agor mewn tab newydd) </a>

# SupplierToBuyer_OrganisationType_PrivateUtility_Hint
source: A private company with a special or exclusive right to provide utilities to the public. For example, private companies supplying electricity.
cy: Cwmni preifat â hawl arbennig neu unigryw i ddarparu cyfleustodau i'r cyhoedd. Er enghraifft, cwmnïau preifat sy'n cyflenwi trydan.

# SupplierToBuyer_OrganisationType_PublicUndertakingAuthority_Hint
source: A commercial organisation subject to public oversight, providing utilities to the public. For example, transport networks operating commercially.
cy: Sefydliad masnachol a oruchwylir gan y cyhoedd, sy'n darparu cyfleustodau i'r cyhoedd. Er enghraifft, rhwydweithiau trafnidiaeth sy'n gweithredu'n fasnachol.

# SupplierToBuyer_OrganisationType_RegionalAndLocalGovernment
source: Regional and local public authority (sub-central) - UK or devolved administrations
cy: Awdurdod cyhoeddus rhanbarthol a lleol (is-ganolog) – gweinyddiaeth y DU neu weinyddiaeth ddatganoledig

# SupplierToBuyer_OrganisationType_RegionalAndLocalGovernment_Hint
source: Includes councils, charities, educational institutions, housing associations and blue light organisations.
cy: Yn cynnwys cynghorau, elusennau, sefydliadau addysg, cymdeithasau tai a sefydliadau golau glas.

# SupplierToBuyer_OrganisationType_Title
source: Select your buyer organisation type
cy: Dewiswch eich math o sefydliad prynu

source: Change<span class="govuk-visually-hidden"> the Companies House registration status and number</span>
cy: Newid<span class="govuk-visually-hidden"> statws a rhif cofrestru Tŷ'r Cwmnïau</span>

source: Company House no. {0}
cy: Rhif Tŷ'r Cwmnïau {0}

# Supplier_ConnectedEntity_ConnectedEntityCompanyQuestion_EnterNumberError
source: Enter the Companies House number
cy: Rhowch rif Tŷ'r Cwmnïau

# Supplier_ConnectedEntity_ConnectedEntityLegalFormQuestion_Hint
source: In the UK, this is a business structure or trading status. For example, limited company or limited liability partnership.
cy: Yn y DU, dyma yw strwythur y busnes neu'r statws masnachu. Er enghraifft, cwmni cyfyngedig neu bartneriaeth atebolrwydd cyfyngedig.

# Supplier_ConnectedEntity_ConnectedEntityRemoveConfirmation_ConfirmRemoveError
source: Select yes to confirm removal of the connected person
cy: Dewiswch ✓ i gadarnhau eich bod am ddileu'r person cysylltiedig

# Supplier_ConnectedEntity_ConnectedPersonSummary_AddAnotherConnectedPersonError
source: Select yes to add another connected person
cy: Dewiswch ✓ i ychwanegu person cysylltiedig arall

# Supplier_LegalFormLawRegistered_ErrorMessage
source: Enter the law under which your organisation is registered
cy: Nodwch o dan ba gyfraith y mae eich sefydliad wedi'i gofrestru

# Supplier_VatNumber_Error
source: Enter the VAT number
cy: Rhowch y rhif TAW

# Support_OrganisationApproval_AlreadyApproved_FlashMessage
source: {organisationName} has already been approved
cy: Mae {organisationName} eisoes wedi cael ei gymeradwyo

# Support_OrganisationApproval_OrganisationsCountHeading
source: There are {0} organisations
cy: Mae {0} sefydliad

# Support_OrganisationApproval_PotentialDuplicatesFound
source: Potential duplicates found
cy: Canfuwyd dyblygiadau posibl

# Support_Organisations_SearchTitleBuyer
source: Search buyer organisation
cy: Chwilio sefydliad prynu

# Support_Organisations_SearchTitleSupplier
source: Search supplier organisation
cy: Chwilio sefydliad cyflenwi

# Support_Organisations_TableHeader_AdminEmail
source: Admin
cy: Gweinyddwr

# Support_Organisations_TableHeader_OrgEmail
source: Org
cy: Sefydliad

# User_RemoveConfirmation_ConfirmValidation
source: Select yes to confirm removal of user
cy: Dewiswch ✓ i gadarnhau eich bod am ddileu'r defnyddiwr

# User_UserSummary_HasPersonValidation
source: Select yes to add another user
cy: Dewiswch ✓ i ychwanegu defnyddiwr arall

# SessionTimeoutWarningDialog_Header
source: Session timeout
cy: Terfyn amser sesiwn

# SessionTimeoutWarningDialog_Lede
source: Your session will time out soon.
cy: Bydd eich sesiwn yn cyrraedd y terfyn amser cyn bo hir.

# SessionTimeoutWarningDialog_Text
source: You will be signed out of your account if you do not respond in {0} minutes. We do this to keep your information secure.
cy: Byddwn yn eich allgofnodi o'ch cyfrif os an wnewch chi ymateb o fewn {0} munud. Gwnawn hyn er mwyn cadw eich gwybodaeth yn ddiogel.

# SessionTimeoutWarningDialog_Continue
source: Continue session
cy: Parhau â'r sesiwn

# SessionTimeoutWarningDialog_SignOut
source: Sign out
cy: Allgofnodi
