Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/StaticTextResource.*.resx
Languages: cy

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_DateInFuture
source: Date of insolvency must be today or in the past
cy: Mae'n rhaid i ddyddiad yr ansolfedd fod heddiw neu yn y gorffennol

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_DayInvalidError
source: Day must be a valid number
cy: Mae'n rhaid i'r diwrnod fod yn rhif dilys

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_DayRequiredError
source: Date of insolvency must include a day
cy: Mae'n rhaid i ddyddiad yr ansolfedd gynnwys diwrnod

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_InvalidDate
source: Date of insolvency must be a real date
cy: Mae'n rhaid i ddyddiad yr ansolfedd fod yn ddyddiad go iawn

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_MonthInvalidError
source: Month must be a valid number
cy: Mae'n rhaid i'r mis fod yn rhif dilys

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_MonthRequiredError
source: Date of insolvency must include a month
cy: Mae'n rhaid i ddyddiad yr ansolfedd gynnwys mis

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_YearInvalidError
source: Year must be a valid number
cy: Mae'n rhaid i'r flwyddyn fod yn rhif dilys

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_YearRequiredError
source: Date of insolvency must include a year
cy: Mae'n rhaid i ddyddiad yr ansolfedd gynnwys blwyddyn

source: Select where registered
cy: Dewiswch ble mae wedi'i gofrestru

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegistrationDate_DateInvalidError
source: Date of registration must be a real date
cy: Mae'n rhaid i'r dyddiad cofrestru fod yn ddyddiad go iawn

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegistrationDate_DayInvalidError
source: Day must be a valid number
cy: Mae'n rhaid i'r diwrnod fod yn rhif dilys

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegistrationDate_DayRequiredError
source: Date of registration must include a day
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys diwrnod

source: Month must be a valid number
cy: Mae'n rhaid i'r mis fod yn rhif dilys

source: Date of registration must include a month
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys mis

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegistrationDate_YearInvalidError
source: Year must be a valid number
cy: Mae'n rhaid i'r flwyddyn fod yn rhif dilys

source: Date of registration must include a year
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys blwyddyn

# Supplier_ConnectedEntity_ConnectedEntityDeclaration_Paragraph2
source: It includes <a class="govuk-link" href="https://www.gov.uk/guidance/people-with-significant-control-pscs" target="_blank">people with significant control (opens in new tab)</a> and any other individual or company other than yourself that has a declarable interest in your organisation.
cy: Mae'n cynnwys <a class="govuk-link" href="https://www.gov.uk/guidance/people-with-significant-control-pscs" target="_blank">pobl â rheolaeth sylweddol (bydd yn agor mewn tab newydd)</a> ac unrhyw unigolyn neu gwmni arall ar wahân i chi sydd â buddiant datganadwy yn eich sefydliad.

# Supplier_ConnectedEntity_ConnectedEntityDeclaration_Paragraph3
source: For example, a director, a trustee of a trust, a majority shareholder or a parent or subsidiary company.
cy: Er enghraifft, cyfarwyddwr, ymddiriedolaeth, cyfranddaliwr o bwys neu riant gwmni neu is-gwmni.

# Supplier_ConnectedEntity_ConnectedEntityDirectorResidency_SelectCountryError
source: Select a country
cy: Dewiswch wlad

# Supplier_ConnectedEntity_ConnectedEntityLawEnforce_Hint
source: In the UK the Companies Act 2006 enforces the limited company legal form.
cy: Yn y DU, Deddf Cwmnïau 2006 sy'n gorfodi ffurf gyfreithiol cwmnïau cyfyngedig.

source: Enter the overseas company registration number
cy: Rhowch rif cofrestru'r cwmni dramor

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthDayInvalidError
source: Day must be a valid number
cy: Mae'n rhaid i'r diwrnod fod yn rhif dilys

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthDayRequiredError
source: Date of birth must include a day
cy: Mae'n rhaid i'r dyddiad geni gynnwys diwrnod

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthInPastInvalidError
source: Date of birth must be today or in the past
cy: Mae'n rhaid i'r dyddiad geni fod heddiw neu yn y gorffennol

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthLabel
source: Date of birth
cy: Dyddiad geni

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthMonthInvalidError
source: Month must be a valid number
cy: Mae'n rhaid i'r mis fod yn rhif dilys

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthMonthRequiredError
source: Date of birth must include a month
cy: Mae'n rhaid i'r dyddiad geni gynnwys mis

source: Date of birth must be a real date
cy: Mae'n rhaid i'r dyddiad geni fod yn ddyddiad go iawn

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthYearInvalidError
source: Year must be a valid number
cy: Mae'n rhaid i'r flwyddyn fod yn rhif dilys

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_DateOfBirthYearRequiredError
source: Date of birth must include a year
cy: Mae'n rhaid i'r dyddiad geni gynnwys blwyddyn

# Supplier_ConnectedEntity_ConnectedEntityPscDetails_Heading
source: Enter the person with significant control's details
cy: Rhowch fanylion y person â rheolaeth sylweddol

source: Date of registration must be today or in the past
cy: Mae'n rhaid i'r dyddiad cofrestru fod heddiw neu yn y gorffennol

source: Date of registration must be a real date
cy: Mae'n rhaid i'r dyddiad cofrestru fod yn ddyddiad go iawn

# Supplier_ConnectedEntity_ConnectedEntityRegistrationDateQuestion_DayInvalidError
source: Day must be a valid number
cy: Mae'n rhaid i'r diwrnod fod yn rhif dilys

source: Date of registration must include a day
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys diwrnod

source: Month must be a valid number
cy: Mae'n rhaid i'r mis fod yn rhif dilys

source: Date of registration must include a month
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys mis

source: Year must be a valid number
cy: Mae'n rhaid i'r flwyddyn fod yn rhif dilys

source: Date of registration must include a year
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys blwyddyn

# Supplier_ConnectedEntity_ConnectedEntitySupplierCompanyQuestion_Hint
source: Is the supplier organisation registered with Companies House as required by the Companies Act 2006? We’ve already asked you this, but please reconfirm.
cy: A yw'r sefydliad cyflenwi wedi'i gofrestru â Th?'r Cwmnïau fel sy'n ofynnol gan Ddeddf Cwmnïau 2006? Rydym eisoes wedi gofyn hyn i chi, ond a fyddech cystal ag ailgadarnhau.

# Supplier_ConnectedEntity_ConnectedPersonSummary_BackToSupplierInformation
source: Back to supplier information
cy: Yn ôl i'r wybodaeth am y cyflenwr

# Supplier_InformationHint
source: We need information from you based on the type of supplier you are.
cy: Mae angen gwybodaeth arnom yn seiliedig ar ba fath o gyflenwr ydych chi.

# Supplier_LegalFormCompanyActQuestion_Title
source: Is your organisation registered with Companies House?
cy: A yw eich sefydliad wedi'i gofrestru â Th?'r Cwmnïau?

# Supplier_LegalFormFormationDate_DayErrorMessage
source: Date of registration must include a day
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys diwrnod

# Supplier_LegalFormFormationDate_DayInvalidErrorMessage
source: Day must be a valid number
cy: Mae'n rhaid i'r diwrnod fod yn rhif dilys

# Supplier_LegalFormFormationDate_FutureDateErrorMessage
source: Date of registration must be today or in the past
cy: Mae'n rhaid i'r dyddiad cofrestru fod heddiw neu yn y gorffennol

# Supplier_LegalFormFormationDate_InvalidDateErrorMessage
source: Date of registration must be a real date
cy: Mae'n rhaid i'r dyddiad cofrestru fod yn ddyddiad go iawn

# Supplier_LegalFormFormationDate_MonthErrorMessage
source: Date of registration must include a month
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys mis

# Supplier_LegalFormFormationDate_MonthInvalidErrorMessage
source: Month must be a valid number
cy: Mae'n rhaid i'r mis fod yn rhif dilys

# Supplier_LegalFormFormationDate_Title
source: What date was your organisation registered?
cy: Beth yw'r dyddiad cyfatebol y gwnaeth eich cwmni gofrestru o dan Ddeddf Cwmnïau 2006?

# Supplier_LegalFormFormationDate_YearErrorMessage
source: Date of registration must include a year
cy: Mae'n rhaid i'r dyddiad cofrestru gynnwys blwyddyn

# Supplier_LegalFormFormationDate_YearInvalidErrorMessage
source: Year must be a valid number
cy: Mae'n rhaid i'r flwyddyn fod yn rhif dilys

# Supplier_LegalFormLawRegistered_Error
source: Error:
cy: Gwall:

# Supplier_LegalFormLawRegistered_Hint
source: For example, the most common company law in the UK is the Companies Act 2006
cy: Er enghraifft, Deddf Cwmnïau 2006.

# Supplier_LegalFormLawRegistered_Title
source: Do you know the law under which your organisation is registered?
cy: Nodwch o dan ba gyfraith y mae eich sefydliad wedi'i gofrestru

# Supplier_LegalFormOtherOrganisation_PleaseSelect
source: Select your organisation's registered legal form
cy: Dewiswch ffurf gyfreithiol gofrestredig eich sefydliad

# Supplier_OperationQuestion_PublicService_Description
source: Public service mutuals are defined by having:
cy: Diffinnir cwmnïau cydfuddiannol gwasanaeth cyhoeddus ar y sail eu bod:

# Supplier_OperationQuestion_PublicService_Details
source: Previously left the public sector but continues delivering public services.
cy: Wedi gadael y sector cyhoeddus yn flaenorol ond yn parhau i ddarparu gwasanaethau cyhoeddus.

# Supplier_OperationQuestion_SelectOption
source: Select an option
cy: Dewiswch opsiwn

# Supplier_OperationQuestion_SmallAndMediumSized_Description
source: Small and medium-sized enterprises are defined by having:
cy: Diffinnir busnesau bach a chanolig ar y sail eu bod:

# Supplier_OperationQuestion_SupportedEmploymentProvider_Description
source: Supported employment providers are defined by having:
cy: Diffinnir darparwyr cyflogaeth â chymorth ar y sail eu bod:

# Supplier_OperationType_None_Short
source: My organisation is not defined
cy: Nid yw fy sefydliad wedi'i ddiffinio

# Supplier_OperationType_ValidationError
source: You cannot select 'None apply' along with other options.
cy: Ni allwch ddewis 'Dim un yn berthnasol' ynghyd ag opsiynau eraill.

# Supplier_SupplierInformationSummary_FormRecordCount
source: {0} added
cy: {0} cofnod

# Supplier_VatQuestion_BelongsToAnotherOrganisation_Error
source: This VAT number belongs to another organisation. Enter a different VAT number.
cy: Mae'r rhif TAW hwn yn perthyn i sefydliad arall. Rhowch rif TAW gwahanol.

# Supplier_VatQuestion_No
source: No
cy: Rhif

# Supplier_WebsiteQuestion_ErrorInvalidUrl
source: Website address must be in the correct format, like https://www.companyname.com
cy: Rhaid i gyfeiriad y wefan fod yn y fformat cywir, fel https://www.enwcwmni.com

# Supplier_WebsiteQuestion_ErrorSelectOption
source: Select an option
cy: Dewiswch opsiwn

# Support_OrganisationApproval_AdminEmail_List
source: Admin email
cy: E-bost gweinyddwr

# Support_OrganisationApproval_ErrorMessage
source: Tell the user why you could not approve
cy: Dywedwch wrth y defnyddiwr pam na allech ei gymeradwyo

# Support_OrganisationApproval_ErrorMessage_Hint
source: For example, ‘You need to change the email address. The domain name in the organisation email address you gave us does not match the organisation name you want to register’.
cy: Er enghraifft, Mae angen i chi newid y cyfeiriad e-bost. Nid yw enw'r parth yn y cyfeiriad e-bost y gwnaethoch ei roi i ni ar gyfer y sefydliad yn cyfateb i enw'r sefydliad rydych am ei gofrestru.

# Support_OrganisationApproval_PponGenerationPending_List
source: PPON generation pending
cy: PPON yn yr arfaeth

# Support_OrganisationApproval_Radio_Heading
source: Approve the request?
cy: Cymeradwyo'r cais?

# Support_OrganisationApproval_ValidationErrorMessage
source: Select an option
cy: Dewiswch opsiwn

# Support_Organisations_BuyerOrganisations_Link
source: Buyer organisations
cy: Sefydliadau prynu

# Support_Organisations_BuyerOrganisations_Title
source: Buyer organisations
cy: Sefydliadau prynu

# Support_Organisations_Review_Link
source: Review
cy: Adolygu

# Support_Organisations_Status_Approved
source: Approved
cy: Cymeradwywyd

# Support_Organisations_Status_Pending
source: Pending
cy: Yn yr Arfaeth

# Support_Organisations_SupplierOrganisations_Link
source: Supplier organisations
cy: Sefydliadau cyflenwi

# Support_Organisations_SupplierOrganisations_Title
source: Supplier organisations
cy: Sefydliadau cyflenwi

# Support_Organisations_TableHeader_Comments
source: Comments
cy: Sylwadau

# Support_Organisations_TableHeader_DateApproved
source: Date Approved
cy: Dyddiad cymeradwyo

# Support_Organisations_TableHeader_Identifier
source: Identifier/s
cy: Dynodydd(ion)

# Support_Organisations_TableHeader_LastReviewedBy
source: Last reviewed by
cy: Adolygwyd ddiwethaf gan

# UserSummary_Approve
source: Approve
cy: Cymeradwyo

# UserSummary_InviteExpired
source: Invite expired
cy: Gwahoddiad wedi dod i ben

# UserSummary_JoinRequests
source: Join requests
cy: Ceisiadau i ymuno

# UserSummary_ManageUsers_Title
source: Manage users
cy: Rheoli defnyddwyr

# UserSummary_Resend
source: Resend
cy: Ailanfon

# UserSummary_TotalUsers
source: Organisation has {0} {1}
cy: Mae gan y sefydliad {0} {1}

# UserSummary_User
source: user
cy: defnyddiwr

# UserSummary_Users
source: users
cy: o ddefnyddwyr

# User_Email_Required_ErrorMessage
source: Email required
cy: Mae angen cyfeiriad e-bost

# User_FirstName_Required_ErrorMessage
source: First name required
cy: Mae angen enw cyntaf

# User_LastName_Required_ErrorMessage
source: Last name required
cy: Mae angen cyfenw

# User_Role_Required_ErrorMessage
source: Role required
cy: Mae angen rôl

# Users_FirstName_Validation
source: Enter your first name
cy: Rhowch eich enw cyntaf

# Users_LastName_Validation
source: Enter your last name
cy: Rhowch eich cyfenw

# Users_SendEmail_Button
source: Send email
cy: Anfon e-bost

# Users_UserRole_Hint
source: Select the one that applies
cy: Dewiswch yr un sy'n berthnasol

# Users_UserRole_Label
source: Select user role
cy: Dewiswch rôl y defnyddiwr

# GovukFrontend_CharacterCount_CharactersAvailable
source: You can enter up to {0} characters
cy: Gallwch roi hyd at {0} o nodau

# GovukFrontend_CharacterCount_CharactersUnderLimit_One
source: You have %{count} character remaining
cy: Mae gennych %{count} nod ar ôl

# GovukFrontend_CharacterCount_CharactersUnderLimit_Other
source: You have %{count} characters remaining
cy: Mae gennych %{count} o nodau ar ôl

# GovukFrontend_CharacterCount_CharactersOverLimit_One
source: You have %{count} character too many
cy: Mae gennych %{count} nod yn ormod

# GovukFrontend_CharacterCount_CharactersOverLimit_Other
source: You have %{count} characters too many
cy: Mae gennych %{count} o nodau yn ormod

# GovukFrontend_CharacterCount_CharactersAtLimit
source: You have 0 characters remaining
cy: Mae 0 nod ar ôl

# ConsortiumShareMyInformation_HowItWorksParagraph1
source: To share the combined supplier information of the consortium with buyers you need to create a share code and file, and declare that all the information is correct.
cy: Er mwyn rhannu gwybodaeth gyfun am gyflenwyr y consortiwm â phrynwyr, bydd angen i chi greu ffeil a chod rhannu, a datgan bod y wybodaeth i gyd yn gywir.

# ConsortiumShareMyInformation_HowItWorksParagraph2
source: When you submit a bid for a procurement, the contracting authority will let you know how to give them the share code or file.
cy: Pan fyddwch yn gwneud cynnig am gaffaeliad, bydd yr awdurdod contractio yn rhoi gwybod i chi sut i ddarparu'r ffeil neu god rhannu.

# ConsortiumShareMyInformation_Title
source: Share your consortium information
cy: Rhannwch wybodaeth am eich consortiwm

# Consortium_ConsortiumConfirmSupplier_Heading
source: Add {0} to the consortium?
cy: Ychwanegu {0} at y consortiwm?

# Consortium_ConsortiumEnterSharecode_EnterSharecodeError
source: Enter a shareode
cy: Rhowch god rhannu

# Consortium_ConsortiumEnterSharecode_Heading
source: Enter a share code
cy: Rhowch god rhannu

# Consortium_ConsortiumEnterSharecode_Hint
source: Must be the organisation's most recent share code
cy: Rhaid mai hwn yw cod rhannu mwyaf diweddar y sefydliad

# Consortium_ConsortiumEnterSharecode_InValidSharecodeError
source: Invalid sharecode
cy: Cod rhannu annilys

# Consortium_ConsortiumEnterSharecode_InvalidCode
source: Share code not found.
cy: Heb ddod o hyd i'r cod rhannu.

# Consortium_ConsortiumEnterSharecode_SharecodeAlreadyExists
source: {0} organisation is already part of the consortium.
cy: Mae {0} sefydliad eisoes yn rhan o'r consortiwm.

# Consortium_ConsortiumOverview_Success_Heading
source: {0} has been added to this consortium.
cy: Ychwanegwyd {0} at y consortiwm hwn.

# ErrorMessageList_DuplicateApiKeyName
source: An API key with this name already exists. Try again.
cy: Mae allwedd API sydd â'r enw hwn eisoes yn bodoli. Rhowch gynnig arall arni.

# ErrorMessageList_DuplicateOrganisationName
source: An organisation with this name already exists. Try again.
cy: Mae sefydliad sydd â'r enw hwn eisoes yn bodoli. Rhowch gynnig arall arni.

# ErrorMessageList_DuplicatePersonName
source: A person with this name already exists. Try again.
cy: Mae person sydd â'r enw hwn eisoes yn bodoli. Rhowch gynnig arall arni.

# ErrorMessageList_PayLoadIssueOrNullArgument
source: Enter all the required information correctly.
cy: Rhowch yr holl wybodaeth ofynnol yn gywir.

# ErrorMessageList_SharecodeNotFound
source: Sharecode not found
cy: Heb ddod o hyd i'r cod rhannu

# ErrorMessageList_UnexpectedError
source: An unexpected error occurred. Try again.
cy: Bu gwall annisgwyl. Rhowch gynnig arall arni.

# ErrorMessageList_UnprocessableEntity
source: An unprocessable entity found. Try again.
cy: Daethpwyd o hyd i endid na ellir ei brosesu. Rhowch gynnig arall arni.

# Footer_Copyright
source: Crown copyright
cy: Hawlfraint y Goron

# Footer_OGL
source: All content is available under the <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
cy: Mae'r holl gynnwys ar gael o dan <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">y Drwydded Llywodraeth Agored f3.0</a>, oni nodir fel arall

# Footer_TED
source: Notices are based on TED XML schema. © European Union
cy: Mae’r hysbysiadau’n seiliedig ar sgema XML TED. © Undeb Ewropeaidd

# Global_Filter
source: Filter
cy: Hidlen

# Global_Next
source: Next
cy: Nesaf

# Global_No
source: No
cy: Rhif

# Global_PleaseSelect
source: Select an option
cy: Dewiswch opsiwn

# Global_Previous
source: Previous
cy: Blaenorol

# Global_SelectAnOption
source: Select an option
cy: Dewiswch opsiwn

# Global_SelectYesOrNo
source: Select yes or no
cy: Dewiswch ✓ neu X

# Global_SignAndContinue
source: Sign and continue
cy: Llofnodi a pharhau

# Global_Signin
source: Sign in
cy: Mewngofnodi

# Global_Warning
source: Warning
cy: Rhybudd

# Global_Yes
source: Yes
cy: Do/Oes

# MoU_DataSharingAgreement_Title
source: Data sharing agreement
cy: Cytundeb rhannu data

# MoU_ReviewAndSignComplete_Link
source: <a href="/organisation/{0}">Go back to organisation details</a> to view the agreement.
cy: <a href="/organisation/{0}">Ewch yn ôl i fanylion y sefydliad</a> i weld y cytundeb.

# MoU_ReviewAndSignComplete_Title
source: You've signed the data sharing agreement
cy: Rydych wedi llofnodi'r cytundeb rhannu data

# MoU_ReviewAndSign_ConfirmStatement
source: Enter the name and job title of the person that authorised the signing of the agreement:
cy: Rhowch enw a theitl swydd y person a wnaeth roi awdurdod i lofnodi'r cytundeb:

# MoU_ReviewAndSign_Confirm_Title
source: I confirm that I have read and agree to the data sharing agreement
cy: Rwy'n cadarnhau fy mod wedi darllen y cytundeb rhannu data ac fy mod yn cytuno arno

# MoU_ReviewAndSign_DownloadPdf_Link
source: Download the data sharing agreement
cy: Lawrlwytho'r cytundeb rhannu data

# MoU_ReviewAndSign_Download_Hint
source: Download and share the document within your organisation. When ready, return to this page to confirm that your organisation understands its responsibilities as a joint data controller.
cy: Lawrlwythwch y ddogfen a'i rhannu yn eich sefydliad. Pan fyddwch yn barod, dychwelwch i'r dudalen hon i gadarnhau bod eich sefydliad yn deall ei gyfrifoldebau fel cyd-reolydd data.

# MoU_ReviewAndSign_Download_Title
source: Download the agreement
cy: Lawrlwytho'r cytundeb

# MoU_ReviewAndSign_Hint
source: <p>The data sharing agreement is a memorandum of understanding (MOU) about data shared on the Find a Tender service (FTS) and the joint responsibilities of: </p> <ul class="govuk-list govuk-list--bullet"> <li>the Cabinet Office</li> <li>contracting authorities taking part in public procurement</li> </ul> <p> The MOU explains the: </p> <ul class="govuk-list govuk-list--bullet"> <li>personal and sensitive data collected on FTS</li> <li>role and responsibilities of the Cabinet Office</li> <li>role and responsibilities of the contracting authority</li> </ul>
cy: <p>Memorandwm cyd-ddealltwriaeth yw'r cytundeb rhannu data ynghylch data a rennir ar y gwasanaeth Canfod Tendr a chyd-gyfrifoldebau: </p> <ul class="govuk-list govuk-list--bullet"> <li>Swyddfa'r Cabinet</li> <li>yr awdurdodau contractio sy'n cymryd rhan mewn caffaeliad cyhoeddus</li> </ul> <p> Mae'r memorandwm cyd-ddealltwriaeth yn esbonio'r canlynol: </p> <ul class="govuk-list govuk-list--bullet"> <li>y data personol a sensitif a gesglir ar Canfod Tendr</li> <li>rôl a chyfrifoldebau Swyddfa'r Cabinet</li> <li>rôl a chyfrifoldebau'r awdurdod contractio</li> </ul>

# MoU_ReviewAndSign_Job_Title
source: Job title
cy: Teitl swydd

# MoU_ReviewAndSign_Job_Title_ErrorMessage
source: Enter your job title
cy: Rhowch deitl eich swydd

# MoU_ReviewAndSign_Name
source: Full name
cy: Enw llawn

# MoU_ReviewAndSign_Name_ErrorMessage
source: Provide a name
cy: Rhowch enw

# MoU_ReviewAndSign_Options_Hint
source: By ticking the box you are 'signing' the data sharing agreement on behalf of your organisation. The details you provide will be saved and dated as proof of agreement with the MOU.<br><br>You'll be able to view the document and signing information from your organisation details page.
cy: Drwy dicio'r blwch rydych yn 'llofnodi' y cytundeb rhannu data ar ran eich sefydliad. Caiff y manylion a ddarparerir gennych eu cadw a'u dyddio fel prawf eich bod yn cytuno ar y memorandwm cyd-ddealltwriaeth.<br><br>Byddwch yn gallu gweld y ddogfen a'r wybodaeth lofnodi o dudalen manylion eich sefydliad.

# MoU_ReviewAndSign_Options_Title
source: Confirm you have read and agree to the MOU
cy: Cadarnhewch eich bod wedi darllen y memorandwm cyd-ddealltwriaeth a'ch bod yn cytuno arno

# MoU_ReviewAndSign_SelectCheckbox_ErrorMessage
source: Tick the checkbox, if you have read and agree to the data sharing agreement
cy: Ticiwch y blwch os ydych wedi darllen y cytundeb rhannu data ac yn cytuno arno

# MoU_ReviewAndSign_Title
source: Read and agree to the data sharing agreement
cy: Darllenwch a chytunwch ar y cytundeb rhannu data

# MoU_ReviewAndSign_Warning
source: You should sign the MOU before you get any supplier information from FTS.
cy: Dylech ddarllen y memorandwm cyd-ddealltwriaeth cyn cael unrhyw wybodaeth am gyflenwr gan y gwasanaeth Canfod Tendr.

# MoU_SignAndContinue
source: Sign and continue
cy: Llofnodi a pharhau

# MoU_SignedOn
source: Agreed on {0}
cy: Cytunwyd ar {0}
