Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/StaticTextResource.*.resx
Languages: cy

# Forms_FormElementMultiLineInput_AllInformationRequiredError
source: All information is required on this page
cy: Mae angen yr holl wybodaeth ar y dudalen hon

# Forms_FormElementMultiLineInput_CharacterCountError
source: Enter 10,000 characters or fewer
cy: Rhowch 10,000 o nodau neu lai

# Forms_FormElementTextInput_EnterValueError
source: Enter a value
cy: Rhowch werth

# Forms_FormElementTextInput_InvalidEmailError
source: Enter an email address in the correct format, like name@example.com
cy: Rhowch gyfeiriad e-bost yn y fformat cywir, fel enw@enghraifft.com

# Forms_FormElementUrlInput_EnterWebsiteAddressError
source: Enter a website address
cy: Rhowch gyfeiriad gwefan

# Forms_FormElementUrlInput_InvalidWebsiteAddressError
source: Enter a website address in the correct format, like www.companyname.com
cy: Rhowch gyfeiriad gwefan yn y fformat cywir, fel www.enwcwmni.com

# Global_Approve
source: Approve
cy: Cymeradwyo

# Global_Back
source: Back
cy: Yn ôl

# Global_DateInput_DateMustBeTodayOrInThePast
source: Date must be today or in the past
cy: Mae'n rhaid i’r dyddiad fod heddiw neu yn y gorffennol

# Global_DateInput_DateInvalidError
source: Date must be a real date
cy: Mae'n rhaid i'r dyddiad fod yn ddyddiad go iawn

# Global_DateInput_DayInvalidError
source: Day must be a valid number
cy: Mae'n rhaid i'r diwrnod fod yn rhif dilys

# Global_DateInput_DayRequiredError
source: Date must include a day
cy: Mae'n rhaid i'r dyddiad gynnwys diwrnod

# Global_DateInput_MonthInvalidError
source: Month must be a valid number
cy: Mae'n rhaid i'r mis fod yn rhif dilys

# Global_DateInput_MonthRequiredError
source: Date must include a month
cy: Mae'n rhaid i'r dyddiad gynnwys mis

# Global_DateInput_YearInvalidError
source: Year must be a valid number
cy: Mae'n rhaid i'r flwyddyn fod yn rhif dilys

# Global_DateInput_YearRequiredError
source: Date must include a year
cy: Mae'n rhaid i'r dyddiad gynnwys blwyddyn

# Global_Download
source: Download
cy: Lawrlwytho

# Global_Email_Invalid_ErrorMessage
source: Enter an email address in the correct format, like name@example.com
cy: Rhowch gyfeiriad e-bost yn y fformat cywir, fel enw@enghraifft.com

# Global_Error
source: Error
cy: Gwall

# Global_ErrorSummary_Heading
source: There is a problem
cy: Mae problem wedi codi

# Global_GoBackToMyAccount
source: Go back to my account
cy: Yn ôl i fy nghyfrif

# Global_Important
source: Important
cy: Pwysig

# Global_NotApplicable
source: N/A
cy: Dd/G

# Global_NotApplicableLong
source: Not applicable
cy: Ddim yn gymwys

# Global_RadioField_SelectOptionError
source: Select an option
cy: Dewiswch opsiwn

# Global_RadioField__InvalidOptionError
source: Invalid option selected
cy: Opsiwn annilys wedi'i ddewis

# Global_SaveAndContinue
source: Continue
cy: Cadw a pharhau

# Global_SaveAndExit
source: Save and exit
cy: Cadw a gadael

# Global_SendMessage
source: Send message
cy: Anfon neges

# Global_Submit
source: Submit
cy: Cyflwyno

# CookieBanner_Title
source: Cookies on Find a Tender
cy: Cwcis ar Canfod Tendr

# CookieBanner_Paragraph1
source: We use some essential cookies to make this service work.
cy: Rydym yn defnyddio rhai cwcis hanfodol er mwyn gwneud i'r gwasanaeth hwn weithio.

# CookieBanner_Paragraph2
source: We’d also like to use analytics cookies so we can understand how you use the service and make improvements.
cy: Hoffem hefyd ddefnyddio cwcis dadansoddeg fel y gallwn ddeall sut rydych yn defnyddio'r gwasanaeth a gwneud gwelliannau.

# CookieBanner_AcceptButton
source: Accept analytics cookies
cy: Derbyn cwcis dadansoddeg

# CookieBanner_RejectButton
source: Reject analytics cookies
cy: Gwrthod cwcis dadansoddeg

# CookieBanner_ViewCookies
source: View cookies
cy: Gweld y cwcis

# CookieBanner_AcceptedStatement
source: You’ve accepted additional cookies.
cy: Rydych wedi derbyn cwcis dadansoddeg.

# CookieBanner_RejectedStatement
source: You’ve rejected additional cookies.
cy: Rydych wedi gwrthod cwcis dadansoddeg.

# CookieBanner_ChangeCookieSettings
source: You can <a class="govuk-link" href="/cookies">change your cookie settings</a> at any time.
cy: Gallwch <a class="govuk-link" href="/cookies">newid eich gosodiadau cwcis</a> unrhyw bryd.

# CookieBanner_HideCookieMessage
source: Hide cookie message
cy: Cuddio'r neges hon

# Header_MyAccount
source: My account
cy: Fy nghyfrif

# Header_Support
source: Support
cy: Cymorth

# OrganisationInviteExpired_Body
source: You may have a newer invitation or need to request to join again.
cy: Efallai fod gennych wahoddiad mwy diweddar neu fod angen i chi wneud cais i ymuno eto.

# OrganisationInviteExpired_Link
source: Go to my account
cy: Mynd i fy nghyfrif

# OrganisationInviteExpired_Title
source: Your invite has expired
cy: Mae eich gwahoddiad wedi dod i ben

# OrganisationRegistration_Address_Buyer_Hint
source: The principal address the organisation conducts its activities. For example, a head office.
cy: Y prif gyfeiriad lle mae'r sefydliad yn gweithredu. Er enghraifft, pencadlys.

# OrganisationRegistration_Address_NonUk_Heading
source: Enter your organisation's registered non-UK address
cy: Rhowch gyfeiriad cofrestredig eich sefydliad y tu allan i'r DU

# OrganisationRegistration_BuyerDevolvedRegulation_Heading
source: Do devolved nation regulations apply to your organisation?
cy: A yw rheoliadau datganoledig yn gymwys i'ch sefydliad?

# OrganisationRegistration_BuyerOrganisationType_CentralGovernment_Hint
source: Public authorities including arm's-length bodies and trading funds
cy: Awdurdodau cyhoeddus gan gynnwys cyrff hyd braich a chronfeydd masnachu

# OrganisationRegistration_BuyerOrganisationType_CentralGovernment_Label
source: Central government - UK or devolved administrations
cy: Llywodraeth ganolog – gweinyddiaeth y DU neu weinyddiaeth ddatganoledig

# OrganisationRegistration_BuyerOrganisationType_Heading
source: Select your buyer organisation type
cy: Dewiswch eich math o sefydliad prynu

# OrganisationRegistration_BuyerOrganisationType_OtherEnterType_Label
source: Enter buyer organisation type
cy: Rhowch y math

# OrganisationRegistration_BuyerOrganisationType_Other_Hint
source: Does not apply to local authority subsidiaries or limited companies connected to a public authority
cy: Er enghraifft, awdurdod nad yw'n contractio yn sefydlu marchnad ddynamig ar gyfer cyfleustodau.

# OrganisationRegistration_BuyerOrganisationType_PrivateUtility_Hint
source: A private company with a special or exclusive right to provide utilities to the public. For example, private companies supplying electricity.
cy: Cwmni preifat â hawl arbennig neu unigryw i ddarparu cyfleustodau i'r cyhoedd. Er enghraifft, cwmnïau preifat sy'n cyflenwi trydan.

# OrganisationRegistration_BuyerOrganisationType_PublicUndertaking_Hint
source: A commercial organisation subject to public oversight, providing utilities to the public. For example, transport networks operating commercially.
cy: Sefydliad masnachol a oruchwylir gan y cyhoedd, sy'n darparu cyfleustodau i'r cyhoedd. Er enghraifft, rhwydweithiau trafnidiaeth sy'n gweithredu'n fasnachol.

# OrganisationRegistration_BuyerOrganisationType_RegionalAndLocalGovernment_Hint
source: Includes councils, charities, educational institutions, housing associations and blue light organisations
cy: Yn cynnwys cynghorau, elusennau, sefydliadau addysg, cymdeithasau tai a sefydliadau golau glas.

# OrganisationRegistration_BuyerOrganisationType_ValidationErrorMessage
source: Select your buyer organisation type
cy: Dewiswch eich math o sefydliad prynu

# OrganisationRegistration_BuyerSelectDevolvedRegulation_Heading
source: Select which devolved nation regulations apply
cy: Dewiswch pa reoliadau datganoledig sy'n gymwys

source: An organisation with this company number already exists. Change the company number or <a class="govuk-notification-banner__link" href="/registration/{organisationIdentifier}/join-organisation">request to join {organisationName}.</a>
cy: Mae sefydliad sydd â'r rhif cwmni hwn eisoes yn bodoli. Newid rhif y cwmni neu <a class="govuk-notification-banner__link" href="/registration/{organisationIdentifier}/join-organisation">wneud cais i ymuno â {organisationName}.</a>

# OrganisationRegistration_EnterOrganisationEmail_Hint
source: Where possible, use a shared inbox that other team members can access
cy: Lle y bo'n bosibl, defnyddiwch fewnflwch a rennir y gall aelodau eraill y tîm gael mynediad iddo

# OrganisationRegistration_InternationalIdentifier_Country_Heading
source: Select where your organisation is registered
cy: Dewiswch ble mae eich sefydliad wedi'i gofrestru

# OrganisationRegistration_InternationalIdentifier_Country_Required_ErrorMessage
source: Select a country
cy: Dewiswch wlad

# OrganisationRegistration_InternationalIdentifier_Heading
source: Select your organisation's registry
cy: Dewiswch gofrestrfa eich sefydliad

# OrganisationRegistration_InternationalIdentifier_None
source: You cannot add another identifier for this country.
cy: Ni allwch ychwanegu dynodydd arall ar gyfer y wlad hon.

source: Enter the number
cy: Rhowch y rhif

# OrganisationRegistration_InternationalIdentifier_Select_Indentifier
source: Select one then enter the registration number
cy: Dewiswch un wedyn rhowch y rhif cofrestru

# OrganisationRegistration_InternationalIdentifier_Type_Required_ErrorMessage
source: Select an option
cy: Dewiswch opsiwn

# OrganisationRegistration_JoinOrganisationSuccess_Heading
source: Your request to join {0} has been sent
cy: Mae eich cais i ymuno â {0} wedi'i anfon

# OrganisationRegistration_JoinOrganisationSuccess_Message
source: You'll receive an email about your request.
cy: Byddwch yn cael e-bost am eich cais.

# OrganisationRegistration_JoinOrganisation_AlreadyMemberOfOrganisation
source: You are already a member of this organisation. <a class="govuk-notification-banner__link" href="/organisation-selection">Go back to my account</a>
cy: Rydych eisoes yn aelod o'r sefydliad hwn. <a class="govuk-notification-banner__link" href="/organisation-selection">Yn ôl i fy nghyfrif</a>

# OrganisationRegistration_JoinOrganisation_ConfirmValidationErrorMessage
source: Select that you understand your name and email address will be shared
cy: Dewiswch eich bod yn deall y bydd eich enw a'ch cyfeiriad e-bost yn cael eu rhannu

# OrganisationRegistration_JoinOrganisation_Heading
source: Send a request to join {0}?
cy: Anfon cais i ymuno â {0}?

# OrganisationRegistration_JoinOrganisation_PendingMemberOfOrganisation
source: You have already requested to join this organisation. Your request is pending approval. <a class="govuk-notification-banner__link" href="/organisation-selection">Go back to my account</a>
cy: Rydych eisoes wedi gwneud cais i ymuno â'r sefydliad hwn. Mae eich cais yn aros i gael ei gymeradwyo. <a class="govuk-notification-banner__link" href="/organisation-selection">Yn ôl i fy nghyfrif</a>

# OrganisationRegistration_UserConfirm
source: I understand my name and email address will be shared with this organisation
cy: Rwy'n deall y bydd fy enw a'm cyfeiriad e-bost yn cael eu rhannu â'r sefydliad hwn

# OrganisationSchemeType_CharityCommissionEnglandWales
source: Charity Commission (England and Wales)
cy: Comisiwn Elusennau (Cymru a Lloegr)

# OrganisationSchemeType_CharityCommissionNorthernIreland
source: Charity Commission for Northern Ireland
cy: Comisiwn Elusennau Gogledd Iwerddon

# OrganisationSchemeType_GuernseyRegistry
source: Guernsey Registry
cy: Cofrestrfa Guernsey

# OrganisationSchemeType_IsleOfManCompaniesRegistry
source: Isle of Man Companies Registry
cy: Cofrestrfa Gwmnïau Ynys Manaw

# OrganisationSchemeType_JerseyFinancialServicesCommission
source: Jersey Financial Services Commission Registry
cy: Cofrestrfa Comisiwn Gwasanaethau Ariannol Jersey

# OrganisationSchemeType_MutualsPublicRegister
source: Mutuals Public Register
cy: Cofrestr Gyhoeddus y Cwmnïau Cydfuddiannol

# OrganisationSchemeType_NHSOrganisationsRegistry
source: NHS Organisation Data Service
cy: Gwasanaeth Data Sefydliadol y GIG

# OrganisationSchemeType_OtherNone
source: Other / None
cy: Arall / Dim

# OrganisationSchemeType_Ppon
source: Public procurement organisation number (PPON)
cy: Rhif y sefydliad caffael cyhoeddus (PPON)

# OrganisationSchemeType_UKRegisterOfLearningProviders
source: UK Register of Learning Providers (UKPRN number)
cy: Cofrestr Darparwyr Dysgu'r DU (rhif UKPRN)

# Organisation_AddAddress
source: Add<span class="govuk-visually-hidden"> address</span>
cy: Ychwanegu<span class="govuk-visually-hidden"> cyfeiriad</span>

# Organisation_AddOrganisationIdentifier
source: Add<span class="govuk-visually-hidden"> organisation identifier</span>
cy: Ychwanegu<span class="govuk-visually-hidden"> dynodyddion y sefydliad</span>

# Organisation_AfterYouveRegistered
source: After you've registered
cy: Ar ôl i chi gofrestru

# Organisation_ApiKeysForBuyers
source: (for buyers)
cy: (prynwyr)

# Organisation_ChangeSignInDetails
source: You can <a class="govuk-link govuk-link--no-visited-state" href="{0}" target="_blank">change your sign in details in your GOV.UK One Login</a>.
cy: Gallwch <a class="govuk-link govuk-link--no-visited-state" href="{0}" target="_blank">newid eich manylion mewngofnodi yn eich GOV.UK One Login</a>.

# Organisation_CompleteAndShareSupplierInformation
source: Complete and share your supplier information to bid for procurements.
cy: Bydd angen i chi gwblhau a rhannu eich gwybodaeth am y cyflenwr er mwyn cynnig am gaffaeliadau.

# Organisation_CompleteSupplierInformation
source: Complete supplier information
cy: Cwblhewch y wybodaeth am y cyflenwr

# Organisation_ConsortiumName
source: Consortium name
cy: Enw'r consortiwm

# Organisation_CreateApiKey
source: Create an API key and share it with the e-Sender you use to publish procurement notices.
cy: Crëwch allwedd API a'i rannu â'r e-Anfonwr rydych yn ei ddefnyddio i gyhoeddi hysbysiadau caffael.

# Organisation_EnterOrganisationName_Buyer_Hint
source: If you’re a department, agency or public body on the <a class="govuk-link" target="_blank" href="https://www.gov.uk/government/organisations">GOV.UK organisations list (opens in a new tab)</a>, use the exact name shown. If not, use your full official name. For example, HM Revenue & Customs not HMRC.
cy: Os ydych yn adran, asiantaeth neu gorff cyhoeddus ar restr sefydliadau GOV.UK <a class="govuk-link" target="_blank" href="https://www.gov.uk/government/organisations"> (bydd yn agor mewn tab newydd)</a>, defnyddiwch yr union enw a ddangosir. Fel arall, defnyddiwch eich enw swyddogol llawn. Er enghraifft, Cyllid a Thollau EF nid CThEF.

# Organisation_GetProcurementGuidance
source: For tools to guide you through the end-to-end commercial lifecycle use the
cy: Am adnoddau i'ch tywys drwy'r cylch bywyd masnachol o'r dechrau i'r diwedd, defnyddiwch

# Organisation_IfYouNeedTo
source: If you need to you can:
cy: Os bydd angen, gallwch wneud y canlynol:

# Organisation_ManageUsers
source: Manage users
cy: Rheoli defnyddwyr

# Organisation_MyAccount
source: My account
cy: Fy nghyfrif

# Organisation_MyOrganisations
source: My organisations
cy: Fy sefydliadau

# Organisation_NotApproved
source: Not approved
cy: Heb ei gymeradwyo

# Organisation_OrganisationIdentification_ErrorMessage
source: Select a registry
cy: Dewiswch gofrestrfa

# Organisation_OrganisationIdentification_GB_CHC_Number_ErrorMessage
source: Enter the charity number
cy: Rhowch rif yr elusen

# Organisation_OrganisationIdentification_GB_CHC_Number_Label
source: Charity Commission (England and Wales)
cy: Comisiwn Elusennau (Cymru a Lloegr)

# Organisation_OrganisationIdentification_GB_MPR_Number_ErrorMessage
source: Enter the registration number
cy: Rhowch y rhif cofrestru

# Organisation_OrganisationIdentification_GB_MPR_Number_Label
source: Mutuals Public Register
cy: Cofrestr Gyhoeddus y Cwmnïau Cydfuddiannol

# Organisation_OrganisationIdentification_GB_NHS_Number_Label
source: NHS Organisation Data Service
cy: Gwasanaeth Data Sefydliadol y GIG

# Organisation_OrganisationIdentification_GB_NIC_Number_ErrorMessage
source: Enter the charity number
cy: Rhowch rif yr elusen

# Organisation_OrganisationIdentification_GB_NIC_Number_Label
source: Charity Commission for Northern Ireland
cy: Comisiwn Elusennau Gogledd Iwerddon

# Organisation_OrganisationIdentification_GB_SC_Number_ErrorMessage
source: Enter the charity number
cy: Rhowch rif yr elusen

# Organisation_OrganisationIdentification_GB_SC_Number_Label
source: Scottish Charity Register
cy: Cofrestr Elusennau'r Alban

# Organisation_OrganisationIdentification_GB_UKPRN_Number_ErrorMessage
source: Enter the UK Provider Reference Number (UKPRN)
cy: Rhodwch Gyfeirnod Darparwr y DU (UKPRN)

# Organisation_OrganisationIdentification_GG_RCE_Number_ErrorMessage
source: Enter the entity number
cy: Rhowch rif yr endid

# Organisation_OrganisationIdentification_GG_RCE_Number_Label
source: Guernsey Registry
cy: Cofrestrfa Guernsey

# Organisation_OrganisationIdentification_Heading
source: Is your organisation on any of these registries?
cy: A yw eich sefydliad ar unrhyw un o'r cofrestrfeydd hyn?

# Organisation_OrganisationIdentification_Hint
source: Select one option. Then enter the registration number.
cy: Dewiswch un opsiwn. Yna rhowch y rhif cofrestru.

# Organisation_OrganisationIdentification_IM_CR_Number_ErrorMessage
source: Enter the company number
cy: Rhowch rif y cwmni

# Organisation_OrganisationIdentification_IM_CR_Number_Label
source: Isle of Man Companies Registry
cy: Cofrestrfa Gwmnïau Ynys Manaw

# Organisation_OrganisationIdentification_JE_FSC_Number_ErrorMessage
source: Enter the registration number
cy: Rhowch y rhif cofrestru

# Organisation_OrganisationIdentification_JE_FSC_Number_Label
source: Jersey Financial Services Commission Registry
cy: Cofrestrfa Comisiwn Gwasanaethau Ariannol Jersey

# Organisation_OrganisationIdentification_Multiple_Hint
source: Select all that apply. Then enter the registration number.
cy: Dewiswch bob un sy'n berthnasol. Yna rhowch y rhif cofrestru.

# Organisation_OrganisationIdentification_Number_ErrorMessage
source: Enter the registration number
cy: Rhowch y rhif cofrestru

# Organisation_OrganisationIdentification_ODS_Code_ErrorMessage
source: Enter the ODS code
cy: Rhowch y cod ODS

# Organisation_PponGenerationPending
source: PPON generation pending.
cy: PPON yn yr arfaeth.

# Organisation_ProcurementPathwayService
source: Procurement Pathway service (opens in new tab)
cy: Gwasanaeth Llwybr Caffael (bydd yn agor mewn tab newydd)

# Organisation_RegisterAnOrganisation
source: Register an organisation
cy: Cofrestru sefydliad

# Organisation_RegisterAsOtherRole
source: register as the other role, if you are both a buyer and supplier
cy: cofrestru fel y rôl arall, os ydych yn brynwr ac yn gyflenwr

# Organisation_RegisterAsSupplier
source: Register as a supplier
cy: Cofrestru fel cyflenwr

# Organisation_RegisterOrganisation
source: Register an organisation if you are:
cy: Dylech gofrestru sefydliad os ydych yn:

# Organisation_RegistrationNotApproved
source: Registration not approved
cy: Nid yw'r cais i gofrestru wedi'i gymeradwyo

# Organisation_SignInDetails
source: Sign in details
cy: Manylion mewngofnodi

# Organisation_SupplyGoodsServices
source: If you also supply goods, works, services or utilities to the public sector.
cy: Os ydych hefyd yn cyflenwi nwyddau, gwaith, gwasanaethau neu gyfleustodau i'r sector cyhoeddus.

# Organisation_ViewAddRemoveUsers
source: View, add or remove users.
cy: Gweld, ychwanegu neu ddileu defnyddwyr.

# Organisation_ViewApiKeys
source: View API keys
cy: Gweld allweddi API

# Organisation_WeCouldNotApproveYourRequest
source: We could not approve your request because:
cy: Ni allem gymeradwyo eich cais oherwydd:

# PdfGenerator_AdditionalIdentifiers
source: Other registries
cy: Cofrestrfeydd eraill

# PdfGenerator_BasicInformation_LawRegistered
source: Law registered
cy: Cyfraith a gofrestrwyd

# PdfGenerator_BasicInformation_RegistrationDate
source: Registration date
cy: Dyddiad cofrestru

# PdfGenerator_ConnectedOrganisationInformation_RegistrationDate
source: Registration date
cy: Dyddiad cofrestru

# PdfGenerator_ConnectedOrganisationInformation_Title
source: Connected organisation information
cy: Gwybodaeth am sefydliad cysylltiedig

# PdfGenerator_ConnectedPersonInformation_Title
source: People connected to your organisation
cy: Pobl sy'n gysylltiedig â'r sefydliad

# PdfGenerator_ConnectedPerson_LawRegistered
source: Law registered
cy: Cyfraith a gofrestrwyd

# PdfGenerator_ConnectedPerson_Locality
source: Locality
cy: Ardal leol

# PdfGenerator_ConnectedPerson_RegisteredLegalForm
source: Registered legal form
cy: Ffurf gyfreithiol gofrestredig

# PdfGenerator_ConnectedPerson_ResidentCountry
source: Resident country
cy: Gwlad breswyl

# PdfGenerator_ConnectedPerson_StreetAddress
source: Street address
cy: Cyfeiriad stryd

# PdfGenerator_Footer_GeneratedOn
source: Generated on
cy: Cynhyrchwyd ar

# PdfGenerator_IdentifierId
source: Number
cy: Rhif

# PdfGenerator_IndividualTrustInformation_Title
source: Individual trustee information
cy: Gwybodaeth am ymddiriedolaeth unigol

# PdfGenerator_LegalName
source: Legal name
cy: Enw cyfreithiol

# PdfGenerator_NoAdditionalIdentifiersAvailableMsg
source: No additional identifiers available.
cy: Nid oes unrhyw ddynodyddion ychwanegol ar gael.

# PdfGenerator_OrganisationSchemeTitle_CharityCommission
source: Charity Commission (England and Wales)
cy: Comisiwn Elusennau (Cymru a Lloegr)

# PdfGenerator_OrganisationSchemeTitle_GuernseyRegistry
source: Guernsey Registry
cy: Cofrestrfa Guernsey

# PdfGenerator_OrganisationSchemeTitle_IsleOfManCompaniesRegistry
source: Isle of Man Companies Registry
cy: Cofrestrfa Gwmnïau Ynys Manaw

# PdfGenerator_OrganisationSchemeTitle_JerseyFinancialServices
source: Jersey Financial Services Commission Registry
cy: Cofrestrfa Comisiwn Gwasanaethau Ariannol Jersey

# PdfGenerator_OrganisationSchemeTitle_LearningProviderRegistry
source: UK Register of Learning Provider (UKPRN number)
cy: Cofrestr Darparwyr Dysgu'r DU (rhif UKPRN)

# PdfGenerator_OrganisationSchemeTitle_MutualsPublicRegister
source: Mutuals Public Register
cy: Cofrestr Gyhoeddus y Cwmnïau Cydfuddiannol

# PdfGenerator_OrganisationSchemeTitle_NHSRegistry
source: NHS Organisation Data Service
cy: Gwasanaeth Data Sefydliadol y GIG

# PdfGenerator_OrganisationSchemeTitle_NorthernIrelandCharityCommission
source: Charity Commission for Northern Ireland
cy: Comisiwn Elusennau Gogledd Iwerddon

# PdfGenerator_OrganisationSchemeTitle_Other
source: Other / None
cy: Arall / Dim

# PdfGenerator_OrganisationSchemeTitle_Ppon
source: Public procurement organisation number (PPON)
cy: Rhif y sefydliad caffael cyhoeddus (PPON)

# PdfGenerator_OrganisationSchemeTitle_Unknown
source: Unknown
cy: Anhysbys

# PdfGenerator_Organisation_ControlConditions
source: Control conditions
cy: Amodau rheoli

# PdfGenerator_Scheme
source: Registry
cy: Cofrestrfa

# PdfGenerator_Supplier_OperationType_SmallOrMediumSized_Short
source: Small or medium-sized enterprise
cy: Busnes bach neu ganolig

# PdfGenerator_Supplier_OperationType_NonGovernmental_Short
source: Non-governmental organisation
cy: Corff anllywodraethol

# PdfGenerator_Supplier_OperationType_SupportedEmploymentProvider_Short
source: Supported employment provider
cy: Darparwr cyflogaeth â chymorth

# PdfGenerator_Supplier_OperationType_PublicService_Short
source: Public service mutual
cy: Cwmni gwasanaeth cyhoeddus cydfuddiannol

# PdfGenerator_UnknownCategory
source: Unknown category
cy: Categori anhysbys

# PdfGenerator_UnknownControlCondition
source: Unknown control condition
cy: Amod rheoli anhysbys

# PdfGenerator_UnknownPersonType
source: Unknown person type
cy: Math o berson anhysbys
