Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/StaticTextResource.*.resx
Languages: cy

# SupplierInformationStatus_StepStatus_NotStarted
source: Not started
cy: Ddim wedi dechrau

# SupplierInformationStatus_StepStatus_Completed
source: Completed
cy: Wedi'i gyflawni

# Supplier_SupplierInformationSummary_Heading
source: Complete your supplier information
cy: Gwybodaeth am y cyflenwr

# Global_BackToOrganisationDetails
source: Back to organisation details
cy: Yn ôl i fanylion y sefydliad

# ConnectedPersons_SectionTitle
source: People connected to your organisation
cy: Unigolion cysylltiedig

# BasicInformation_SectionTitle
source: Your organisation
cy: Gwybodaeth sylfaenol

# OrganisationRegistration_EnterOrganisationName_Heading
source: Enter your organisation's name
cy: Rhowch enw’r sefydliad

# Organisation_EnterOrganisationName_Supplier_Hint
source: As registered on Companies House if incorporated, or the trading name of the company.
cy: Fel y'i cofrestrwyd â Thŷ'r Cwmnïau os yw'n gorfforedig, neu enw masnachu'r cwmni.

# Global_Continue
source: Continue
cy: Parhau

# ApiKeyManagement_CreateApiKey_Title
source: Name your API key
cy: Enwch eich allwedd API

# ApiKeyManagement_ManageApiKey_Action_Cancel
source: Cancel
cy: Canslo

# ApiKeyManagement_ManageApiKey_CreateButton
source: Create an API key
cy: Creu allwedd API

# ApiKeyManagement_ManageApiKey_Description_Editor
source: You can cancel any that are no longer needed.
cy: Gweld eich allweddi API gweithredol ac wedi'u canslo. Gallwch ganslo unrhyw bryd nad oes eu hangen mwyach.

# ApiKeyManagement_ManageApiKey_NoKeysText
source: API keys that you create will be listed here.
cy: Caiff allweddi API y byddwch yn eu creu eu rhestru yma.

# ApiKeyManagement_ManageApiKey_TableHeader_DateCancelled
source: Date cancelled
cy: Y dyddiad canslo

# ApiKeyManagement_ManageApiKey_TableHeader_DateCreated
source: Date created
cy: Y dyddiad creu

# ApiKeyManagement_ManageApiKey_TableHeader_Name
source: Name
cy: Enw

# ApiKeyManagement_ManageApiKey_Title
source: Manage API keys
cy: Rheoli allweddi API

# ApiKeyManagement_NewApiKeyDetails_BackToApiKeys
source: Back to your API keys
cy: Yn ôl i'ch allweddi API

# ApiKeyManagement_NewApiKeyDetails_CopyApiKey
source: Copy the API key and keep it safe.
cy: Copïwch yr allwedd API a'i gadw'n ddiogel.

# ApiKeyManagement_NewApiKeyDetails_Notice
source: This is the only time we show you the API key. If you lose it, you’ll need to cancel it and create a new one.
cy: Dyma'r unig adeg y byddwn yn dangos yr allwedd API i chi. Os byddwch yn ei golli, bydd angen i chi ei ganslo a chreu un newydd.

# ApiKeyManagement_NewApiKeyDetails_Title
source: API key created
cy: Allwedd API wedi'i greu

# ApiKeyManagement_NewApiKeyDetails_YourApiKey
source: Your API key
cy: Eich allwedd API

# ApiKeyManagement_RevokeApiKey_CancelButton
source: Cancel key
cy: Canslo allwedd

# ApiKeyManagement_RevokeApiKey_Description1
source: Cancelling this API key will stop the sharing of information between this service and the eSender that's using it.
cy: Bydd canslo'r allwedd API hwn yn golygu na chaiff gwybodaeth ei rhannu mwyach rhwng y gwasanaeth hwn a'r eAnfonwr sy'n ei ddefnyddio.

# ApiKeyManagement_RevokeApiKey_Description2
source: You cannot re-activate a cancelled API key. You'll need to create a new one to share information again.
cy: Ni allwch ail-actifadu allwedd API sydd wedi'i ganslo. Bydd angen i chi greu un newydd er mwyn rhannu gwybodaeth eto.

# ApiKeyManagement_RevokeApiKey_Title
source: Cancel API key
cy: Canslo allwedd API

# Consortium_ConsortiumOverview_AddAnOrganisation_link
source: Add an organisation
cy: Ychwanegu sefydliad

# Consortium_ConsortiumOverview_Address_list
source: Address
cy: Cyfeiriad

# Consortium_ConsortiumOverview_ChangeAddress
source: Change<span class="govuk-visually-hidden">address</span>
cy: Newid<span class="govuk-visually-hidden">cyfeiriad</span>

# Consortium_ConsortiumOverview_EmailAddress_list
source: Email address
cy: Cyfeiriad e-bost

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusionsHeading
source: Discretionary exclusions
cy: Eithriadau dewisol

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusionsIntro
source: Discretionary exclusions that may exclude you are:
cy: Ymysg yr eithriadau dewisol a all eich eithrio mae:

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusionsLinkText
source: These exclusions are defined in <a class="govuk-link" href="{0}" target="_blank">schedule 7 of the Procurement Act 2023 (opens in new tab)</a>.
cy: Mae'r eithriadau hyn wedi'u diffinio yn <a class="govuk-link" href="{0}" target="_blank">atodlen 7 o Ddeddf Caffael 2023 (bydd yn agor mewn tab newydd)</a>.

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion1
source: acting improperly in procurement
cy: gweithredu'n amhriodol ym maes caffael

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion2
source: breach of contract and poor performance
cy: torri contract a pherfformiad gwael

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion3
source: environmental misconduct
cy: camymddwyn amgylcheddol

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion4
source: infringement of Competition Act 1998, under Chapter II prohibition
cy: achos o dorri Deddf Cystadleuaeth 1998, o dan waharddiad Pennod II

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion5
source: insolvency or bankruptcy
cy: ansolfedd neu fethdalu

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion6
source: labour market misconduct
cy: camymddwyn yn y farchnad lafur

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion7
source: potential competition and competition law infringements
cy: achosion posibl o dorri cystadleuaeth a chyfraith cystadleuaeth

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion8
source: professional misconduct
cy: camymddwyn proffesiynol

# Exclusions_AddExclusionDeclaration_DiscretionaryExclusions_Exclusion9
source: suspension or ceasing to carry on all or a substantial part of a business
cy: atal neu beidio â pharhau â busnes neu ran sylweddol ohono

# Exclusions_AddExclusionDeclaration_InsetText
source: If any exclusions apply to a person with significant control, such as a director or majority shareholder, make sure you have added them as a <a class="govuk-link" href="{0}">connected person</a>.
cy: Os bydd unrhyw eithriadau'n gymwys i unigolyn sydd â rheolaeth sylweddol, fel cyfarwyddwr neu brif gyfranddaliwr, dylech sicrhau eich bod wedi'i ychwanegu fel <a class="govuk-link" href="{0}">unigolyn cysylltiedig</a>.

# Exclusions_AddExclusionDeclaration_MandatoryConvictionsIntro
source: Convictions that may exclude you are:
cy: Ymysg yr euogfarnau a all eich eithrio mae:

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction1
source: ancillary offences - aiding, abetting, encouraging or assisting crime
cy: troseddau ategol helpu, annog neu gynorthwyo trosedd

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction2
source: cartel offences
cy: troseddau cartel

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction3
source: corporate manslaughter or homicide
cy: dynladdiad neu laddiad corfforaethol

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction4
source: labour market, slavery and human trafficking offences
cy: troseddau marchnad lafur, caethwasiaeth a masnachu pobl

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction5
source: organised crime
cy: troseddau cyfundrefnol

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction6
source: tax offences
cy: troseddau treth

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction7
source: terrorism and offences having a terrorist connection
cy: terfysgaeth a throseddau â chysylltiad terfysgol

# Exclusions_AddExclusionDeclaration_MandatoryConvictions_Conviction8
source: theft, fraud and bribery
cy: lladrad, twyll a llwgrwobrwyaeth

# Exclusions_AddExclusionDeclaration_MandatoryExclusionsHeading
source: Mandatory exclusions
cy: Eithriadau gorfodol

# Exclusions_AddExclusionDeclaration_MandatoryExclusionsIntro
source: Penalties and other events that may exclude you are:
cy: Ymysg y cosbau a digwyddiadau eraill a all eich eithrio mae:

# Exclusions_AddExclusionDeclaration_MandatoryExclusionsLinkText
source: These exclusions are defined in <a class="govuk-link" href="{0}" target="_blank">schedule 6 of the Procurement Act 2023 (opens in new tab)</a>.
cy: Mae'r eithriadau hyn wedi'u diffinio yn <a class="govuk-link" href="{0}" target="_blank">atodlen 6 o Ddeddf Caffael 2023 (bydd yn agor mewn tab newydd)</a>.

# Exclusions_AddExclusionDeclaration_MandatoryExclusions_Penalty1
source: adjustments for tax arrangements that are abusive
cy: addasiadau ar gyfer trefniadau treth sy'n gamdriniol

# Exclusions_AddExclusionDeclaration_MandatoryExclusions_Penalty2
source: competition law infringements
cy: achosion o dorri cyfraith cystadleuaeth

# Exclusions_AddExclusionDeclaration_MandatoryExclusions_Penalty3
source: defeat in respect of notifiable tax arrangements
cy: methiant mewn perthynas â threfniadau treth hysbysadwy

# Exclusions_AddExclusionDeclaration_MandatoryExclusions_Penalty4
source: failure to cooperate with an investigation
cy: methiant i gydymffurfio ag ymchwiliad

# Exclusions_AddExclusionDeclaration_MandatoryExclusions_Penalty5
source: finding by HMRC, in exercise of its powers in respect of VAT, of abusive practice
cy: CThEF yn canfod ymarfer camdriniol wrth arfer ei bwerau mewn perthynas â TAW

# Exclusions_AddExclusionDeclaration_MandatoryExclusions_Penalty6
source: penalties for transactions connected with VAT fraud and evasion of tax or duty
cy: cosbau ar gyfer trafodion sy'n gysylltiedig â thwyll TAW ac osgoi talu treth neu doll

# Exclusions_AddExclusionDeclaration_MandatoryExclusions_Penalty7
source: penalties payable for errors in tax documentation and failure to notify, and certain VAT and excise wrongdoing
cy: cosbau sy'n daladwy am wallau mewn dogfennaeth treth a methiant i hysbysu, a chamymddwyn penodol mewn perthynas â TAW a thollau

# Exclusions_AddExclusionDeclaration_Paragraph1
source: You must tell us if there are any circumstances that may exclude you as a supplier from the procurement process because your organisation or a connected person committed an offence.
cy: Mae'n rhaid i chi ddweud wrthym os oes unrhyw amgylchiadau a all eich eithrio fel cyflenwr o'r broses gaffael am fod eich sefydliad neu unigolyn cysylltiedig wedi cyflawni trosedd.

# Exclusions_AddExclusionDeclaration_Paragraph2
source: Offences are listed as 'mandatory exclusion grounds' and 'discretionary exclusion grounds' in the Procurement Act 2023.
cy: Caiff troseddau eu rhestru fel ‘seiliau gorfodol dros eithrio’ a ‘seiliau dewisol dros eithrio’ yn Neddf Caffael 2023.

# Exclusions_AddExclusionDeclaration_Paragraph3
source: You'll need to provide details about each exclusion, such as where it happened and who it applies to and upload any supporting documents you may have.
cy: Bydd angen i chi roi manylion pob eithriad, fel ble a ddigwyddodd a phwy y mae'n gymwys iddo a lanlwytho unrhyw ddogfennau ategol y gallai fod gennych.

# Exclusions_AddExclusionDeclaration_Title
source: Add any mandatory and discretionary exclusions
cy: Ychwanegu unrhyw eithriadau gorfodol a dewisol

# Footer_AccessibilityStatement
source: Accessibility statement
cy: Datganiad hygyrchedd

# Footer_ContactUs
source: Contact us
cy: Cysylltu â ni

# Footer_Cookies
source: Cookies
cy: Cwcis

# Footer_DataAndAPI
source: Data and API
cy: Data ac API

# Footer_PrivacyNotice
source: Privacy
cy: Preifatrwydd

# Footer_TermsAndConditions
source: Terms and conditions
cy: Telerau ac amodau

# Forms_CheckYourAnswers_Title
source: Check your answers
cy: Gwiriwch eich atebion

# Forms_FormElementAddress_AddressLine1_Label
source: Address line 1
cy: Llinell gyntaf y cyfeiriad

# Forms_FormElementAddress_AddressLine1_RequiredError
source: Enter address line 1
cy: Rhowch llinell gyntaf y cyfeiriad

# Forms_FormElementAddress_Country_Label
source: Country
cy: Gwlad

# Forms_FormElementAddress_Country_RequiredError
source: Enter country
cy: Rhowch gwlad

# Forms_FormElementAddress_EnterNonUKAddress
source: Enter a non-UK address
cy: Rhowch gyfeiriad y tu allan i'r DU

# Forms_FormElementAddress_PostalOrZipCode_Label
source: Postal or ZIP Code
cy: Cod post neu ZIP

# Forms_FormElementAddress_PostalOrZipCode_RequiredError
source: Enter postal or ZIP Code
cy: Rhowch cod post neu ZIP

# Forms_FormElementAddress_Postcode_Label
source: Postcode
cy: Cod post

# Forms_FormElementAddress_Postcode_RequiredError
source: Enter postcode
cy: Rhowch cod post

# Forms_FormElementAddress_TownOrCity_Label
source: Town or city
cy: Tref neu ddinas

# Forms_FormElementAddress_TownOrCity_RequiredError
source: Enter town or city
cy: Rhowch tref neu ddinas

# Global_Admin
source: Admin
cy: Gweinyddwr

# Global_Change
source: Change
cy: Newid

# Global_Day
source: Day
cy: Diwrnod

# Global_Editor
source: Editor
cy: Golygydd

# Global_EmailAddress
source: Email address
cy: Cyfeiriad e-bost

# Global_Failure_Heading
source: Failure
cy: Cyfeiriad e-bost

# Global_Month
source: Month
cy: Mis

# Global_Or
source: or
cy: neu

# Global_Other
source: Other
cy: Arall

# Global_Reject
source: Reject
cy: Gwrthod

# Global_Remove
source: Remove
cy: Tynnu

# Global_Save
source: Save
cy: Cadw

# Global_Viewer
source: Viewer
cy: Gwyliwr

# Global_Year
source: Year
cy: Blwyddyn

# Header_Menu
source: Menu
cy: Ddewislen

# Header_MyNotices
source: My notices
cy: Fy hysbysiadau

# Header_Search
source: Search
cy: Chwilio

# Header_ServiceName
source: Find a Tender
cy: Canfod Tendr

# Header_SkipToMainContent_Link
source: Skip to main content
cy: Neidio i'r prif gynnwys

# Header_SignIn
source: Sign in
cy: Mewngofnodi

# Header_SignOut
source: Sign out
cy: Allgofnodi

# Header_Contact
source: <a class="govuk-link" target="_blank" href="/provide-feedback-and-contact/?context=feedback">Contact the Find a Tender team (opens in new tab)</a> if you have feedback, questions or suggestions.
cy: <a class="govuk-link" target="_blank" href="/provide-feedback-and-contact/?context=feedback">Cysylltwch â'r tîm Canfod Tendr (agor mewn tab newydd)</a> os oes gennych adborth, cwestiynau neu awgrymiadau.

# OrganisationRegistration_Address_Buyer_Heading
source: Enter your organisation's address
cy: Rhowch gyfeiriad eich sefydliad

# OrganisationRegistration_Address_Supplier_Heading
source: Enter your organisation's registered address
cy: Rhowch gyfeiriad cofrestredig eich sefydliad

# OrganisationRegistration_Address_Supplier_Hint
source: The address registered with Companies House, or the principal address the business conducts its activities. For example, a head office.
cy: Y cyfeiriad a gofrestrwyd â Thŷ'r Cwmnïau, neu'r prif gyfeiriad lle yr ymgymerir â gweithgareddau'r busnes. Er enghraifft, pencadlys.

# OrganisationRegistration_BuyerOrganisationType_Other_Label
source: Other - only applies to non-contracting authorities establishing a dynamic market
cy: Arall

# OrganisationRegistration_BuyerOrganisationType_PrivateUtility_Label
source: Private utility
cy: Cyfleustod preifat

# OrganisationRegistration_BuyerOrganisationType_PublicUndertaking_Label
source: Public undertaking
cy: Ymgymeriad cyhoeddus

# OrganisationRegistration_BuyerSelectDevolvedRegulation_NI_Label
source: Northern Ireland
cy: Gogledd Iwerddon

# OrganisationRegistration_BuyerSelectDevolvedRegulation_Scotland_Label
source: Scotland
cy: Yr Alban

# OrganisationRegistration_BuyerSelectDevolvedRegulation_ValidationErrorMessage
source: Select a devolved region
cy: Dewiswch ranbarth datganoledig

# OrganisationRegistration_BuyerSelectDevolvedRegulation_Wales_Label
source: Wales
cy: Cymru

# OrganisationRegistration_CompanyHouseNumberQuestion_ErrorMessage
source: Enter a company number
cy: Rhowch Rif Cwmni

# OrganisationRegistration_CompanyHouseNumberQuestion_Heading
source: Does your organisation have a Companies House number?
cy: A oes gan eich sefydliad rif Tŷ'r Cwmnïau?

# OrganisationRegistration_CompanyHouseNumberQuestion_Label
source: Enter your company number
cy: Rhowch eich Rhif Cwmni

# OrganisationRegistration_InternationalIdentifier_None_Back
source: Back to organisation details
cy: Yn ôl i fanylion y sefydliad

# OrganisationRegistration_InternationalIdentifier_RegistrationNumber_Heading
source: Registration number
cy: Rhif cofrestru

# OrganisationRegistration_InternationalIdentifier_Type_Heading
source: Organisation type
cy: Math o sefydliad

# OrganisationRegistration_JoinOrganisation_OrganisationDetails_Heading
source: Organisation details
cy: Manylion y sefydliad

# OrganisationRegistration_OrganisationAlreadyRegistered_Heading
source: This organisation has already registered
cy: Mae'r sefydliad hwn eisoes wedi'i gofrestru

# OrganisationRegistration_OrganisationAlreadyRegistered_Message
source: <p class="govuk-body">The organisation's details are already registered with the service.</p> <p class="govuk-body">If you know the person who registered the organisation, they can invite you to join. Or you can request to join below.</p> <a class="govuk-button" href="/registration/{0}/join-organisation">Request to Join</a>
cy: <p class="govuk-body">Mae manylion y sefydliad eisoes wedi'u cofrestru â'r gwasanaeth.</p> <p class="govuk-body">Os ydych yn adnabod y person a gofrestrodd y sefydliad, gall eich gwahodd i ymuno. Neu gallwch wneud cais i ymuno isod.</p> <a class="govuk-button" href="/registration/{0}/join-organisation">Gwneud cais i ymuno</a>

# OrganisationRegistration_OrganisationType_Buyer
source: Buyer
cy: Prynwr

# OrganisationRegistration_OrganisationType_BuyerOrSupplierValidation
source: Select buyer or supplier
cy: Dewiswch brynwr neu cyflenwr

# OrganisationRegistration_OrganisationType_Buyer_Hint
source: A contracting authority who publishes notices to buy goods, works, services or utilities
cy: Awdurdod contractio sy'n cyhoeddi hysbysiadau i brynu neu gyflenwi nwyddau, gwaith, gwasanaethau neu gyfleustodau

# OrganisationRegistration_OrganisationType_Heading
source: What do you want to register your organisation as?
cy: Fel beth yr hoffech gofrestru eich sefydliad?

# OrganisationRegistration_OrganisationType_Supplier
source: Supplier
cy: Cyflenwr

# OrganisationRegistration_OrganisationType_Supplier_Hint
source: An organisation or sole trader who searches for tenders and submits bids to supply goods, works, services or utilities
cy: Sefydliad neu unig fasnachwr sy'n chwilio am dendrau ac yn cyflwyno cynigion i gyflenwi nwyddau, gwaith, gwasanaethau neu gyfleustodau

# OrganisationSchemeType_CompaniesHouse
source: Companies House number
cy: Rhif Tŷ'r Cwmnïau

# OrganisationSchemeType_Other
source: Other
cy: Arall

# OrganisationSchemeType_ScottishCharityRegulator
source: Scottish Charity Register
cy: Cofrestr Elusennau'r Alban

# OrganisationSchemeType_VAT
source: VAT number
cy: Rhif TAW

# Organisation_AddMoreOrganisations
source: add more organisations
cy: ychwanegu mwy o sefydliadau

# Organisation_Address
source: address
cy: cyfeiriad

# Organisation_BuyerType
source: Organisation type
cy: Math o sefydliad

# Organisation_ChangeAddress
source: Change<span class="govuk-visually-hidden"> address</span>
cy: Newid<span class="govuk-visually-hidden"> cyfeiriad</span>

# Organisation_ChangeEmail
source: Change<span class="govuk-visually-hidden"> the organisation email</span>
cy: Newid<span class="govuk-visually-hidden"> e-bost y sefydliad</span>

# Organisation_ChangeName
source: Change<span class="govuk-visually-hidden"> the organisation name</span>
cy: Newid<span class="govuk-visually-hidden"> enw'r sefydliad</span>

# Organisation_ContractingAuthority
source: a contracting authority who publishes notices to buy goods, works, services or utilities
cy: awdurdod contractio sy'n cyhoeddi hysbysiadau i brynu neu gyflenwi nwyddau, gwaith, gwasanaethau neu gyfleustodau

# Organisation_DevolvedRegions
source: Devolved regions
cy: Rhanbarthau datganoledig

# Organisation_DevolvedRegulations
source: Devolved regulations
cy: Rheoliadau datganoledig

# Organisation_EmailAddress
source: Email address:
cy: Cyfeiriad e-bost:

# Organisation_Email_Heading
source: Enter your organisation's email address
cy: Rhowch gyfeiriad e-bost eich sefydliad

# Organisation_Email_Required_ErrorMessage
source: Enter your organisation's email address
cy: Rhowch gyfeiriad e-bost eich sefydliad

# Organisation_EnterOrganisationEmail_Hint
source: Where possible, use a shared inbox that other team members can access
cy: Lle y bo'n bosibl, defnyddiwch fewnflwch a rennir y gall aelodau eraill y tîm gael mynediad iddo

# Organisation_EnterOrganisationName_ErrorMessage
source: Enter your organisation's name
cy: Rhowch enw eich sefydliad

# Organisation_EnterOrganisationName_Heading
source: Enter your organisation's name
cy: Rhowch enw eich sefydliad

# Organisation_ManageApiKeys
source: Manage API keys
cy: Rheoli allweddi API

# Organisation_OrganisationAddress
source: Organisation address
cy: Cyfeiriad y sefydliad

# Organisation_OrganisationDetails
source: Organisation details
cy: Manylion y sefydliad

# Organisation_OrganisationEmail
source: Organisation email
cy: E-bost y sefydliad

# Organisation_OrganisationIdentification_CH_Label
source: Companies House
cy: Rhif Tŷ'r Cwmnïau

# Organisation_OrganisationIdentification_Charity_Number_Label
source: Charity number
cy: Rhif elusen

# Organisation_OrganisationIdentification_Company_Number_Label
source: Company number
cy: Rhif y Cwmni

# Organisation_OrganisationIdentification_GB_CHC_Label
source: Charity Commission (England and Wales)
cy: Comisiwn Elusennau (Cymru a Lloegr)

# Organisation_OrganisationIdentification_GB_MPR_Label
source: Mutuals Public Register
cy: Cofrestr Gyhoeddus y Cwmnïau Cydfuddiannol

# Organisation_OrganisationIdentification_GB_NHS_Label
source: NHS Organisation Data Service
cy: Gwasanaeth Data Sefydliadol y GIG

# Organisation_OrganisationIdentification_GB_NIC_Label
source: Charity Commission for Northern Ireland
cy: Comisiwn Elusennau Gogledd Iwerddon

# Organisation_OrganisationIdentification_GB_SC_Label
source: Scottish Charity Register
cy: Cofrestr Elusennau'r Alban

# Organisation_OrganisationIdentification_GB_UKPRN_Label
source: UK Register of Learning Providers (UKPRN number)
cy: Cofrestr Darparwyr Dysgu'r DU (rhif UKPRN)

# Organisation_OrganisationIdentification_GG_RCE_Hint
source: Include prefix, if applicable. For example, GY.
cy: Rhowch y rhagddodiad, os yw'n gymwys. Er enghraifft, GY.

# Organisation_OrganisationIdentification_GG_RCE_Label
source: Guernsey Registry
cy: Cofrestrfa Guernsey

# Organisation_OrganisationIdentification_IM_CR_Label
source: Isle of Man Companies Registry
cy: Cofrestrfa Gwmnïau Ynys Manaw

# Organisation_OrganisationIdentification_JE_FSC_Label
source: Jersey Financial Services Commission Registry
cy: Cofrestrfa Comisiwn Gwasanaethau Ariannol Jersey

# Organisation_OrganisationIdentification_NonUk_Link
source: Enter a non-UK registry and number
cy: Rhowch gofrestrfa a rhif y tu allan i'r DU

# Organisation_OrganisationIdentification_ODS_Code_Label
source: ODS code
cy: Cod yr ODS

# Organisation_OrganisationIdentification_Other_Label
source: None apply
cy: Dim un yn gymwys

# Organisation_OrganisationIdentification_Registration_Number_Label
source: Registration number
cy: Rhif cofrestru

# Organisation_OrganisationIdentification_ValidationErrorMessage
source: Select your organisation type
cy: Dewiswch eich math o sefydliad

# Organisation_OrganisationIdentifier
source: Organisation identifier
cy: Dynodyddion y sefydliad

# Organisation_OrganisationName
source: Organisation name
cy: Enw'r sefydliad
