Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/StaticTextResource.*.resx
Languages: cy

# Organisation_OrganisationOrSoleTrader
source: an organisation or sole trader who searches for tenders and submits bids to supply goods, works, services or utilities
cy: sefydliad neu unig fasnachwr sy'n chwilio am dendrau ac yn cyflwyno cynigion i gyflenwi nwyddau, gwaith, gwasanaethau neu gyfleustodau

# Organisation_PendingApproval
source: Pending approval
cy: yn aros am gymeradwyaeth

# PdfGenerator_BasicInformation_EmailAddress
source: Email address
cy: Cyfeiriad e-bost

# PdfGenerator_BasicInformation_LegalForm
source: Legal form
cy: Ffurf gyfreithiol

# PdfGenerator_BasicInformation_OrganisationName
source: Organisation name
cy: Enw'r sefydliad

# PdfGenerator_BasicInformation_OrganisationType
source: Organisation type
cy: Math o sefydliad

# PdfGenerator_BasicInformation_PostalAddress
source: Postal address
cy: Cyfeiriad post

# PdfGenerator_BasicInformation_RegisteredAddress
source: Registered address
cy: Cyfeiriad cofrestredig

# PdfGenerator_BasicInformation_RegisteredLegalForm
source: Registered legal form
cy: Cofrestredig ffurf gyfreithiol

# PdfGenerator_BasicInformation_Suppliertype
source: Supplier type
cy: Math o gyflenwr

# PdfGenerator_BasicInformation_Title
source: Your organisation
cy: Gwybodaeth sylfaenol

# PdfGenerator_BasicInformation_VATNumber
source: VAT number
cy: Rhif TAW

# PdfGenerator_BasicInformation_WebsiteAddress
source: Website address
cy: Cyfeiriad gwefan

source: Director or individual with same responsibilities
cy: Cyfarwyddwr neu unigolyn â'r un cyfrifoldebau

source: Other individual with significant influence or control
cy: Unrhyw unigolyn arall â dylanwad neu reolaeth sylweddol

source: Person with significant control
cy: Person â rheolaeth sylweddol

# PdfGenerator_ConnectedEntityType_Individual
source: Individual
cy: Unigolyn

# PdfGenerator_ConnectedEntityType_Organisation
source: Organisation
cy: Sefydliad

# PdfGenerator_ConnectedEntityType_TrustTrustee
source: Trustee of a trust
cy: Ymddiriedolwr neu ymddiriedolaeth

# PdfGenerator_ConnectedOrganisationCategory_DirectorSameResponsibilities
source: Director or individual with the same responsibilities
cy: Dyfarwyddwr neu unigolyn â'r un cyfrifoldebau

# PdfGenerator_ConnectedOrganisationCategory_OtherOrganisationWithInfluence
source: Any other organisation with significant influence or control
cy: Unrhyw unigolyn arall â dylanwad neu reolaeth sylweddol

# PdfGenerator_ConnectedOrganisationCategory_ParentSubsidiaryCompany
source: Parent or subsidiary company
cy: Rhiant gwmni neu is-gwmni

# PdfGenerator_ConnectedOrganisationCategory_RegisteredCompany
source: Registered company
cy: Cwmni cofrestredig

# PdfGenerator_ConnectedOrganisationCategory_TakenOverCompany
source: A company your organisation has taken over
cy: Cwmni y mae eich sefydliad wedi'i drosfeddiannu

# PdfGenerator_ConnectedPersonType_Individual
source: Individual
cy: Unigolyn

# PdfGenerator_ConnectedPersonType_TrustTrustee
source: Trustee of a trust
cy: Ymddiriedolwr neu ymddiriedolaeth

# PdfGenerator_ConnectedPerson_Category
source: Category
cy: Categori

# PdfGenerator_ConnectedPerson_CompanyHouseNumber
source: Companies House number
cy: Rhif Tŷ'r Cwmnïau

# PdfGenerator_ConnectedPerson_Country
source: Country
cy: Gwlad

# PdfGenerator_ConnectedPerson_DateOfBirth
source: Date of birth
cy: Dyddiad geni

# PdfGenerator_ConnectedPerson_FirstName
source: First name
cy: Enw cyntaf

# PdfGenerator_ConnectedPerson_LastName
source: Last name
cy: Cyfenw

# PdfGenerator_ConnectedPerson_Nationality
source: Nationality
cy: Cenedligrwydd

# PdfGenerator_ConnectedPerson_OrganisationCategory
source: Category
cy: Categori

# PdfGenerator_ConnectedPerson_OrganisationEntityType
source: Type
cy: Math

# PdfGenerator_ConnectedPerson_OrganisationName
source: Organisation name
cy: Enw'r sefydliad

# PdfGenerator_ConnectedPerson_PostalAddress
source: Postal address
cy: Cyfeiriad post

# PdfGenerator_ConnectedPerson_Postcode
source: Postcode
cy: Cod post

# PdfGenerator_ConnectedPerson_RegisteredAddress
source: Registered address
cy: Cyfeiriad cofrestredig

# PdfGenerator_ConnectedPerson_Type
source: Type
cy: Math

# PdfGenerator_ControlCondition_CanAppointRemoveDirectors
source: Can appoint or remove directors
cy: Gall benodi neu gael gwared ar gyfarwyddwyr

# PdfGenerator_ControlCondition_HasOtherInfluence
source: Has other significant influence or control
cy: Mae ganddo ddylanwad neu reolaeth sylweddol

# PdfGenerator_ControlCondition_HasVotingRights
source: Has voting rights
cy: Mae ganddo hawliau pleidleisio

# PdfGenerator_ControlCondition_None
source: None
cy: Dim

# PdfGenerator_ControlCondition_OwnsShares
source: Owns shares
cy: Mae'n berchen ar gyfranddaliadau

# PdfGenerator_OrganisationSchemeTitle_CompaniesHouseNumber
source: Companies House number
cy: Rhif Tŷ'r Cwmnïau

# PdfGenerator_OrganisationSchemeTitle_ScottishCharityRegulator
source: Scottish Charity Register
cy: Cofrestr Elusennau'r Alban

# PdfGenerator_OrganisationSchemeTitle_VAT
source: VAT number
cy: Rhif TAW

# PdfGenerator_SupplierInformation_Title
source: Supplier information
cy: Gwybodaeth am y cyflenwr

# ProvideFeedbackAndContact_ContactFindATender
source: Contact Find a Tender
cy: Gysylltu Canfod Tendr

# ProvideFeedbackAndContact_EnterDetails
source: Enter details
cy: Rhowch fanylion

# ProvideFeedbackAndContact_Name
source: Name
cy: Enw

# ShareYourInformation_BackOrganisationDetails
source: Back to organisation details
cy: Yn ôl i fanylion y sefydliad

# ShareYourInformation_TableHeaderFiles
source: Files
cy: Ffeiliau

# Shared_Address_AddressLine1
source: Address line 1
cy: Llinell gyntaf y cyfeiriad

# Shared_Address_Country
source: Country
cy: Gwlad

# Shared_Address_Country_ErrorMessage
source: Enter country
cy: Rhowch gwlad

# Shared_Address_NonUk_Link
source: Enter a non-UK address
cy: Rhowch gyfeiriad y tu allan i'r DU

# Shared_Address_Postcode
source: Postcode
cy: Cod post

# Shared_Address_Postcode_ErrorMessage
source: Enter postcode
cy: Rhowch cod post

# Shared_Address_Postcode_NonUk
source: Postal or ZIP Code
cy: Cod post neu ZIP

# Shared_Address_Postcode_NonUk_ErrorMessage
source: Enter postal or ZIP Code
cy: Rhowch cod post neu ZIP

# Shared_Address_TownOrCity
source: Town or city
cy: Tref neu ddinas

# Shared_Address_TownOrCity_ErrorMessage
source: Enter town or city
cy: Rhowch tref neu ddinas

# Supplementary_ContactUs_ContactUs
source: Contact us
cy: Cysylltu â ni

# Supplementary_ContactUs_Email
source: Email
cy: E-bost

# Supplementary_ContactUs_Email_ErrorMessage
source: Enter your email
cy: Rhowch eich e-bost

# Supplementary_ContactUs_Message
source: Message
cy: Neges

# Supplementary_ContactUs_Name
source: Name
cy: Enw

# Supplementary_ContactUs_Organisation
source: Organisation
cy: Sefydliad

# Supplementary_ContactUs_Organisation_ErrorMessage
source: Enter your organisation
cy: Rhowch eich sefydliad

# Supplementary_ContactUs_Title
source: Message sent
cy: Anfonwyd y neges

# Supplementary_ContactUs_WhatHappensNext
source: What happens next
cy: Beth fydd yn digwydd nesaf?

# Supplementary_CookieDetails_BannerInfo
source: You may see banners when you visit Find a Tender inviting you to select your cookie preferences. We’ll set cookies so that your computer knows you’ve seen such messages and not to show them again, and also to store your settings.
cy: Mae’n bosibl y byddwch yn gweld baneri wrth ddefnyddio Canfod Tendr yn gofyn i chi ddewis eich dewisiadau cwcis. Byddwn yn gosod cwcis fel bod eich cyfrifiadur yn gwybod eich bod wedi gweld negeseuon o'r fath ac nad oes angen eu dangos eto, ac er mwyn storio eich gosodiadau.

# Supplementary_CookieDetails_ListItem1
source: how you got to the site
cy: sut y gwnaethoch gyrraedd y wefan

# Supplementary_CookieDetails_ListItem3
source: what you click on while you’re visiting the site
cy: yr hyn y byddwch yn clicio arno tra byddwch ar y wefan

# Supplementary_CookieDetails_NoGoogleShare
source: We do not allow Google to use or share the data about how you use this site.
cy: Nid ydym yn caniatáu i Google ddefnyddio na rhannu'r data am y ffordd rydych yn defnyddio'r wefan hon.

# Supplementary_CookieDetails_StrictlyNecessary
source: Strictly necessary cookies
cy: Cwcis cwbl angenrheidiol

# Supplementary_CookieDetails_TableHeader_Name
source: Name
cy: Enw

# SupplierToBuyer_DevolvedRegulation_Title
source: Do devolved regulations apply to your organisation?
cy: A yw rheoliadau datganoledig yn gymwys i'ch sefydliad?

# SupplierToBuyer_OrganisationSummary_ChangeDevolvedRegions
source: Change<span class="govuk-visually-hidden"> devolved regions</span>
cy: Newid <span class="govuk-visually-hidden"> y rhanbarthau datganoledig

# SupplierToBuyer_OrganisationSummary_ChangeDevolvedRegulations
source: Change<span class="govuk-visually-hidden"> devolved regulations</span>
cy: Newid <span class="govuk-visually-hidden"> y rheoliadau datganoledig

# SupplierToBuyer_OrganisationSummary_ChangeOrganisationType
source: Change<span class="govuk-visually-hidden"> organisation type</span>
cy: Newid <span class="govuk-visually-hidden"> y math o sefydliad</span>

# SupplierToBuyer_OrganisationSummary_DevolvedRegions
source: Devolved regions
cy: Rhanbarthau datganoledig

# SupplierToBuyer_OrganisationSummary_DevolvedRegulations
source: Devolved regulations
cy: Rheoliadau datganoledig

# SupplierToBuyer_OrganisationSummary_OrganisationType
source: Organisation type
cy: Math o sefydliad

# SupplierToBuyer_OrganisationSummary_Title
source: Check your answers
cy: Gwiriwch eich atebion

# SupplierToBuyer_OrganisationType_BlueLightOrganisations
source: blue light organisations - ambulance, police, and other emergency services
cy: sefydliadau golau glas – gwasanaethau ambiwlans, yr heddlu a gwasanaethau brys eraill

# SupplierToBuyer_OrganisationType_Charities
source: charities
cy: elusennau

# SupplierToBuyer_OrganisationType_ConditionalHint
source: For example, the establishment of a utilities dynamic market by a non-contracting authority.
cy: Er enghraifft, awdurdod nad yw'n contractio yn sefydlu marchnad ddynamig ar gyfer cyfleustodau.

# SupplierToBuyer_OrganisationType_CountyDistrictBoroughParishCouncils
source: county, district, borough and parish councils
cy: cynghorau sir, dosbarth, bwrdeistref a phlwyf

# SupplierToBuyer_OrganisationType_EnterType
source: Enter type
cy: Rhowch y math

# SupplierToBuyer_OrganisationType_ErrorMessage
source: Select the organisation type
cy: Dewiswch y math o sefydliad

# SupplierToBuyer_OrganisationType_ExecutiveAgencies
source: executive agencies (EA)
cy: asiantaethau gweithredol

# SupplierToBuyer_OrganisationType_GreaterLondonAuthority
source: the Greater London Authority
cy: Awdurdod Llundain Fwyaf

# SupplierToBuyer_OrganisationType_HousingAssociations
source: housing associations
cy: cymdeithasau tai

# SupplierToBuyer_OrganisationType_NonDepartmentalPublicBodies
source: non-departmental public bodies (NDPB)
cy: cyrff cyhoeddus anadrannol

# SupplierToBuyer_OrganisationType_NonMinisterialDepartments
source: non-ministerial departments (NMD)
cy: adrannau anweinidogol

# SupplierToBuyer_OrganisationType_Other
source: Other
cy: Arall

# SupplierToBuyer_OrganisationType_PrivateUtility
source: Private utility
cy: Cyfleustod preifat

# SupplierToBuyer_OrganisationType_PublicUndertaking
source: Public undertaking
cy: Ymgymeriad cyhoeddus

# SupplierToBuyer_OrganisationType_TradingFunds
source: trading funds
cy: cronfeydd masnachu

# SupplierToBuyer_OrganisationType_UnitaryAuthorities
source: unitary authorities
cy: awdurdodau unedol

# SupplierToBuyer_SelectDevolvedRegulation_ErrorMessage
source: Select a devolved region
cy: Dewiswch ranbarth datganoledig

# SupplierToBuyer_SelectDevolvedRegulation_NorthernIreland
source: Northern Ireland
cy: Gogledd Iwerddon

# SupplierToBuyer_SelectDevolvedRegulation_Scotland
source: Scotland
cy: Yr Alban

# SupplierToBuyer_SelectDevolvedRegulation_Title
source: Select which devolved nation regulations apply
cy: Pa reoliadau datganoledig sy'n gymwys?

# SupplierToBuyer_SelectDevolvedRegulation_Wales
source: Wales
cy: Cymru

# Supplier_Add
source: Add
cy: Ychwanegu

# Supplier_AddressPostalSameAsRegisteredQuestion_Hint
source: The place where an organisation receives official post can be different from its registered address. For example, a branch office.
cy: Gall y lle y bydd sefydliad yn derbyn post swyddogol fod yn wahanol i'w gyfeiriad cofrestredig. Er enghraifft, swyddfa cangen.

# Supplier_AddressPostalSameAsRegisteredQuestion_Title
source: Does your organisation have a different postal address?
cy: A oes gan eich sefydliad gyfeiriad post gwahanol?

# Supplier_Address_EnterOrganisationPostalAddress
source: Enter your organisation's postal address
cy: Rhowch gyfeiriad post eich sefydliad

# Supplier_Address_EnterRegisteredAddress
source: Enter your organisation's registered address
cy: Rhowch gyfeiriad cofrestredig eich sefydliad

# Supplier_ConnectedEntity_Address_EnterRegisteredAddress_Hint
source: The address registered with Companies House, or the principal address the business conducts its activities. For example, a head office.
cy: Y cyfeiriad a gofrestrwyd â Thŷ'r Cwmnïau, neu'r prif gyfeiriad lle yr ymgymerir â gweithgareddau'r busnes. Er enghraifft, pencadlys.

source: Conditions of control
cy: Amodau rheolaeth

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_EnforcedBy
source: Enforced by
cy: Gorfodir gan

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_LegalForm
source: Legal form
cy: Ffurf gyfreithiol

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_LegalFormAndLaw
source: Legal form and law
cy: Ffurf gyfreithiol a'r gyfraith

source: Registered with overseas equivalent
cy: Cofrestredig â chorff tramor cyfatebol

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_PageTitle
source: Check your answers
cy: Gwiriwch eich atebion

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_PostalAddress
source: Postal address
cy: Cyfeiriad post

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_RegisterName
source: Register name
cy: Enw'r gofrestr

source: Registered address
cy: Cyfeiriad cofrestredig

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_RegisteredDate
source: Registered date
cy: Dyddiad cofrestru

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ControlConditions
source: Conditions of control
cy: Amodau rheolaeth

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_PageTitle
source: Check your answers
cy: Gwiriwch eich atebion

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_PostalAddress
source: Postal address
cy: Cyfeiriad post

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_RegisterName
source: Register name
cy: Enw'r gofrestr

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_RegisteredAddress
source: Registered address
cy: Cyfeiriad cofrestredig

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_RegisteredAsPSC
source: Registered as PSC
cy: Cofrestredig fel person â rheolaeth sylweddol

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_Heading
source: When did {0} become insolvent?
cy: Pryd yr aeth {0} yn ansolfent?

# Supplier_ConnectedEntity_ConnectedEntityCompanyInsolvencyDate_Hint
source: The date it stopped trading under its own name.<br><br>For example, 27 03 2007
cy: Y dyddiad y rhoddodd y gorau i fasnachu o dan ei enw ei hun.<br><br>Er enghraifft, 27/03/2007

# Supplier_ConnectedEntity_ConnectedEntityCompanyQuestion_CompanyHouseNumberLabel
source: Companies House number
cy: Rhif Tŷ'r Cwmnïau

# Supplier_ConnectedEntity_ConnectedEntityCompanyQuestion_Heading
source: Is {0} registered with Companies House?
cy: A yw {0} wedi'i gofrestru â Thŷ'r Cwmnïau?

# Supplier_ConnectedEntity_ConnectedEntityCompanyQuestion_Hint
source: Is the ‘connected person’ registered with Companies House as required by the Companies Act 2006.
cy: A yw'r ‘person cofrestredig’ wedi'i gofrestru â Thŷ'r Cwmnïau fel sy'n ofynnol gan Ddeddf Cwmnïau 2006?

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegisterName_CompaniesHouseOption
source: People with significant control registered on Companies House
cy: Mae pobl â rheolaeth sylweddol yn cofrestru yn Nhŷ'r Cwmnïau

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegisterName_Heading
source: Select where {0} is registered as person with significant control
cy: Dewiswch ble y mae {0} wedi cofrestru fel person â rheolaeth sylweddol

source: Register name
cy: Enw'r gofrestr

source: Enter register name
cy: Rhowch enw'r gofrestr

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegistrationDate_Heading
source: What date was {0} registered as a ‘connected person’?
cy: Pa ddyddiad y cafodd {0} ei gofrestru fel ‘person cofrestredig’?

# Supplier_ConnectedEntity_ConnectedEntityCompanyRegistrationDate_Hint
source: For example, the date a person with significant control was registered with Companies House.<br><br>For example, 27 03 2007
cy: Er enghraifft, y dyddiad y cofrestrodd person â rheolaeth sylweddol â Thŷ'r Cwmnïau.<br><br>Er enghraifft, 27/03/2007

source: Directly or indirectly holds the right to appoint or remove a majority of the company's board of directors
cy: Mae ganddo'r hawl uniongyrchol neu anuniongyrchol i benodi neu gael gwared ar fwyafrif o fwrdd cyfarwyddwyr y cwmni

source: Can appoint or remove directors
cy: Gall benodi neu gael gwared ar gyfarwyddwyr

source: Has the right to exercise, or exercises, significant influence or control over the company. As defined in the <a class="govuk-link" href="https://www.gov.uk/government/publications/guidance-to-the-people-with-significant-control-requirements-for-companies-and-limited-liability-partnerships" target="_blank">person of significant control (PSC) guidance</a>.
cy: Mae ganddo'r hawl i arfer, neu mae'n arfer, dylanwad neu reolaeth sylweddol dros y cwmni. Fel y nodir yn y <a class="govuk-link" href="https://www.gov.uk/government/publications/guidance-to-the-people-with-significant-control-requirements-for-companies-and-limited-liability-partnerships" target="_blank">canllawiau i berson â rheolaeth sylweddol</a>.

source: Has other significant influence or control
cy: Mae ganddo ddylanwad neu reolaeth sylweddol

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_HasVotingRightsHint
source: Directly or indirectly holds more than 25% of the voting rights in the company
cy: Mae'n dal mwy na 25% o'r hawliau pleidleisio yn y cwmni yn uniongyrchol neu'n anuniongyrchol

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_HasVotingRightsLabel
source: Has voting rights
cy: Mae ganddo hawliau pleidleisio

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_Heading
source: Which specified conditions of control does {0} have?
cy: Pa amodau rheolaeth penodol sydd gan {0}?

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_Hint
source: As defined in <a class="govuk-link" href="https://www.legislation.gov.uk/ukpga/2006/46/schedule/1A/part/1?timeline=false" target="_blank">part 1 schedule 1a of the Companies Act 2006</a>. Select all that apply.
cy: Fel y nodir yn <a class="govuk-link" href="https://www.legislation.gov.uk/ukpga/2006/46/schedule/1A/part/1?timeline=false" target="_blank">rhan 1 atodlen 1a o Ddeddf Cwmnïau 2006 (bydd yn agor mewn tab newydd)</a>. Dewiswch bob un sy'n berthnasol.

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_NoneApplyLabel
source: None apply
cy: Dim un yn gymwys

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_OwnsSharesHint
source: Directly or indirectly holds more than 25% of the company's shares
cy: Mae'n dal mwy na 25% o gyfranddaliadau'r cwmni yn uniongyrchol neu'n anuniongyrchol

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_OwnsSharesLabel
source: Owns shares
cy: Mae'n berchen ar gyfranddaliadau

# Supplier_ConnectedEntity_ConnectedEntityControlCondition_SelectConditionError
source: Select specified conditions of control
cy: Dewiswch amodau rheolaeth penodol

# Supplier_ConnectedEntity_ConnectedEntityDeclaration_PageTitle
source: Connected person
cy: Person cysylltiedig

# Supplier_ConnectedEntity_ConnectedEntityDeclaration_Paragraph1
source: A ‘connected person’ is someone who influences or controls your company.
cy: ‘Person cysylltiedig’ yw rhywun sydd â dylanwad neu reolaeth dros eich cwmni.

# Supplier_ConnectedEntity_ConnectedEntityDirectorResidency_Heading
source: What country does {0} usually live in?
cy: Ym mha wlad y mae {0} yn byw fel arfer?

# Supplier_ConnectedEntity_ConnectedEntityIndividualCategory_CategoryOption_PSC
source: person with significant control
cy: person â rheolaeth sylweddol

source: director or individual with the same responsibilities
cy: cyfarwyddwr neu unigolyn â'r un cyfrifoldebau

source: any other individual with significant influence or control
cy: unrhyw unigolyn arall â dylanwad neu reolaeth sylweddol

# Supplier_ConnectedEntity_ConnectedEntityIndividualCategory_Director
source: Director or individual with the same responsibilities
cy: Cyfarwyddwr neu unigolyn â'r un cyfrifoldebau

# Supplier_ConnectedEntity_ConnectedEntityIndividualCategory_Hint
source: The ‘connected person’ that has control or influence over your organisation should fall into one of these categories.
cy: Dylai'r ‘person cysylltiedig’ sydd â rheolaeth neu ddylanwad dros eich sefydliad fod wedi'i gynnwys yn un o'r categorïau hyn.

source: Any other individual with significant influence or control
cy: Unrhyw unigolyn arall â dylanwad neu reolaeth sylweddol

# Supplier_ConnectedEntity_ConnectedEntityIndividualCategory_PSC
source: Person with significant control
cy: Person â rheolaeth sylweddol

# Supplier_ConnectedEntity_ConnectedEntityIndividualCategory_PageTitle
source: Select the category that best describes the 'connected person'
cy: Dewiswch y categori sy'n disgrifio'r ‘person cysylltiedig’ orau

# Supplier_ConnectedEntity_ConnectedEntityIndividualCategory_SelectCategoryError
source: Select the category that best describes the 'connected person'
cy: Dewiswch y categori sy'n disgrifio'r ‘person cysylltiedig’ orau

# Supplier_ConnectedEntity_ConnectedEntityLawEnforce_Heading
source: Which law enforces {0}'s legal form?
cy: Pa gyfraith sy'n gorfodi ffurf gyfreithiol {0}?

# Supplier_ConnectedEntity_ConnectedEntityLawEnforce_LawRegisteredRequiredError
source: Enter which law enforces it
cy: Rhowch pa gyfraith sy'n gorfodi hyn

# Supplier_ConnectedEntity_ConnectedEntityLawRegister_LawEnforcesHint
source: For example, Companies Act 2006
cy: Er enghraifft, Deddf Cwmnïau 2006.

# Supplier_ConnectedEntity_ConnectedEntityLawRegister_LawEnforcesLabel
source: Which law enforces it?
cy: Pa gyfraith sy'n gorfodi hyn?

# Supplier_ConnectedEntity_ConnectedEntityLawRegister_LawEnforcesRequiredError
source: Enter law
cy: Rhowch gyfraith

# Supplier_ConnectedEntity_ConnectedEntityLawRegister_LegalFormQuestion
source: What is {0}'s legal form?
cy: Beth yw ffurf gyfreithiol {0}?

# Supplier_ConnectedEntity_ConnectedEntityLawRegister_LegalFormRequiredError
source: Enter legal formation
cy: Rhowch ffurf gyfreithiol

# Supplier_ConnectedEntity_ConnectedEntityLawRegister_LegalFormationHint
source: When it was set up and registered, what structure was used. Also called trading status. For example, a limited company or limited liability partnership.
cy: Pan gafodd ei sefydlu a'i gofrestru, pa strwythur a ddefnyddiwyd? A elwir hefyd yn statws masnachu. Er enghraifft, cwmni cyfyngedig neu bartneriaeth atebolrwydd cyfyngedig

# Supplier_ConnectedEntity_ConnectedEntityLawRegister_LegalFormationLabel
source: Legal formation
cy: Ffurf gyfreithiol

# Supplier_ConnectedEntity_ConnectedEntityLegalFormQuestion_Heading
source: Does {0} have a legal form?
cy: A oes gan {0} ffurf gyfreithiol?
