Repository: cabinetoffice/GCGS-Central-Digital-Platform
Catalog: Services/CO.CDP.Localization/StaticTextResource.*.resx
Languages: cy

# PrivacyPolicy_Title
source: Agree to the privacy notice
cy: Cytuno â'r hysbysiad preifatrwydd

# PrivacyPolicy_YesIHaveReadAndAgreePrivacyPolicy
source: I have read and agree to the privacy notice
cy: Rwyf wedi darllen yr hysbysiad preifatrwydd ac rwy'n cytuno arno

# PrivacyPolicy_Intro
source: The privacy notice explains how we process your data, how we use it and who it's shared with.
cy: Mae'r polisi preifatrwydd yn esbonio sut rydym yn prosesu eich data, sut rydym yn eu defnyddio, a gyda phwy y caiff eu rhannu.

# PrivacyPolicy_BeforeYouContinue
source: Before you continue, you must read and agree to the <a class="govuk-link" target="_blank" href="/privacy-notice">privacy notice (opens in new tab)</a>.
cy: Cyn i chi barhau, mae'n rhaid i chi ddarllen yr <a class="govuk-link" target="_blank" href="/privacy-notice">hysbysiad preifatrwydd a chytuno arno (agor mewn tab newydd)</a>.

# PrivacyPolicy_SelectReadAndAgreeToPrivacyPolicy
source: Select if you have read and agree to the Central Digital Platform service privacy policy
cy: Dewiswch os ydych wedi darllen polisi preifatrwydd y gwasanaeth Llwyfan Digidol Canolog ac yn cytuno iddo

# ProvideFeedbackAndContact_ASpecificPage
source: A specific page
cy: Tudalen benodol

# ProvideFeedbackAndContact_ChooseAnOption
source: Choose an option
cy: Dewiswch opsiwn

# ProvideFeedbackAndContact_DoNotIncludePersonalOrFinancialInformation
source: Do not include personal or financial information like your National Insurance number or credit card details
cy: Peidiwch â chynnwys gwybodaeth bersonol nac ariannol, er enghraifft eich rhif Yswiriant Gwladol neu fanylion eich cerdyn credyd

# ProvideFeedbackAndContact_EnterAName
source: Enter a name
cy: Rhowch enw

# ProvideFeedbackAndContact_EnterEmailAddress
source: Enter an email address
cy: Rhowch gyfeiriad e-bost

# ProvideFeedbackAndContact_EnterUrlOrNameOfPage
source: Enter URL or name of page
cy: Rhowch URL neu enw'r dudalen

# ProvideFeedbackAndContact_EnterYourFeedback
source: Enter your feedback
cy: Rhowch eich adborth

# ProvideFeedbackAndContact_GiveUsYourDetailsIfYouWantAReply
source: Give us your details if you want a reply (optional)
cy: Rhowch eich manylion os hoffech gael ymateb (dewisol)

# ProvideFeedbackAndContact_MessageFieldCannotBeEmpty
source: The message field cannot be empty
cy: Ni all y parth neges fod yn wag

# ProvideFeedbackAndContact_ProvideFindATenderFeedback
source: Provide Find a Tender Feedback
cy: Rhoi Adborth ar Canfod Tendr

# ProvideFeedbackAndContact_SpecificPage
source: Specific page
cy: Tudalen benodol

# ProvideFeedbackAndContact_TheWholeService
source: The whole service
cy: Y gwasanaeth cyfan

# ProvideFeedbackAndContact_ThisFormIsToRaiseIssues
source: This form is to raise issues or support requests related to Find a Tender website.
cy: Diben y ffurflen hon yw eich galluogi i godi materion neu wneud cais am gymorth mewn perthynas â gwefan Canfod Tendr.

# ProvideFeedbackAndContact_UrlOfPageRequired
source: URL of specific page is required
cy: Mae angen URL y dudalen benodol

# ProvideFeedbackAndContact_UseThisFormToAskAQuestion
source: Use this form to ask a question, report a problem or suggest an improvement to the Find a Tender service team.
cy: Defnyddiwch y ffurflen hon i ofyn cwestiwn, rhoi gwybod am broblem neu awgrymu gwelliant i dîm gwasanaeth Canfod Tendr.

# ProvideFeedbackAndContact_WellOnlyUseThisToReplyToYourMessage
source: We'll only use this to reply to your message
cy: Dim ond er mwyn ymateb i'ch neges y byddwn yn defnyddio'r ffurflen hon

# ProvideFeedbackAndContact_WhatAreTheDetails
source: What are the details?
cy: Beth yw'r manylion?

# ProvideFeedbackAndContact_WhatsItToDoWith
source: What's it to do with?
cy: At beth y mae'n cyfeirio?

# ProvideFeedbackAndContact_YouCanAskAQuestion
source: You can ask a question, report a problem or suggest an improvement to the Find a Tender team.
cy: Gallwch ofyn cwestiwn, rhoi gwybod am broblem neu awgrymu gwelliant i dîm Canfod Tendr.

# ShareYourInformation_CreateShareCodeButton
source: Create share code
cy: Creu cod rhannu

# ShareYourInformation_CreatedOn
source: Created on
cy: Crëwyd ar

# ShareYourInformation_HowItWorksParagraph1
source: To share your supplier information with buyers you need to create a share code and file, and declare that the information is correct.
cy: Er mwyn rhannu eich gwybodaeth am y cyflenwr â phrynwyr, bydd angen i chi greu ffeil a chod rhannu, a datgan bod y wybodaeth yn gywir.

# ShareYourInformation_HowItWorksParagraph2
source: This saves a snapshot of the supplier information you provided about your organisation, connected persons, exclusions and financial information.
cy: Bydd hyn yn cadw copi o'r wybodaeth am y cyflenwr y gwnaethoch ei rhoi ar gyfer eich sefydliad, unigolion cysylltiedig, gwaharddiadau a gwybodaeth ariannol.

# ShareYourInformation_HowItWorksParagraph3
source: When you submit a bid for a procurement, the contracting authority will let you know how to give them the share code or file.
cy: Pan fyddwch yn gwneud cynnig am gaffaeliad, bydd yr awdurdod contractio yn rhoi gwybod i chi sut i ddarparu'r ffeil neu god rhannu.

# ShareYourInformation_HowItWorksParagraph4
source: You can update your supplier information whenever it changes but you must create a new share code and file to share the new information.
cy: Os bydd eich gwybodaeth am y cyflenwr yn newid, gallwch ei diweddaru a chreu ffeil neu god rhannu newydd er mwyn rhannu'r wybodaeth newydd.

# ShareYourInformation_HowItWorksSummary
source: How it works
cy: Sut mae'n gweithio

# ShareYourInformation_ShareCode
source: Share code
cy: Cod rhannu

# ShareYourInformation_ShareCodeCreated
source: Share code created
cy: Cod rhannu wedi'i greu

# ShareYourInformation_ShareCodeCreatedFooterBody1
source: You can save your share code and <a class="govuk-link" href="?handler=download&shareCode={0}">download your supplier information file</a> or come back and get them when needed.
cy: Gallwch gadw eich cod rhannu a <a class="govuk-link" href="?handler=download&shareCode={0}">lawrlwytho'r ffeil wybodaeth am y cyflenwr</a> neu ddychwelyd pan fydd eu hangen arnoch.

# ShareYourInformation_ShareCodeCreatedFooterBody2
source: If your supplier information changes, you can update it and create a new share code and file to share the new information.
cy: Os bydd eich gwybodaeth am y cyflenwr yn newid, gallwch ei diweddaru a chreu ffeil neu god rhannu newydd er mwyn rhannu'r wybodaeth newydd.

# ShareYourInformation_TableCaption
source: Your share codes and supplier information files
cy: Eich codau rhannu a ffeiliau gwybodaeth am y cyflenwr

# ShareYourInformation_TableHeaderCreatedOn
source: Created on
cy: Crëwyd ar

# ShareYourInformation_TableHeaderShareCodes
source: Share codes
cy: Codau rhannu

# ShareYourInformation_Title
source: Share your supplier information
cy: Rhannu eich gwybodaeth am y cyflenwr

# ShareYourInformation_YourShareCode
source: Your share code
cy: Eich cod rhannu

# Shared_Address_AddressLine1_ErrorMessage
source: Enter address line 1, typically the building and street
cy: Rhowch linell 1 y cyfeiriad, sef yr adeilad a'r stryd fel arfer.

# Shared_Address_ValidationErrorMessage
source: Invalid country name
cy: Enw gwlad annilys

# Supplementary_CloseThisWindow
source: Close this window
cy: Cau'r ffenestr hwn

# Supplementary_ContactUs_Failure_Description
source: Your message could not be sent. Try again or come back later.
cy: Nid oedd modd anfon eich neges. Rhowch gynnig arall arni neu dewch yn ôl yn nes ymlaen

# Supplementary_ContactUs_Failure_Heading
source: There is a problem with the service
cy: Mae problem gyda'r gwasanaeth

# Supplementary_ContactUs_Failure_Title
source: Failed to send
cy: Methwyd ag anfon

# Supplementary_ContactUs_Message_ErrorMessage
source: Enter your message
cy: Rhowch eich neges

# Supplementary_ContactUs_Message_ValidationErrorMessage
source: Message must be between 10 and 10,000 characters
cy: Mae'n rhaid i'r neges fod rhwng 10 a 10,000 a nodau

# Supplementary_ContactUs_Name_ErrorMessage
source: Enter your name
cy: Rhowch eich enw

# Supplementary_ContactUs_Send
source: Send
cy: Anfon

# Supplementary_ContactUs_SupportTeam
source: Our support team will contact you by email, Monday to Friday from 9am to 5pm, excluding bank holidays.
cy: Bydd ein tîm cymorth yn cysylltu â chi drwy e-bost, rhwng 9am a 5pm o ddydd Llun i ddydd Gwener, ac eithrio gwyliau banc.

# Supplementary_CookieDetails_ChangeSettings
source: Change your settings
cy: Newid eich gosodiadau

# Supplementary_CookieDetails_ChangeSettingsInfo
source: You can <a class="govuk-link" href="/cookies">change which cookies you're happy for us to use</a>.
cy: Gallwch <a class="govuk-link" href="/cookies">newid pa gwcis rydych yn hapus i ni eu defnyddio</a>.

# Supplementary_CookieDetails_GoogleAnalyticsInfo
source: Google Analytics stores information about:
cy: Mae Google Analytics yn storio gwybodaeth am y canlynol:

# Supplementary_CookieDetails_Intro
source: Find a Tender puts small files (known as ‘cookies’) onto your computer to collect information about how you browse the site. Find out more about the cookies we use, what they’re for and when they expire.
cy: Mae Canfod Tendr yn rhoi ffeiliau bach (neu ‘cwcis’) ar eich cyfrifiadur er mwyn casglu gwybodaeth yngl?n â sut rydych yn pori'r wefan. Rhagor o wybodaeth am y cwcis rydym yn eu defnyddio, beth yw eu diben a phryd y byddant yn dod i ben.

# Supplementary_CookieDetails_KeepingSignedIn
source: Keeping you signed in
cy: Eich cadw wedi'ch mewngofnodi

# Supplementary_CookieDetails_ListItem2
source: the pages you visit on GOV.UK and how long you spend on them
cy: y tudalennau rydych yn ymweld â nhw ar GOV.UK a faint o amser rydych yn ei dreulio arnynt

# Supplementary_CookieDetails_ListItem4
source: Google Analytics sets the following cookies.
cy: Mae Google Analytics yn gosod y cwcis canlynol.

# Supplementary_CookieDetails_SignedInInfo
source: When you sign in to the service, we’ll set cookies to keep you signed in as you use the site. These cookies do not store your personal data and are deleted when you close your browser.
cy: Pan fyddwch yn mewngofnodi i’r gwasanaeth, byddwn yn gosod cwcis er mwyn gwneud yn si?r eich bod wedi'ch mewngofnodi drwy gydol y cyfnod y byddwch yn defnyddio’r wefan. Nid yw'r cwcis hyn yn storio eich data personol a byddant yn cael eu dileu pan fyddwch yn cau eich porwr.

# Supplementary_CookieDetails_TableHeader_Expires
source: Expires
cy: Y dod i ben

# Supplementary_CookieDetails_TableHeader_Purpose
source: Purpose
cy: Diben

# Supplementary_CookieDetails_TableRow_Antiforgery
source: This cookie keeps the service secure, preventing cross-site forgery requests.
cy: Mae'r cwci hwn yn cadw'r gwasanaeth yn ddiogel, drwy atal ceisiadau wedi'u ffugio ar draws gwefannau.

# Supplementary_CookieDetails_TableRow_Cookies
source: Stores details of the currently authenticated user.
cy: Mae'n storio manylion y defnyddiwr sydd wedi'i ddilysu ar y pryd.

# Supplementary_CookieDetails_TableRow_Culture
source: Stores the currently selected language requirement.
cy: Mae'n storio'r gofynion iaith a ddewiswyd ar y pryd.

# Supplementary_CookieDetails_TableRow_Preferences
source: Stores the cookies accept / reject preference.
cy: Mae'n storio dewisiadau derbyn/gwrthod y cwci.

# Supplementary_CookieDetails_Title
source: Details about cookies on Find a Tender
cy: Manylion am gwcis ar Canfod Tendr

# Supplementary_CookieDetails_WebsiteUse
source: Cookies that measure website use
cy: Cwcis sy'n mesur y defnydd o'r wefan

# Supplementary_Cookies_DoNotUseCookies
source: Do not use cookies that measure my website use
cy: Peidiwch â defnyddio cwcis sy'n mesur fy nefnydd o'r wefan

# Supplementary_Cookies_FindOutMore
source: Find out more about cookies on Find a Tender
cy: Rhagor o wybodaeth am gwcis ar Canfod Tendr

# Supplementary_Cookies_GoogleAnalytics
source: We use Google Analytics to measure how you use the website so we can improve it based on user needs. We do not allow Google to use or share the data about how you use this site.
cy: Rydym yn defnyddio Google Analytics i fesur sut rydych yn defnyddio'r wefan er mwyn i ni allu ei gwella yn seiliedig ar anghenion defnyddwyr. Nid ydym yn caniatáu i Google ddefnyddio na rhannu'r data yngl?n â sut rydych yn defnyddio'r wefan hon.

# Supplementary_Cookies_GoogleAnalyticsInfo
source: Google Analytics sets cookies that store anonymised information about:
cy: Mae Google Analytics yn gosod cwcis sy'n storio gwybodaeth ddienw yngl?n â:

# Supplementary_Cookies_GovServices
source: Government services
cy: Gwasanaethau'r Llywodraeth

# Supplementary_Cookies_GovServices_Info
source: Most services we link to are run by different government departments, for example DWP’s Universal Credit online, DVLA’s vehicle tax service, or HMRC’s webchat. These services may set additional cookies and, if so, will have their own cookie policy and banner linking to it.
cy: Mae'r rhan fwyaf o’r gwasanaethau rydym yn cynnwys dolenni iddynt yn cael eu rhedeg gan adrannau gwahanol o'r llywodraeth, er enghraifft gwasanaeth Credyd Cynhwysol ar-lein yr Adran Gwaith a Phensiynau, gwasanaeth treth cerbyd DVLA, neu wasanaeth gwe-sgwrsio CThEF. Mae’n bosibl y bydd y gwasanaethau hyn yn gosod cwcis ychwanegol ac, os felly, bydd ganddynt eu polisi cwcis eu hunain a baner yn cynnwys dolen iddo.

# Supplementary_Cookies_Intro1
source: Cookies are files saved on your phone, tablet or computer when you visit a website.
cy: Ffeiliau sy'n cael eu cadw ar eich ffôn, llechen neu gyfrifiadur pan fyddwch yn ymweld â gwefan yw cwcis.

# Supplementary_Cookies_Intro2
source: We use cookies to store information about how you use the Find a Tender website, such as the pages you visit.
cy: Rydym yn defnyddio cwcis i storio gwybodaeth yngl?n â sut rydych yn defnyddio gwefan Canfod Tendr, er enghraifft y tudalennau rydych yn ymweld â nhw.

# Supplementary_Cookies_ListItem1
source: how you got to the site
cy: sut y gwnaethoch gyrraedd y safle

# Supplementary_Cookies_ListItem2
source: the pages you visit on Find a Tender and how long you spend on each page
cy: y tudalennau rydych yn ymweld â nhw ar wefan Canfod Tendr a faint o amser rydych yn ei dreulio ar bob tudalen

# Supplementary_Cookies_ListItem3
source: what you click on while you’re visiting the site
cy: yr hyn rydych yn clicio arno wrth ymweld â'r wefan

# Supplementary_Cookies_SaveChanges
source: Save changes
cy: Cadw’r newidiadau

# Supplementary_Cookies_Settings
source: Cookie settings
cy: Gosodiadau cwcis

# Supplementary_Cookies_Settings_Intro
source: We use 2 types of cookie. You can choose which types you’re happy for us to use, except for those that are essential.
cy: Rydym yn defnyddio dau fath o gwci. Gallwch ddewis pa fathau rydych yn hapus i ni eu defnyddio, heblaw'r rhai sy'n hanfodol.

# Supplementary_Cookies_StrictlyNecessary
source: Strictly necessary cookies
cy: Cwcis cwbl angenrheidiol

# Supplementary_Cookies_StrictlyNecessary_Info1
source: These essential cookies do things like remember when you are signed in, the language you want to view the site in, and the notifications you’ve seen so we do not show them to you again.
cy: Mae’r cwcis hanfodol hyn yn gwneud pethau fel cofio pan fyddwch wedi'ch mewngofnodi, ym mha iaith rydych am weld y wefan, a’r hysbysiadau rydych wedi’u gweld fel na fyddwn yn eu dangos i chi eto.

# Supplementary_Cookies_StrictlyNecessary_Info2
source: They always need to be on.
cy: Bydd angen i'r rhain gael eu caniatáu bob amser.

# Supplementary_Cookies_Title
source: Cookies on Find a Tender
cy: Cwcis ar Canfod Tendr

# Supplementary_Cookies_UseCookies
source: Use cookies that measure my website use
cy: Defnyddiwch gwcis sy'n mesur fy nefnydd o'r wefan

# Supplementary_Cookies_WebsiteUse
source: Cookies that measure website use
cy: Cwcis sy'n mesur y defnydd o'r wefan

# Supplementary_Error_Title
source: Sorry, there is a problem with the service
cy: Mae'n ddrwg gennym, mae problem gyda'r wefan.

# Supplementary_Error_TryAgain
source: Try again later.
cy: Rhowch gynnig arall arni yn nes ymlaen.

# Supplementary_Index_AlreadyRegistered
source: If your organisation is already registered
cy: Os yw eich sefydliad eisoes wedi'i gofrestru

# Supplementary_Index_ContractingAuthority
source: a contracting authority working in procurement who buys goods, works, and services, supplies them, or both
cy: awdurdod contractio sy'n gweithio ym maes caffael sy'n prynu nwyddau, gwaith a gwasanaethau, yn eu cyflenwi, neu'r ddau

# Supplementary_Index_CreateLogin
source: You will need to <a class="govuk-link govuk-link--no-visited-state" id="one-login-anchor" href="/one-login/sign-in">create a GOV.UK One Login or sign in.</a>
cy: Bydd angen i chi <a class="govuk-link govuk-link--no-visited-state" id="one-login-anchor" href="/one-login/sign-in">greu cyfrif GOV.UK One Login neu fewngofnodi.</a>

# Supplementary_Index_Intro
source: The Central Digital Platform (CDP) service is for both procurement professionals and suppliers in the UK's public and utilities sectors.
cy: Mae gwasanaeth y Llwyfan Digidol Canolog wedi'i anelu at weithwyr proffesiynol ym maes caffael a chyflenwyr yn sector cyhoeddus a sector cyfleustodau'r DU.

# Supplementary_Index_Organisation
source: an organisation or sole trader who applies for contracts to supply goods, works, and services
cy: sefydliad neu unig fasnachwr sy'n gwneud cais am gontractau i gyflenwi nwyddau, gwaith a gwasanaethau

# Supplementary_Index_Problem
source: There is a problem
cy: Mae problem wedi codi

# Supplementary_Index_SignIn
source: You can <a class="govuk-link govuk-link--no-visited-state" href="/one-login/sign-in">sign in to your account.</a>
cy: Gallwch <a class="govuk-link govuk-link--no-visited-state" href="/one-login/sign-in">fewngofnodi i'ch cyfrif.</a>

# Supplementary_Index_Title
source: Register your details as a buyer or supplier of procurements
cy: Cofrestrwch eich manylion fel prynwr neu gyflenwr caffaeliadau

# Supplementary_Index_UseService
source: Use the service if you are:
cy: Defnyddiwch y gwasanaeth os ydych:

# Supplementary_PageNotFound_PastedAddress
source: If you pasted the web address, check you copied the entire address.
cy: Os gwnaethoch ludo’r cyfeiriad gwe, gwnewch yn si?r eich bod wedi copïo’r cyfeiriad cyfan.

# Supplementary_PageNotFound_Title
source: Page not found
cy: Heb ddod o hyd i’r dudalen

# Supplementary_PageNotFound_TypedAddress
source: If you typed the web address, check it is correct.
cy: Os gwnaethoch deipio’r cyfeiriad gwe, gwnewch yn si?r ei fod yn gywir.

# SupplierInformationStatus_StepStatus_InProcess
source: In progress
cy: Yn mynd rhagddo

# SupplierToBuyer_OrganisationSummary_BuyerDetails
source: Buyer details
cy: Manylion y prynwr

# SupplierToBuyer_OrganisationType_BuyerType
source: BuyerOrganisationType
cy: Math o Sefydliad Prynu

# SupplierToBuyer_OrganisationType_BuyerTypeOthers
source: Others
cy: Eraill

# Supplier_ConnectedEntity_Address_EnterAddress_Heading
source: Enter {0}'s address
cy: Rhowch gyfeiriad {0}

# Supplier_ConnectedEntity_Address_EnterPostalAddress_Heading
source: Enter {0}'s postal address
cy: Rhowch gyfeiriad post {0}

# Supplier_ConnectedEntity_Address_EnterRegisteredAddress_Heading
source: Enter {0}'s registered address
cy: Rhowch gyfeiriad cofrestredig {0}

source: Change<span class="govuk-visually-hidden"> the company name</span>
cy: Newid<span class="govuk-visually-hidden"> enw'r cwmni</span>

source: Change<span class="govuk-visually-hidden"> the conditions of control</span>
cy: Newid<span class="govuk-visually-hidden"> yr amodau rheoli</span>

source: Change<span class="govuk-visually-hidden"> the "enforced by" law</span>
cy: Newid<span class="govuk-visually-hidden"> y gyfraith "gorfodir gan"</span>

source: Change<span class="govuk-visually-hidden"> the insolvency date</span>
cy: Newid<span class="govuk-visually-hidden"> dyddiad yr ansolfedd</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_ChangeLegalForm
source: Change<span class="govuk-visually-hidden">the legal form </span>
cy: Newid<span class="govuk-visually-hidden">y ffurf gyfreithiol </span>

source: Change<span class="govuk-visually-hidden"> the legal form and law</span>
cy: Newid<span class="govuk-visually-hidden"> y ffurf gyfreithiol a'r gyfraith</span>

source: Change<span class="govuk-visually-hidden"> the registered with overseas equivalent</span>
cy: Newid<span class="govuk-visually-hidden"> y corff tramor cyfatebol y cofrestrwyd ag ef</span>

source: Change<span class="govuk-visually-hidden"> the postal address</span>
cy: Newid<span class="govuk-visually-hidden"> y cyfeiriad post</span>

source: Change<span class="govuk-visually-hidden"> the register name</span>
cy: Newid<span class="govuk-visually-hidden"> yr enw cofrestredig</span>

source: Change<span class="govuk-visually-hidden">the registered address</span>
cy: Newid<span class="govuk-visually-hidden">y cyfeiriad cofrestredig</span>

source: Change<span class="govuk-visually-hidden"> the registered date</span>
cy: Newid<span class="govuk-visually-hidden"> y dyddiad cofrestru</span>

source: Companies House registered:
cy: Wedi'i gofrestru â Th?'r Cwmnïau:

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_CompanyName
source: Company name
cy: Enw'r cwmni

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_InsolvencyDate
source: Insolvency date
cy: Dyddiad yr ansolfedd

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswersOrganisation_OnDate
source: On {0}
cy: Ar {0}

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ChangeControlConditions
source: Change<span class="govuk-visually-hidden"> the conditions of control</span>
cy: Newid<span class="govuk-visually-hidden"> yr amodau rheoli</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ChangeDirectorResidency
source: Change<span class="govuk-visually-hidden"> the director's residency</span>
cy: Newid<span class="govuk-visually-hidden"> preswylfa'r cyfarwyddwr</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ChangePSCDetails
source: Change<span class="govuk-visually-hidden"> the person of significant control's details</span>
cy: Newid<span class="govuk-visually-hidden"> manylion y person â rheolaeth sylweddol</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ChangePostalAddress
source: Change<span class="govuk-visually-hidden"> the postal address</span>
cy: Newid<span class="govuk-visually-hidden"> y cyfeiriad post</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ChangeRegisterName
source: Change<span class="govuk-visually-hidden"> the register name</span>
cy: Newid<span class="govuk-visually-hidden"> yr enw cofrestredig</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ChangeRegisteredAddress
source: Change<span class="govuk-visually-hidden"> the registered address</span>
cy: Newid<span class="govuk-visually-hidden">y cyfeiriad cofrestredig</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_ChangeRegisteredAsPSC
source: Change<span class="govuk-visually-hidden"> the registered as PSC date</span>
cy: Newid<span class="govuk-visually-hidden"> dyddiad cofrestru'r person â rheolaeth sylweddol</span>

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_DirectorResidency
source: Director's residency
cy: Preswylfa'r cyfarwyddwr

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_DoB
source: Date of birth
cy: Dyddiad geni

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_OnDate
source: On {0}
cy: Ar {0}

# Supplier_ConnectedEntity_ConnectedEntityCheckAnswers_PSCDetails
source: PSC details
cy: Manylion y Person â Rheolaeth Sylweddol
